{"id":"2BCfkBRHmbhytY8nmBMKKaNiCqf6PfbL8PmLk7NHv3RxtZMMUyPzot","title":"Communications Psychology","displayTitle":"Communications Psychology","url":"https://www.nature.com/commspsychol.rss","feedLink":"http://feeds.nature.com/commspsychol/rss/current","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":8,"items":[{"title":"Individuals with methamphetamine use disorder show reduced directed exploration and learning rates independent of an aversive interoceptive state induction","url":"https://www.nature.com/articles/s44271-025-00269-8","date":1749254400,"author":"Ryan Smith","guid":38,"unread":true,"content":"Computational modeling revealed that individuals with methamphetamine use disorder show reduced information-seeking and slower belief-updating when trying to maximize long-term reward. This might create difficulties initiating/maintaining abstinence.","contentLength":250,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ingroup favoritism and outgroup derogation in intergenerational cooperation","url":"https://www.nature.com/articles/s44271-025-00272-z","date":1749168000,"author":"Nobuhiro Mifune","guid":37,"unread":true,"content":"Two experimental studies using the intergenerational sustainable dilemma game found that people made more sustainable choices when future beneficiaries were ingroup members, and less when they were outgroup members.","contentLength":215,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Psychological, social, and health-related factors predict risk for financial exploitation","url":"https://www.nature.com/articles/s44271-025-00266-x","date":1749081600,"author":"David V. Smith","guid":36,"unread":true,"content":"Results from three studies that examined 1918 U.S. adults show that financial exploitation risk is heightened by a complex interplay of sociodemographic, health, cognitive, and psychosocial vulnerabilities.","contentLength":206,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Decoding words during sentence production with ECoG reveals syntactic role encoding and structure-dependent&#xa0;temporal dynamics","url":"https://www.nature.com/articles/s44271-025-00270-1","date":1748908800,"author":"Adeen Flinker","guid":35,"unread":true,"content":"Using electrical recordings taken from the surface of the brain, researchers decode what words neurosurgical patients are saying and show that the brain plans words in a different order than they are ultimately spoken.","contentLength":218,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Semantic priming modulates the strength and direction of the Kanizsa illusion","url":"https://www.nature.com/articles/s44271-025-00268-9","date":1748304000,"author":"Liad Mudrik","guid":34,"unread":true,"content":"This study demonstrates that semantic priming can either increase or decrease perception of the Kanizsa illusion. The results support cognitive penetrability, demonstrating top-down influences on illusory perceptual experience.","contentLength":227,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Long-term elevated levels of loneliness are linked to lower health-related quality of life in middle-aged Australian women","url":"https://www.nature.com/articles/s44271-025-00264-z","date":1748217600,"author":"Ding Ding","guid":33,"unread":true,"content":"A latent class analysis of long-term loneliness patterns over 18 years found consistent associations with physical and mental health-related quality of life in middle-aged and older women, emphasising the need to address loneliness to improve women’s health and well-being.","contentLength":275,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The influence of mental state attributions on trust in large language models","url":"https://www.nature.com/articles/s44271-025-00262-1","date":1748131200,"author":"Stephen M. Fleming","guid":32,"unread":true,"content":"Attributions of distinct mental capacities to AI are shown to differentially relate to trust in advice. Mental states related to intelligence positively predicted trust, whereas attributions of experience were negatively related to advice-taking.","contentLength":246,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Extinction context is learned by pigeons, not given by the environment","url":"https://www.nature.com/articles/s44271-025-00261-2","date":1748044800,"author":"Jonas Rose","guid":31,"unread":true,"content":"Context is critical yet poorly defined. Using extinction learning in pigeons, we show that context is not given but learned. With the right properties, even small cues can trigger renewal, challenging classical views of context as passive background.","contentLength":250,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["journal","psychology"]}