{"id":"2BCfkBRHmbhytY8nm9sD6vE8czwYa5H717nYaCWMiycPdB3SX9QsL6","title":"Neuron","displayTitle":"Neuron","url":"https://www.cell.com/neuron/current.rss","feedLink":"https://www.cell.com/current?publicationCode=neuron&rss=yes","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":7,"items":[{"title":"Not just neurons: The diverse cellular landscape of learning and memory","url":"https://www.cell.com/neuron/fulltext/S0896-6273(25)00352-6?rss=yes","date":1748995200,"author":"Cristina M. Alberini","guid":40,"unread":true,"content":"<article>Research on learning and memory has primarily focused on neurons. This perspective argues that understanding the biology of memory demands a comprehensive approach that encompasses not only neurons but all types of brain cells, including glial and vascular cells, and especially their interactions.</article>","contentLength":298,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A microglia identity crisis","url":"https://www.cell.com/neuron/fulltext/S0896-6273(25)00355-1?rss=yes","date":1748995200,"author":"Jessie Axsom, F. Chris Bennett","guid":41,"unread":true,"content":"<article>What makes a microglia a microglia? In a recent issue of Cell, Wu et al. discover immune cells with microglial gene expression, epigenetic profiles, and ontogeny in the peripheral nervous system of large vertebrates, calling into question long-standing assumptions about microglia identity.</article>","contentLength":290,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Pontospinal control of nociception via a negative feedback loop","url":"https://www.cell.com/neuron/fulltext/S0896-6273(25)00354-X?rss=yes","date":1748995200,"author":"Andrew D. Vigotsky, Adrien Tassou, Grégory Scherrer","guid":42,"unread":true,"content":"<article>The nociceptive apparatus has the remarkable ability to regulate itself by amplifying and attenuating nociception and thus pain in a context-dependent way. In this issue of Neuron, Li et al. identified a subpopulation of pontospinal projection neurons that dampen nociception in mice.</article>","contentLength":284,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Stem cell sidekicks: ILC2s boost brain healing with a dash of Areg","url":"https://www.cell.com/neuron/fulltext/S0896-6273(25)00294-6?rss=yes","date":1748995200,"author":"S. Thomas Carmichael","guid":43,"unread":true,"content":"<article>Stroke leads to a limited process of neural repair. In this issue of Neuron, Zhou et al. identify a new role for group 2 innate lymphoid cells (ILC2s), which mediate secretion of a key growth factor and behavioral recovery, in post-stroke neurogenesis.</article>","contentLength":252,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Shedding light on the α-synuclein fibril fuzzy coat","url":"https://www.cell.com/neuron/fulltext/S0896-6273(25)00305-8?rss=yes","date":1748995200,"author":"Joel C. Watts","guid":44,"unread":true,"content":"<article>The β-sheet-rich core region of α-synuclein fibrils is important for defining disease manifestation. In this issue of Neuron, Han et al. demonstrate that the comparatively less structured fibril fuzzy coat region also modulates α-synuclein seeding activity in neurons and mice.</article>","contentLength":280,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Combining old with new: A novel approach to studying human brain metabolism","url":"https://www.cell.com/neuron/fulltext/S0896-6273(25)00314-9?rss=yes","date":1748995200,"author":"Tyler Blazey, Manu S. Goyal","guid":45,"unread":true,"content":"<article>In this issue of Neuron, Wang et al. provide a detailed assessment of the metabolites and lipids utilized by the whole human brain. They report that the brain consumes glucose, lactate, glutamate, and triglycerides while producing glutamine, pyruvate, and free fatty acids.</article>","contentLength":273,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Activity-dependent development of the body’s touch receptors","url":"https://www.cell.com/neuron/fulltext/S0896-6273(25)00298-3?rss=yes","date":1747353600,"author":"Celine Santiago, Julianna Siegrist, Nusrat Africawala, Annie Handler, Aniqa Tasnim, Rabia Anjum, Josef Turecek, Brendan P. Lehnert, Sophia Renauld, Jinheon Choi, Michael Nolan-Tamariz, Michael Iskols, Alexandra R. Magee, Suzanne Paradis, Nikhil Sharma, David D. Ginty","guid":39,"unread":true,"content":"<article>Santiago et al. report that the mechanosensitive ion channel Piezo2 is required for the transcriptional and structural maturation of the primary sensory neurons that detect gentle touch and that Piezo2-dependent genes influence touch-sensory neuron innervation patterns. These findings reveal a role for mechanically evoked activity during mechanosensory neuron development.</article>","contentLength":374,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["journal","cognitive-neuroscience"]}