{"id":"2BCfkBRHmbhytY8nmBMKKaNiCqf6PfbL8PmLk7NHv3RxtZMMUyPzot","title":"Communications Psychology","displayTitle":"Communications Psychology","url":"https://www.nature.com/commspsychol.rss","feedLink":"http://feeds.nature.com/commspsychol/rss/current","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":8,"items":[{"title":"Non-random patterns in the co-occurrence and accumulation of adverse life events in two national panel datasets","url":"https://www.nature.com/articles/s44271-026-00394-y","date":1772150400,"author":"Lourens Waldorp","guid":34,"unread":true,"content":"Do adverse life events occur by chance? In two national panel studies covering over two decades, adverse life events show non-random co-occurrence and self-reinforcing accumulation, rather than arising from “bad luck” alone.","contentLength":228,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Natural language reveals that political partisans are more affectively aligned over political issues than partisan identities","url":"https://www.nature.com/articles/s44271-026-00430-x","date":1772064000,"author":"Yuan Chang Leong","guid":33,"unread":true,"content":"Large-scale computational analysis across Reddit comments and news articles finds partisan language to be less affectively divided over political issues than identity labels, suggesting meaningful affective alignment on contentious issues despite partisan animosity.","contentLength":266,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Shape-transitions of a morphing illusory contour can be decoded during multiple-object tracking from the ongoing EEG","url":"https://www.nature.com/articles/s44271-026-00427-6","date":1771977600,"author":"Mircea Ariel Schoenfeld","guid":31,"unread":true,"content":"Tracking multiple moving locations can be facilitated by an encapsulating illusory contour connecting all relevant locations. The ongoing EEG-signal can be used to decode topological transitions within this morphing illusory contour during tracking.","contentLength":249,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Country-level instability is related to a stronger perceived climate of polarization across 44 countries","url":"https://www.nature.com/articles/s44271-026-00422-x","date":1771977600,"author":"Brock Bastian","guid":32,"unread":true,"content":"Across 44 countries, dysfunctional and disruptive economic, political, governmental, and social conditions were associated with stronger perceptions of a polarized societal climate. Perceptions of anomie in society may partially explain these links.","contentLength":249,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Against frictionless AI","url":"https://www.nature.com/articles/s44271-026-00402-1","date":1771891200,"author":"Michael Inzlicht","guid":30,"unread":true,"content":"AI’s greatest strength—removing friction from work and relationships—is also a liability. Prioritizing outcome over process, it eliminates desirable difficulties that drive growth. By subtracting effort from life, AI risks removing the struggles that teach us, the loneliness that connects us, and the labor that makes life meaningful.","contentLength":341,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Experience sampling methods require more than numbers","url":"https://www.nature.com/articles/s44271-026-00416-9","date":1771804800,"author":"Katie Hoemann","guid":27,"unread":true,"content":"The experience sampling method (ESM) collects real-time reports of people’s feelings, actions, and surroundings, and originally included both numerical and open-ended responses. Whereas most studies today focus only on the numbers, we argue that open-ended responses should be collected and analyzed again, because they are essential for understanding what the numbers mean and for capturing context and the temporal order of experiences.","contentLength":440,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AI is turning research into a scientific monoculture","url":"https://www.nature.com/articles/s44271-026-00428-5","date":1771804800,"author":"Sander van der Linden","guid":28,"unread":true,"content":"The rush to study generative AI is producing a feedback loop of topical and methodological convergence, flattening scientific imagination and crowding out the pluralism needed to keep research adaptive, resilient, and intellectually generative.","contentLength":244,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Publisher Correction: Misspecified models create the appearance of adaptive control during value-based choice","url":"https://www.nature.com/articles/s44271-026-00419-6","date":1771804800,"author":"Amitai Shenhav","guid":29,"unread":true,"content":"Publisher Correction: Misspecified models create the appearance of adaptive control during value-based choice","contentLength":109,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["psychology"]}