{"id":"2BCfkBRHmbhytY8nm9sD6vE8czwYa5H717nYaCWMiycPdB3SX9QsL6","title":"Neuron","displayTitle":"Neuron","url":"https://www.cell.com/neuron/current.rss","feedLink":"https://www.cell.com/neuron/current?publicationCode=neuron&rss=yes","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":5,"items":[{"title":"Too aroused to be attractive","url":"https://www.cell.com/neuron/fulltext/S0896-6273(26)00049-8?rss=yes","date":1771372800,"author":"Michael Satchell, Paul Miller","guid":113,"unread":true,"content":"<article>In this issue of Neuron, Papadopoulos et al. demonstrate that stimulus encoding accuracy in auditory cortex rises and then falls with increasing arousal. Their model of stimulus-induced transitions between discrete, arousal-dependent attractor states of spiking neurons successfully accounts for their data.</article>","contentLength":307,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Stretched to meet the challenge of myelination","url":"https://www.cell.com/neuron/fulltext/S0896-6273(26)00041-3?rss=yes","date":1771372800,"author":"Wenlong Xia, Stephen P.J. Fancy","guid":114,"unread":true,"content":"<article>Myelin thickness and internode length are matched to axon caliber in the central nervous system (CNS), critical for optimal axonal action potential conduction. Dereddi et al.1 show that mechanotransduction channel TMEM63A in oligodendrocytes couples membrane stretch to Ca2+ signaling to refine myelin architecture.</article>","contentLength":315,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Protective ApoE variants eliminate toxic fats from neurons","url":"https://www.cell.com/neuron/fulltext/S0896-6273(26)00010-3?rss=yes","date":1771372800,"author":"Catherine M. Heffner, Gilbert Di Paolo","guid":115,"unread":true,"content":"<article>Ralhan et al. describe how lipidated particles of apolipoprotein E (ApoE) isoforms ApoE2 and ApoE3-Christchurch protect neurons from oxidative stress through the efflux of unsaturated and oxidized lipids via ABCA7. This mechanism ameliorated multiple dysfunctions observed in ApoE4 models.</article>","contentLength":289,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Burned by experience: Epigenetic inflammatory memory in neurons drives synaptopathy after infection","url":"https://www.cell.com/neuron/fulltext/S0896-6273(26)00043-7?rss=yes","date":1771372800,"author":"Jessica J. Ye, Francisco J. Quintana","guid":116,"unread":true,"content":"<article>Shammas et al. report that LCMV infection epigenetically primes hippocampal neurons for heightened responses to viral rechallenge, driving synaptopathy. These findings suggest epigenetic inflammatory memory in neurons, resembling previous observations in other CNS non-immune cells, and may guide therapeutic interventions.</article>","contentLength":323,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Identification of an engram ensemble mediating memory forgetting in the dentate gyrus","url":"https://www.cell.com/neuron/fulltext/S0896-6273(25)00987-0?rss=yes","date":1770076800,"author":"Shiqiang Hu, Jianfan Yang, Siqi Yin, Yijie Zhong, Yanzun An, Yuyang Guo, Zihan Zhai, Yi Zhong","guid":112,"unread":true,"content":"<article>Hu et al. show that the dentate gyrus engram comprises two neuronal ensembles: one supports remembering, and the other promotes forgetting. By shifting the balance between these ensembles via Rac1 signaling, the brain flexibly controls recall. Dysfunctions of the forgetting ensemble contribute to memory abnormalities in models of Alzheimer’s disease and autism.</article>","contentLength":365,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["cognitive-neuroscience"]}