{"id":"2ufhwNgM3qHKXR4MrsdSHGQRBi2wNKKW3bXV5dQEDqpgpHzFEQ4nCZooscN5GkzdmJASjfG2n","title":"Trends in Neurosciences","displayTitle":"Trends in Neurosciences","url":"https://www.cell.com/trends/neurosciences/inpress.rss","feedLink":"https://www.cell.com/archive?publicationCode=tins&rss=yes","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":7,"items":[{"title":"The neurobiology of postpartum depression","url":"https://www.cell.com/trends/neurosciences/fulltext/S0166-2236(25)00100-6?rss=yes","date":1749600000,"author":"Elizabeth S. Wenzel, Rebekah Frye, Roxann Roberson-Nay, Jennifer L. Payne","guid":50,"unread":true,"content":"<article>Postpartum depression (PPD) is the most common complication of pregnancy, posing significant health risks for both women and their children. Unlike other subtypes of major depressive disorder (MDD), PPD is thought to be biologically relatively homogenous, as it is precipitated by a specific biological trigger – the profound hormonal shifts associated with pregnancy and delivery. However, the underlying pathophysiology of PPD is still unclear, with a variety of biological factors likely at play. In this review, we examine recent biological findings related to neuroimaging, the hypothalamic-pituitary-adrenal (HPA) axis, neuroactive steroids (NAS), epigenetics, and extracellular vesicles (EVs) and explore processes that may be unique to PPD versus those shared with MDD, along with avenues of future research aimed at PPD prevention and treatment.</article>","contentLength":856,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Amyloid precursor protein carboxy-terminal fragments as catalyzers of endolysosomal dysfunction in Alzheimer’s disease","url":"https://www.cell.com/trends/neurosciences/fulltext/S0166-2236(25)00102-X?rss=yes","date":1749600000,"author":"Céline Vrancx, Wim Annaert","guid":51,"unread":true,"content":"<article>Proteolytic processing of the amyloid precursor protein (APP) generates not only the well-known β-amyloid (Aβ) peptides but also APP C-terminal fragments (APP-CTFs). Recent evidence from studies in murine- or human-derived (neuronal) models suggests that APP-CTFs may independently contribute to Alzheimer’s disease (AD) pathology by disrupting cellular homeostasis. This review highlights pathological effects unique to APP-CTFs that are independent of Aβ, shedding light on their distinct role in disease progression. We explore the mechanisms underlying APP-CTF-induced toxicity, with a focus on their contribution to endolysosomal dysfunction. APP-CTFs impair lysosomal function and disrupt calcium signaling between the endoplasmic reticulum and lysosomes, compounding organelle dysfunction. Understanding these mechanisms will aid the design of preventive therapeutic strategies that take into account the impact of APP-CTFs on AD pathology.</article>","contentLength":952,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"CD8 T cells as drivers of blood–brain barrier disruption","url":"https://www.cell.com/trends/neurosciences/fulltext/S0166-2236(25)00103-1?rss=yes","date":1749600000,"author":"Marina Seady, Aaron J. Johnson","guid":52,"unread":true,"content":"<article>Blood–brain barrier (BBB) disruption is a hallmark of many neurological diseases. It is known that proinflammatory cytokines can disrupt tight junctions between endothelial cells of the BBB, allowing larger molecules to penetrate the brain. Along with BBB disruption, these diseases also feature increased numbers of CD8 T cells as components of the immune cell population in the brain. In this review, we discuss the mechanisms of CD8 T cell-mediated BBB disruption, including the roles of antigen presentation through MHC class I molecules, which emerge as an important determining feature of BBB disruption and immune cell infiltration into the brain.</article>","contentLength":656,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"PDZD8 orchestrates synaptic remodeling through autophagy","url":"https://www.cell.com/trends/neurosciences/fulltext/S0166-2236(25)00098-0?rss=yes","date":1749081600,"author":"Xueying Peng, Yixian Cui","guid":47,"unread":true,"content":"<article>In a recent study, Thakur and O’Connor-Giles identified PDZD8 as a novel regulator of activity-dependent synaptic growth in Drosophila. Localized at endoplasmic reticulum (ER)–late endosome/lysosome (LEL) membrane contact sites (MCSs), PDZD8 promotes autophagy by coupling lipid transfer to autolysosome maturation to drive synaptic bouton formation, providing in vivo evidence that autophagy contributes directly to synaptic remodeling.</article>","contentLength":441,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Interplay between physical activity, tau pathophysiology, and cognition","url":"https://www.cell.com/trends/neurosciences/fulltext/S0166-2236(25)00101-8?rss=yes","date":1749081600,"author":"Marcos Olvera-Rojas, Francisco B. Ortega, Irene Esteban-Cornejo","guid":48,"unread":true,"content":"<article>Physical activity (PA) has emerged as a modifiable protective lifestyle factor for Alzheimer’s disease (AD). In a recent study by Kim and colleagues, higher levels of PA were associated with reduced phosphorylated tau (ptau) 217 concentrations even after accounting for β-amyloid (Aβ) brain uptake, suggesting a link with tau pathophysiology; this link also mediated better general cognition.</article>","contentLength":396,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The ABCs of lipid exposure in maintaining neural health","url":"https://www.cell.com/trends/neurosciences/fulltext/S0166-2236(25)00106-7?rss=yes","date":1749081600,"author":"Akhila Rajan, Alex C. Keene","guid":49,"unread":true,"content":"<article>ABC transporters modulate lipid homeostasis and are implicated in neurodegenerative diseases. In a recent study, Chen et al. uncovered unexpected dual roles for the Drosophila ABCA protein eater of debris (Eato), which suppresses phospholipid exposure in both neurons and phagocytes, conferring opposite functional outcomes in each cell type. This challenges classical models of ATP-binding cassette (ABC) transporter function and reveals new mechanisms by which lipid signaling regulates neuron–glia interactions in neurodegenerative contexts.</article>","contentLength":546,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Dissociation and transformation between recognition memory and spatial navigation representations","url":"https://www.cell.com/trends/neurosciences/fulltext/S0166-2236(25)00097-9?rss=yes","date":1748995200,"author":"Xiao Xu, Dun Mao","guid":46,"unread":true,"content":"<article>Recognition refers to the ability to identify previously encountered stimuli, whereas navigation pertains to the capacity to employ flexible strategies to reach a destination. Despite their functional distinctions, the neural substrates of recognition and navigation share some commonalities, but many aspects of their relationship remain debated, particularly concerning the role of the hippocampus. We synthesize recent primate studies to examine how the hippocampus and related regions contribute to recognition memory and spatial navigation. We highlight that scene recognition, an ethologically relevant process for primates, is closely linked to spatial navigation. Emerging behavioral and physiological evidence suggests that while recognition and navigation share overlapping circuitry, they engage partially dissociable neural mechanisms. We argue that their interplay can be better understood through the framework of reference frame transformation.</article>","contentLength":959,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["journal","cognitive-neuroscience","review"]}