{"id":"2ufhwNgM3qHKXR4MrsdSHGQRBi2wNKKW3bXV5dQEDqpgpHzFEQ4nCZooscN5GkzdmJASjfG2n","title":"Trends in Neurosciences","displayTitle":"Trends in Neurosciences","url":"https://www.cell.com/trends/neurosciences/inpress.rss","feedLink":"https://www.cell.com/neurosciences/archive?publicationCode=tins&rss=yes","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":5,"items":[{"title":"CHCHD2 links mitochondrial dysfunction and α-synuclein misfolding in Parkinson’s disease","url":"https://www.cell.com/trends/neurosciences/fulltext/S0166-2236(26)00026-3?rss=yes","date":1772150400,"author":"Derek Narendra, Brent J. Ryan","guid":121,"unread":true,"content":"<article>Parkinson’s disease comprises multiple biological subtypes and a heterogeneous clinical course. A recent study by Liao et al. identifies CHCHD2 mutations as a mitochondrial entry point that links metabolic dysfunction to α-synuclein pathology. These findings highlight how rare sporadiclike monogenic forms of Parkinson’s disease may inform mechanistic and therapeutic stratification.</article>","contentLength":389,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"From illness to rest: neural circuits linking sickness and sleep","url":"https://www.cell.com/trends/neurosciences/fulltext/S0166-2236(26)00012-3?rss=yes","date":1772064000,"author":"Chunhao Qu, Xiao Yu","guid":120,"unread":true,"content":"<article>In a recent study, Darmohray et al. identified a brainstem pathway underlying sickness-induced sleep in mice. The authors demonstrated that immune-activated circuits in the nucleus of the solitary tract suppress wake-promoting norepinephrine signaling to promote nonrapid eye movement sleep. These findings help elucidate the neural mechanisms of sickness-induced sleep and provide new insights into sleep–immune interactions.</article>","contentLength":428,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Making of BDNF: role of promoters, enhancers, and untranslated regions","url":"https://www.cell.com/trends/neurosciences/fulltext/S0166-2236(26)00010-X?rss=yes","date":1771977600,"author":"Eli-Eelika Esvald, Annela Avarlaid, Indrek Koppel, Jürgen Tuvikene, Tõnis Timmusk","guid":119,"unread":true,"content":"<article>Brain-derived neurotrophic factor (BDNF) is a neurotrophin with crucial roles in the developing and adult nervous system, contributing to neuronal survival, differentiation, and synaptic plasticity. The pleiotropic functions of BDNF require stringent spatiotemporal control of its expression, making BDNF one of the most thoroughly studied activity-regulated genes. Over the years, substantial evidence has accumulated, providing insights into BDNF gene structure, numerous mRNA variants, their different localization patterns and translational efficiencies, as well as the functions of the BDNF protein in different tissues. This review aims to summarize the current understanding of the mechanisms governing BDNF expression at transcriptional, posttranscriptional, and translational levels, offering an integrated perspective of BDNF regulation.</article>","contentLength":847,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Micro- and nanoplastics in neurological dysfunction","url":"https://www.cell.com/trends/neurosciences/fulltext/S0166-2236(26)00007-X?rss=yes","date":1771891200,"author":"Sean M. Gettings, Riddhi Sharma, Nora Bourbia","guid":118,"unread":true,"content":"<article>Plastic particles can interfere with the nervous system and are increasingly recognised as a global health concern. This review encompasses recent findings on the impact of plastic particles on brain health, including studies in humans, rodents, nematodes, and zebrafish. We discuss how plastics can impact cellular metabolism, affect developmental brain processes, and increase vulnerability to neurodevelopmental disorders and depression. Additionally, we review the potential of plastic particles to interact with the immune system and trigger pathological protein aggregation, enhancing susceptibility to neurodegeneration. Finally, we evaluate knowledge gaps that should be addressed to better understand the long-term impacts of plastic particles on the nervous system and neurological disorders.</article>","contentLength":802,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A neurobiological perspective on prolonged grief disorder","url":"https://www.cell.com/trends/neurosciences/fulltext/S0166-2236(26)00004-4?rss=yes","date":1771459200,"author":"Richard A. Bryant, Isabella A. Breukelaar, Mayuresh Korgaonkar","guid":117,"unread":true,"content":"<article>Prolonged grief disorder (PGD) is a psychiatric condition that describes individuals who experience persistent grief reactions characterized by preoccupation with the loss. This review provides an overview of the evidence on neurobiological processes associated with PGD. We propose that, although the neurobiological circuitry of PGD overlaps with that of anxiety and depression, it also involves neural responses that reflect the distinct symptom profiles of people with PGD. Specifically, while recruitment of cognitive control and salience networks is observed across common mental disorders, there is evidence that aberrant neural processes implicated in reward processes and appetitive functions are somewhat distinctive to PGD. We emphasize that methodological limitations suggest caution is needed in interpreting current evidence, and more rigorous research is required to delineate key distinct neurobiological processes of PGD.</article>","contentLength":938,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["cognitive-neuroscience","review"]}