{"id":"368La1qZAv72idE55Whuffkk2TBtHuSndX6iNywdUkLBDxxx55cLvowsw5Rj5VbHUHjCYUBR5tHfX6BAYFQZS3af","title":"top scoring links : europe","displayTitle":"News - Reddit - Europe","url":"https://www.reddit.com/r/europe/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/europe/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Norway Outlaws Sex Without Consent as Europe Strengthens Rape Laws","url":"https://www.usnews.com/news/world/articles/2025-06-06/norway-outlaws-sex-without-consent-as-europe-strengthens-rape-laws","date":1749407779,"author":"/u/Sandstorm400","guid":439,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1l6jds1/norway_outlaws_sex_without_consent_as_europe/"},{"title":"Putin warned of dual threat to Russian economy: \"Countdown to a crisis\"","url":"https://www.newsweek.com/putin-warned-dual-threat-russian-economy-countdown-crisis-2082449","date":1749392327,"author":"/u/vincevega87","guid":433,"unread":true,"content":"<p>Moscow's economy is sliding toward the brink of \"stagflation,\" according to a new report published by a Russian economics research organization close to the country's government.</p><p>The report's author, Dmitry Belousov, head of analysis and forecasting of macroeconomic processes at the Center for Macroeconomic Analysis and Short-Term Forecasting (CAMAC), said that the \"economic dynamics\" in Russia are \"rapidly declining, with a risk of a technical recession in the second and third quarters\" of 2025.</p><p>After the invasion of Ukraine, Russia's economy has been seriously affected by sanctions imposed by Western countries trying to cripple its ability to finance the war, but it crucially avoided entering a recession. Now, however, the economy is facing a risky combination of factors—including rising prices, slowing growth and an acute labor shortage—that is threatening its stability and outlook.</p><p>In a sign that the Kremlin is aware of how fragile the country's economic position currently is, Russia's central bank cut its key interest rate to 20 percent on Friday, down from a two-decade high of 21 percent.</p><p>According to the report released earlier this week and authored by Belousov, GDP growth in Russia slowed down to 1.4 percent in Q1 2025 compared to a year earlier. While inflation is slowing down, it remains very high, at 9.8 percent.</p><p>While slowing investments in machinery and equipment has played into this slowdown, Belousov said that it has been accelerated by \"growing problems in construction,\" with the number of new projects now declining, and falling consumer demand, especially when it comes to non-food products. According to the report, consumer spending has been stagnating since mid-2024.</p><p>The combination of rising inflation and stagnant economic growth could bring the Russian economy into a state of \"stagflation,\" which is usually also characterized by high unemployment. In Russia, according to official data, unemployment is currently low at 2.4 percent.</p><p>Belousov presented a \"countdown\" to a potential crisis in Russia. The report said that a potential downturn of the Russian economy could unfold between Q2 and Q3 2025 as a slowdown in economic growth and falling consumer demand and as a weakening of the ruble between Q3 and Q4 2025.</p><p>This loss in value for the Russian currency would be caused by a dip in trade in the first half of the year and a growth in imports, Belousov said, taking into consideration the impact of President <a href=\"https://www.newsweek.com/topic/donald-trump\" data-sys=\"1\">Donald Trump</a>'s tariffs.</p><p>\"It is easy to see that the 'trigger' of a new intensification of the crisis could be another step in tightening the interest rate policy of the Bank of Russia, provoked by the (almost inevitable) weakening of the ruble, an increase in administratively regulated tariffs and a corresponding jump in inflation,\" Belousov wrote.</p><p>The analyst recommends that the country focuses on reducing inflation to avoid the worst possible scenario for the Russian economy, as well as on supporting \"the entry of Russian products into all available external markets\" and stimulating investments in fixed capital.</p><p><strong>The Central Bank of the Russian Federation</strong> said in a statement explaining its decision on Friday: \"Domestic demand continues to outstrip the economy's capacity to expand the supply of goods and services, but Russia is gradually returning to a more balanced growth path.\"</p><p><strong>Russia's central bank's Governor Elvira Nabiullina</strong> said in a press conference on Friday: \"We are close to a scenario of balanced economic growth.\" According to Nabiullina, \"monetary policy will remain tight for a long period.\"</p><p>She added: \"Inflation ultimately eats away at the economy's potential, so our goal is to curb inflation and allow the real sector of the economy to develop.\"</p>","contentLength":3736,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1l6d96q/putin_warned_of_dual_threat_to_russian_economy/"},{"title":"TSMC's first European chip design centre to be established in Munich","url":"https://www.heise.de/en/news/TSMC-establishes-chip-design-center-in-Munich-10404476.html","date":1749389079,"author":"/u/Obulgaryan","guid":437,"unread":true,"content":"<p>The world's largest chip contract manufacturer TSMC is establishing the European Union Design Center (EUDC) in Munich. At this center, TSMC will work with customers to develop chip designs that will then be produced either by TSMC itself or by TSMC's joint venture European Semiconductor Manufacturing Company (ESMC). With EUDC, TSMC aims to strengthen its collaboration with European customers. It is scheduled to open in the third quarter of 2025.</p><p>TSMC cites industrial applications, artificial intelligence (AI), telecommunications technology and the Internet of Things (IoT) as further areas of application for EUDC designs. EUDC will work together with the nine existing TSMC design centers in Taiwan, the USA, Canada, China, and Japan.</p><h3>Apple, already based in Munich</h3><div><div><p><em>This article was originally published in\n      \n        <a href=\"https://www.heise.de/news/TSMC-gruendet-Chipdesign-Zentrum-in-Muenchen-10402585.html\">German</a>.\n      \n      It was translated with technical assistance and editorially reviewed before publication.</em></p></div></div>","contentLength":935,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1l6c2td/tsmcs_first_european_chip_design_centre_to_be/"},{"title":"Pope Leo criticises ‘exclusionary mindset’ of nationalist political movements","url":"https://www.theguardian.com/world/2025/jun/08/pope-leo-criticises-exclusionary-mindset-of-nationalist-political-movements","date":1749386300,"author":"/u/BreakfastTop6899","guid":436,"unread":true,"content":"<p>Pope Leo has criticised the emergence of nationalist political movements and their “exclusionary mindset”, without naming a specific country or leader.</p><p>Leo, the first pope from the US, asked during a mass on Sunday with tens of thousands in St Peter’s Square that God “open borders, break down walls [and] dispel hatred”.</p><p>“There is no room for prejudice, for ‘security’ zones separating us from our neighbours, for the exclusionary mindset that, unfortunately, we now see emerging also in political nationalisms,” he said.</p><p>The pontiff said the church “must open the borders between peoples and break down the barriers between class and race”.</p><p>“People must move “beyond our fear of those who are different,” he said, saying the Holy Spirit “breaks down barriers and tears down the walls of indifference and hatred”.</p><p>Leo, formerly Cardinal Robert Prevost, was elected on 8 May to succeed the late Pope Francis as leader of the 1.4 billion-member church.</p><p>Before becoming pontiff, Prevost was not shy about criticising <a href=\"https://www.theguardian.com/us-news/donaldtrump\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Donald Trump</a>, sharing numerous disapproving posts about the US president and the vice-president, JD Vance, on X in recent years.</p><p>The Vatican has not confirmed the pope’s ownership of the X account, which had the handle @drprevost, and was deactivated after his election.</p><p>Francis, who was pope for 12 years, was a sharp critic of Trump. He said in January that the president’s plan to deport millions of migrants in the US during his second term was a disgrace. He had previously said Trump was not Christian because of his views on immigration.</p><p>“A person who thinks only about building walls, wherever they may be, and not building bridges, is not Christian,” he said when asked about Trump in 2016.</p><p>Leo was celebrating a mass for Pentecost, one of the church’s most important holidays.</p>","contentLength":1833,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1l6b5zm/pope_leo_criticises_exclusionary_mindset_of/"},{"title":"German and Ukrainian soldiers together with German and Ukrainian officials in front of a MIM-104 Patriot fire unit, 2024","url":"https://www.reddit.com/r/europe/comments/1l69xfg/german_and_ukrainian_soldiers_together_with/","date":1749382036,"author":"/u/BkkGrl","guid":440,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Musk vs. Trump drama dominated in DC, but Germany's Merz quietly walked away with a win","url":"https://www.cnbc.com/2025/06/06/musk-vs-trump-dominated-yet-germanys-merz-walked-away-with-a-win.html","date":1749382008,"author":"/u/1-randomonium","guid":432,"unread":true,"content":"<div data-test=\"InlineImage\"><div><div><div>President Donald Trump gestures toward the press as he greets German Chancellor Friedrich Merz upon arrival at the West Wing of the White House in Washington, DC, on June 5, 2025.</div><div>Saul Loeb | Afp | Getty Images</div></div></div></div><div><p>German Chancellor Friedrich Merz's meeting with U.S. President <a href=\"https://www.cnbc.com/donald-trump/\">Donald Trump</a> was dramatically overshadowed by the U.S. leader's <a href=\"https://www.cnbc.com/2025/06/06/a-timeline-of-donald-trump-and-elon-musks-relationship.html\">spat</a> with <a href=\"https://www.cnbc.com/elon-musk/\">Elon Musk</a>. But it was still seen as a win for Merz.</p><p>\"Being sidelined is not necessarily always a bad thing,\" Carsten Brzeski, global head of macro at ING, told CNBC on Friday. \"In fact, it might have even helped Merz as the Musk distraction was also deviating attention away from more controversial topics.\"</p><p>It was a high-stakes trip for Merz, who is just a few weeks into his chancellorship, especially given the <a href=\"https://www.cnbc.com/2025/02/28/trump-vance-and-zelenskyy-clash-at-white-house-ukraine-meeting.html\">treatment</a> other leaders have gotten from Trump in the Oval Office in recent months.</p><p>As such, Merz is unlikely to be disappointed about the outcome — especially given the potential downsides.</p><p>\"Having avoided an escalation in the Oval Office is already an achievement these days,\" Brzeski added.</p></div><div><p>Merz arrived in Washington with a full agenda that ranged from strengthening relations between the U.S. and Germany, to tariffs — which could significantly impact key German industries — as well as U.S. support for Ukraine in its war with Russia and higher NATO defense spending.</p><p>While we don't know what was discussed behind closed doors, Merz was seemingly able to address most of these points with Trump, political strategist Julius van de Laar told CNBC's \"<a href=\"https://www.cnbc.com/squawk-box-europe/\">Squawk Box Europe</a>\" on Friday.</p></div><div><p>\"I think what Friedrich Merz got across is that he hopes that the U.S. president will continue to support Ukraine,\" he said, noting that the issue had gathered momentum recently given several significant attacks. Merz was able to pick up on this, and draw links to the anniversary of D-Day a day after their meeting.</p><p>\"And he said the United States played a great role in ... freeing Europe from the Nazi regime back then, and so he's hoping that Donald Trump will ... say we're going to get engaged again and help Europe become free of dictatorship,\" van de Laar said.</p><p>Merz making this point was important in the context of highlighting the U.S.-German relationship, according to Jackson Janes, senior resident fellow at the German Marshall Fund. Speaking to CNBC's \"Squawk Box Europe,\" he also pointed out that Trump was gifted his grandfather's birth certificate by Merz, \"making the point 'you have a relationship with Germany in your own family.'\"</p></div><div data-test=\"InlineImage\"><div><div><div>German Chancellor Friedrich Merz presents US President Donald Trump with what Merz said was the birth certificate of Trump's grandfather, who was born in 1869, during a bilateral meeting in the Oval Office of the White House in Washington, DC, on June 5, 2025.</div><div>Brendan Smialowski | Afp | Getty Images</div></div></div></div><div><p>Janes also noted that Merz highlighting Germany's plans for higher defense spending would have marked a positive note in the discussion.</p><p>Germany recently changed its fiscal rules to allow for higher defense spending, and Merz's government seems to be making it a priority. The chancellor has promised a financial push to boost the German military, and the country's foreign minister has suggested support for Trump's proposal that NATO members spend 5% of their gross domestic product on defense.</p></div><div><p>Meanwhile, the sensitive topic of Germany's far-right party, the Alternative fuer Deutschland, was seemingly avoided. Officials in the Trump administration have in recent weeks <a href=\"https://www.nbcnews.com/politics/trump-administration/trump-administration-german-politics-defense-afd-rcna209177\" target=\"_blank\">come out in support </a>of the party after German intelligence services classified it as a \"proven right-wing extremist organization.\"</p><p>This led to <a href=\"https://www.theguardian.com/world/2025/may/06/friedrich-merz-warns-the-us-to-stay-out-of-germanys-politics\" target=\"_blank\">clapbacks</a> from German politicians, with Merz himself warning the U.S. not to get involved. The classification of the AfD is currently on hold amid a legal challenge.</p></div><div><p>All in all, Merz's visit to D.C. was seen as \"a home run or a hole in one,\" van de Laar said.</p><p>ING's Brzeski also suggested that the trip laid good foundations between the leaders. \"There seems to be some common grounds between Trump and Merz, which could be the seeds for a more constructive relationship,\" he said.</p><p>Merz even appeared to get some compliments from Trump, with the president commending him for his English skills and saying that while \"difficult,\" the German leader was a \"very good man to deal with.\"</p><p>Following the meeting, Merz appeared satisfied, saying in a social media <a href=\"https://www.instagram.com/p/DKiGXUPuubf/?igsh=MTBiOXA0ajh3cWt5OA==\" target=\"_blank\">post</a> that the atmosphere was \"really good,\" and that the two have much in common. \"I am coming back with the feeling that we can speak on the phone any time,\" he said, according to a CNBC translation.</p><p>But even an in-person reunion might not be too far off: a Trump trip to Berlin is already being planned, Merz told German <a href=\"https://www.daserste.de/information/nachrichten-wetter/brennpunkt/sendung/brennpunkt-merz-im-weissen-haus-100.html\" target=\"_blank\">media</a>.</p></div>","contentLength":4686,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1l69x63/musk_vs_trump_drama_dominated_in_dc_but_germanys/"},{"title":"Beer section in a German supermarket","url":"https://www.reddit.com/r/europe/comments/1l67nal/beer_section_in_a_german_supermarket/","date":1749372904,"author":"/u/SPXQuantAlgo","guid":441,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"'I am against Ukraine's entry into the European Union,' Polish president-elect Nawrocki says","url":"https://kyivindependent.com/i-am-against-ukraines-entry-into-the-european-union-polish-president-elect-nawrocki-says/","date":1749368198,"author":"/u/KI_official","guid":438,"unread":true,"content":"<p>\"At the moment, I am against Ukraine's entry into the European Union,\" Polish President-elect Karol Nawrocki told Hungarian outlet Mandiner in an interview released on June 7.</p><p>\"On the one hand, we must support Ukraine in its conflict with the Russian Federation, but Ukraine must understand that other countries, including Poland, Hungary, and other European countries, also have their own interests,\" he <a href=\"https://mandiner.hu/kulfold/2025/06/a-visegradi-csoport-szamomra-fontos-lesz-lengyelorszag-megvalasztott-elnoke-a-mandinernek\">said</a>.</p><p><a href=\"https://kyivindependent.com/who-is-nawrocki-polands-new-president-and-what-his-narrow-victory-could-mean-for-polish-ukrainian-relations/\">Nawrocki</a> won the second round of the Polish presidential election on June 1 with 50.89% of the vote. He has previously voiced opposition to Ukraine's membership in the EU and NATO, despite supporting Ukraine's sovereignty.</p><p>\"<a href=\"https://kyivindependent.com/tag/poland/\">Poland</a> has such an interest, for example, in the exhumation of the Volyn (massacre) victims,\" Nawrocki said.</p><p>Polish and Ukrainian researchers began <a href=\"https://kyivindependent.com/exhumations-of-volyn-massacre-polish-victims-begin-in-western-ukraine/\">exhuming</a> victims of the World War II era massacres on April 24 in Western Ukraine.</p><p>It was the first such exhumation since 2017, when <a href=\"https://kyivindependent.com/tag/ukraine/\" rel=\"dofollow\">Ukraine</a> imposed a moratorium in response to the destruction of Ukrainian Insurgent Army (UPA) memorials in Poland.</p><p>\"During the campaign, I did not agree, and as president, I will not agree, to unfair competition with <a href=\"https://kyivindependent.com/tag/ukraine/\">Ukraine</a> for Polish agriculture or the logistics sector,\" Nawrocki said.</p><p>EU <a href=\"https://kyivindependent.com/eu-tariffs-on-ukrainian-goods-return-after-3-years-of-war-complicating-kyivs-path-to-european-integration/\">tariffs</a> on Ukrainian agricultural exports resumed on June 6, amid opposition to Ukrainian exports and its EU accession from eastern European members, including <a href=\"https://kyivindependent.com/tag/hungary/\">Hungary</a> and Poland.</p><p>\"I see Ukraine as a country that, although it is very bravely defending itself against the <a href=\"https://kyivindependent.com/tag/russia/\">Russian Federation</a>, must also respect the interests of other countries that otherwise support Ukraine,\" he said.</p><p>In contrast to other Eurosceptic leaders in Europe, including Slovak Prime Minister Robert Fico and Hungarian Prime Minister Viktor Orban, Nawrocki does not express pro-Russian views, but has repeatedly accused President Volodymyr Zelensky of taking advantage of allies.</p>","contentLength":1853,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1l66ivg/i_am_against_ukraines_entry_into_the_european/"},{"title":"Canada won’t become the 51st US state – but could it join the EU?","url":"https://www.theguardian.com/world/2025/jun/08/canada-wont-become-the-51st-us-state-but-could-it-join-the-eu?CMP=Share_AndroidApp_Other","date":1749366934,"author":"/u/sseumblue","guid":434,"unread":true,"content":"<p>oachim Streit has never stepped foot in <a href=\"https://www.theguardian.com/world/canada\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Canada</a>. But that hasn’t stopped the German politician from launching a tenacious, one-man campaign that he readily describes as “aspirational”: to have the North American country join the EU.</p><p>“We have to strengthen the European Union,” said Streit, who last year was elected as a member of the European parliament. “And I think Canada – as its <a href=\"https://www.theguardian.com/world/2025/mar/17/canada-new-prime-minister-mark-carney-paris-london-visit\" data-link-name=\"in body link\">prime minister says</a> – is the most European country outside of Europe.”</p><p>Streit had long imagined Canada as a sort of paradise, home to dense forests that course with wide, rushing rivers. But after Donald Trump returned to power, <a href=\"https://www.theguardian.com/us-news/2025/apr/03/donald-trump-tariffs-antarctica-uninhabited-heard-mcdonald-islands\" data-link-name=\"in body link\">launching</a> much of the world into a trade war and <a href=\"https://www.theguardian.com/world/2025/mar/17/from-london-to-lviv-how-trumps-new-world-order-has-shaken-europe\" data-link-name=\"in body link\">turning his back</a> on America’s traditional allies, Streit began to cast the northern country in a new light.</p><p>What he saw was a relatively unexplored relationship, one that could prove mutually beneficial as the world grapples with rapidly reshaping global dynamics. “Canadians have seen their trust in the US undermined, just as we have in <a href=\"https://www.theguardian.com/world/europe-news\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Europe</a>, following President Trump’s actions,” he said. “We need to strengthen the ties that bind us to our friends.”</p><p>While he admitted that the possibility of Canada as a full member of the EU “may be aspirational for now”, he wondered if it was an idea whose time had come.</p><p>“Canada would be a strong member,” he said. “If Canada would be a member of the EU, it <a href=\"https://tradingeconomics.com/country-list/gdp?continent=europe\" data-link-name=\"in body link\">would rank</a> 4th in terms of GDP. It’s part of Nato. And 58% of (working-age) Canadians <a href=\"https://www150.statcan.gc.ca/n1/daily-quotidien/221130/dq221130a-eng.htm\" data-link-name=\"in body link\">have</a> college degrees.”</p><p>Canada also has <a href=\"https://www.cer-rec.gc.ca/en/data-analysis/energy-markets/provincial-territorial-energy-profiles/provincial-territorial-energy-profiles-canada.html\" data-link-name=\"in body link\">vast energy</a> reserves – an asset that could prove useful to the bloc, which is still struggling <a href=\"https://www.reuters.com/business/energy/europe-will-struggle-wean-itself-off-russian-gas-bousso-2025-05-14/\" data-link-name=\"in body link\">to wean itself</a> off Russian gas, he added.</p><p>Since launching his campaign last month, Streit has become the most visible proponent of an unlikely proposition that has been gaining traction since Trump began floating the idea of Canada <a href=\"https://www.theguardian.com/world/2025/mar/06/we-are-canadian-ad-trump\" data-link-name=\"in body link\">as the 51st state</a>.</p><p>In late January, a former foreign minister of Germany, Sigmar Gabriel, called for Canada to be invited into the EU. “They are more European than some European member states anyway,” <a href=\"https://www.thepioneer.de/originals/others/articles/sigmar-gabriel-will-kanada-in-die-eu-aufnehmen\" data-link-name=\"in body link\">he told</a> Germany’s Pioneer Media.</p><p>In March, however, a European spokesperson <a href=\"https://www.politico.eu/article/canadians-want-join-european-union-will-never-happen-paula-pinho/\" data-link-name=\"in body link\">appeared to pour cold water</a> on the suggestion, citing an article in the EU treaty that specifies only European states can apply to join the EU.</p><p>Streit brushed off the technicality, pointing to France’s <a href=\"https://www.europarl.europa.eu/factsheets/en/sheet/100/outermost-regions-ors-#:~:text=The%20European%20Union%20supports%20the,the%20Canary%20Islands%20(Spain).\" data-link-name=\"in body link\">overseas territories</a>. “Those are also not in Europe, but those islands belong to the European Union,” he said. Cyprus, considered <a href=\"https://european-union.europa.eu/principles-countries-history/eu-countries/cyprus_en\" data-link-name=\"in body link\">EU territory</a> but located geographically in west Asia, was another example.</p><p>And if one wanted to get technical, Canada was – albeit in a minuscule way – connected geographically to Europe, he said. “Greenland, which belongs to Denmark, shares a border with Canada,” he said, pointing to the <a href=\"https://www.theguardian.com/world/2022/jun/14/canada-denmark-end-decades-long-dispute-barren-rock-arctic-hans-island\" data-link-name=\"in body link\">divide that runs</a> through the uninhabited half-mile square Hans Island.</p><p>In April, Streit <a href=\"https://www.europarl.europa.eu/doceo/document/E-10-2025-001336_EN.html\" data-link-name=\"in body link\">submitted</a> a written question to the European parliament, asking whether the treaty article stipulating that states must be European could be interpreted in a way that could allow for Canadian membership or, barring that, if it could be legally revised. He has yet to receive a response.</p><p>Undaunted, he sent a letter to two EU commissioners calling for a sort of <a href=\"https://lavocedinewyork.com/en/the-voices-of-europe/2025/04/30/a-political-erasmus-for-the-eu-and-canada-building-bridges-across-the-atlantic/\" data-link-name=\"in body link\">political Erasmus</a> to be launched between the bloc and Canada. What he envisions is a professional exchange programme that would allow EU officials to better grasp the nuances of Canadian federalism and Canadians to get a sense of the workings of European institutions.</p><p>“It would serve as both a symbolic and practical step toward deeper integration,” he said, one that could build on existing ties such as the <a href=\"https://www.theguardian.com/business/2016/oct/30/eu-canada-sign-ceta-free-trade-deal-trudeau-juncker\" data-link-name=\"in body link\">EU-Canada trade deal</a> and Canada’s <a href=\"https://ised-isde.canada.ca/site/ised/en/horizon-europe\" data-link-name=\"in body link\">participation</a> in the EU’s <a href=\"https://www.theguardian.com/science/2025/may/05/british-scientists-eu-horizon-research-funding-programme\" data-link-name=\"in body link\">flagship</a> science research programme, Horizon.</p><p>Since launching the campaign, he’s been in constant contact with Canadians; meeting twice with one of Canada’s high-ranking envoys to the EU and meeting with a Brussels-based association that promotes Canada-EU trade.</p><p>As news spreads of his efforts, his office has received a handful of emails of support. Some have offered up their own thoughts on how to skirt around Canada’s geographic location; one recent email laid out what the writer described as a “killer argument”, pointing out that as part of the Commonwealth Canada was tied to the UK and, by extension, Europe.</p><p>Streit took it one step further. “And who is the head of Canada?” he asked, pointing to <a href=\"https://www.theguardian.com/world/2025/may/02/canada-mark-carney-king-charles\" data-link-name=\"in body link\">King Charles.</a> “And he’s a European.”</p><p>Streit said he was well aware that, for all his efforts, the idea may prove to be impossible. Even so, he hoped that the moment could be seized on to at least hammer out the kind of deep ties the bloc has with countries such as Norway or Switzerland.</p><p>“Sometimes in history, the windows of opportunity open and close again,” he said. “And sometimes, the windows of opportunity are open only for a brief moment.”</p>","contentLength":4871,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1l667w3/canada_wont_become_the_51st_us_state_but_could_it/"},{"title":"France opens ‘complicity in genocide’ probes against French-Israelis over blocked Gaza aid","url":"https://www.timesofisrael.com/france-opens-complicity-in-genocide-probes-over-blocked-gaza-aid/","date":1749359562,"author":"/u/soalone34","guid":435,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1l64cwz/france_opens_complicity_in_genocide_probes/"}],"tags":["news","reddit"]}