{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZV4Z6rf2nuJ3cBJ971pKb6XZkWhnDxr957c82fPU4Cg4j63MSkVSUXrPi55","title":"top scoring links : worldnews","displayTitle":"News - Reddit - World News","url":"https://www.reddit.com/r/worldnews/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/worldnews/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Ukraine Says It Has Stepped Up Its Drone Game, Again","url":"https://www.nytimes.com/2025/06/08/world/europe/ukraine-russia-drones-weapons.html","date":1749410339,"author":"/u/Ecstatic-Medium-6320","guid":424,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1l6kecf/ukraine_says_it_has_stepped_up_its_drone_game/"},{"title":"Zelenskyy says US has not answered Ukraine’s request to buy air defense","url":"https://euromaidanpress.com/2025/06/08/zelenskyy-says-us-has-not-answered-ukraines-request-to-buy-air-defense/","date":1749405579,"author":"/u/pebbleharmonies","guid":427,"unread":true,"content":"<p data-start=\"3618\" data-end=\"3843\">Ukraine is still waiting for the United States to respond to its request to purchase air defense systems, President Volodymyr Zelenskyy said on 7 June. This followed a major Russian <a href=\"https://euromaidanpress.com/2025/06/07/kharkiv-endures-most-extensive-attack-since-full-scale-invasion-began-three-civilians-killed-dozens-injured/?swcfpc=1\" target=\"_blank\">air assault on Kharkiv</a> city the same day, as Russia <a href=\"https://euromaidanpress.com/2025/06/08/after-mass-explosive-drone-assaults-russia-launches-just-49-ukraine-shoots-down-40/?swcfpc=1\" target=\"_blank\">reportedly</a> targeted the city with 67 explosive drones, nine aerial bombs, and a missile.</p><div data-start=\"3618\" data-end=\"3843\">Ukraine seeks to acquire American-made Patriot systems, which are among the few Western air defense platforms capable of intercepting ballistic missiles. These missiles are regularly used by Russia to target Ukrainian cities. Moscow conducts daily attacks on residential neighborhoods far from the frontline, using long-range explosive drones and sometimes adding missiles to the assaults. Meanwhile, US President Donald Trump pushes for Kyiv-Moscow talks, allegedly to end the ongoing war, in order to restore relations with Russia.</div><h3 data-start=\"3845\" data-end=\"3886\"><strong data-start=\"3845\" data-end=\"3886\">Zelenskyy calls for urgent US support</strong></h3><p data-start=\"3888\" data-end=\"4329\">In his evening <a href=\"https://www.president.gov.ua/en/news/tak-samo-yak-tisk-primusiv-rosiyu-zajti-v-peregovornij-proce-98321\" target=\"_blank\">address</a> on 7 June, Zelenskyy stressed that Ukraine urgently needs “” from the US — not just words, but concrete decisions.</p><blockquote><p data-start=\"3888\" data-end=\"4329\"><em> “We are working to strengthen Ukraine’s air defense. We urgently need positive signals from the United States – concrete signals regarding air defense systems,”</em> he said. “<em>We are still waiting for a response to our request to purchase systems that can help — concrete signals, not words.”</em></p></blockquote><p data-start=\"4331\" data-end=\"4712\">He also thanked European nations for their support and emphasized the importance of joint production efforts.</p><blockquote><p data-start=\"4331\" data-end=\"4712\"><em>“We must also achieve results in the joint production of air defense systems and missiles for them – this is absolutely essential for our whole Europe,</em>” Zelenskyy noted, adding that “<em>only time separates us from that result, and what matters most is shortening that time.”</em></p></blockquote><blockquote data-secret=\"oN3g3BWXLb\"><a href=\"https://euromaidanpress.com/2025/06/08/reuters-us-expects-another-multi-pronged-russian-strike-after-ukraines-spiderweb-drone-attack/\" target=\"_blank\">Reuters: US expects another multi-pronged Russian strike after Ukraine’s Spiderweb drone attack</a></blockquote><p data-start=\"4761\" data-end=\"5091\">The statement came after a Ukrainian delegation visited Washington on 6 June. <a href=\"https://news.liga.net/ua/politics/news/yermak-ukraina-hotova-kupuvaty-zbroiu-u-ssha-ale-v-konhresi-vvazhaiut-shcho-mozhut-postachaty-sami\" target=\"_blank\">According</a> to the head of the Office of the President, Andrii Yermak, Ukraine expressed its readiness to buy weapons from the US. However, Yermak stated that members of Congress believe Washington can continue supplying arms directly to Ukraine instead.</p><p>On 6 June, Russia <a href=\"https://euromaidanpress.com/2025/06/06/russia-launches-407-drones-and-44-missiles-against-ukraine-in-overnight-assault-air-force-says/?swcfpc=1\" target=\"_blank\">attacked</a> Kyiv, Lutsk, and Ternopil with hundreds of drones and 45 missiles, leading to heavy casualties among civilians. That day, US President Donald Trump <a href=\"https://www.bbc.com/news/articles/cwyjd1z8yg5o\" target=\"_blank\">appeared</a> to defend Russia’s massive airstrike on Ukrainian cities the night before, claiming that Ukraine’s Operation Spiderweb had given Vladimir Putin “<em>a reason to go in and bomb the hell out of them last night.</em>” Earlier, after a phone call with Russia’s President Vladimir Putin, he said Russia’s reaction would “”&nbsp;</p><div><div><strong>You could close this page. Or you could join our community and help us produce more materials like this.&nbsp;</strong>\n\nWe keep our reporting open and accessible to everyone because we believe in the power of free information. This is why our small, cost-effective team depends on the support of readers like you to bring deliver timely news, quality analysis, and on-the-ground reports about Russia's war against Ukraine and Ukraine's struggle to build a democratic society.\n\nA little bit goes a long way: for as little as the cost of one cup of coffee a month, you can help build bridges between Ukraine and the rest of the world, plus become a co-creator and vote for topics we should cover next. <a href=\"https://www.patreon.com/euromaidanpress\" target=\"_blank\"></a>or see other ways to <a href=\"https://www.patreon.com/bePatron?u=36526209\" target=\"_blank\" data-patreon-widget-type=\"become-patron-button\">Become a Patron!</a></div></div>","contentLength":3389,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1l6igx6/zelenskyy_says_us_has_not_answered_ukraines/"},{"title":"Zelenskyy: We’re very close to point when Russia can be forced to end this war","url":"https://www.pravda.com.ua/eng/news/2025/06/8/7516208/","date":1749400277,"author":"/u/EsperaDeus","guid":431,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1l6gclm/zelenskyy_were_very_close_to_point_when_russia/"},{"title":"Zelenskyy: US has sent 20,000 missiles bound for Ukraine to Middle East instead","url":"https://www.pravda.com.ua/eng/news/2025/06/8/7516207/","date":1749396932,"author":"/u/Aggravating_Money992","guid":429,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1l6f198/zelenskyy_us_has_sent_20000_missiles_bound_for/"},{"title":"Israel orders military to stop Greta Thunberg’s boat reaching Gaza","url":"https://www.telegraph.co.uk/world-news/2025/06/08/israel-orders-army-stop-greta-thunbergs-boat-reaching-gaza/","date":1749389046,"author":"/u/TheTelegraph","guid":428,"unread":true,"content":"<div data-test=\"article-body-text\"><p>Speaking to CNN from the Madleen on Saturday, Ms Thunberg said she knew the “mission” was risky and that she could be attacked or even killed.</p><p>“None of those risks are even remotely as high as the risks Palestinians are facing every day just by trying to survive,” she said.</p><p>“Right now, the mission is to get to Gaza to distribute the humanitarian aid we are carrying but we are well aware of the risks going there.”</p><p>She added: “We are sailing on international waters and bringing humanitarian aid. If [Israel] stops this humanitarian aid, that is a crime. We are not doing anything wrong here…we are doing our part to try to break the siege in Gaza.”</p><p>Ms Thunberg is one of 12 activists on the trip. Others include Thiago Avila, a Brazilian campaigner, and Rima Hassan, a French-Palestinian member of the European Parliament.</p><p>The sailing boat is operated by the activist group Freedom Flotilla Coalition.</p><p>The Telegraph has contacted the group for comment.</p></div>","contentLength":967,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1l6c2de/israel_orders_military_to_stop_greta_thunbergs/"},{"title":"Elon Musk's father to attend pro-Kremlin event in Russia hosted by far-right ideologue","url":"https://kyivindependent.com/elon-musks-father-attends-pro-kremlin-event-in-russia-hosted-by-far-right-ideologue/","date":1749388926,"author":"/u/Aggravating_Money992","guid":430,"unread":true,"content":"<p>Errol Musk, the father of U.S. billionaire Elon Musk, has arrived in Moscow to attend the Forum of the Future 2050, a pro-Kremlin event scheduled for June 9-10, &nbsp;the Russian newspaper Kommersant reported on June 8. </p><p>The report comes amid a high-profile public conflict between Elon Musk, the world’s wealthiest businessman, and his former ally, U.S. President Donald Trump. In May, Musk announced he would step down as an advisor to Trump and as the de facto head of the Department of Government Efficiency. Since then, he has emerged as a major critic of the president.</p><p>The pro-Kremlin event will be hosted by the Tsargrad Institute and led by far-right Russian ideologue Alexander Dugin. </p><p>\"I am eager to meet everyone. As far as I know, Russians are among the most intelligent people on the planet. It would be foolish not to ask their opinion on all sorts of issues,\" Errol Musk was quoted as saying by the Russian state news agency TASS.</p><p>Among the forum's panels are sessions titled \"Russian Space: The Race for Mars\" and \"The Battle for Hearts and Minds: The Ideology of Sovereign <a href=\"https://kyivindependent.com/tag/russia/\">Russia</a>.\" </p><p>According to Kommersant, scheduled speakers include Russian Foreign Minister <a href=\"https://kyivindependent.com/tag/sergey-lavrov/\">Sergey Lavrov</a>, oligarch Konstantin Malofeev, and prominent state TV anchor Ekaterina Andreeva.</p><p>Errol Musk, a former South African businessman and politician, has publicly praised Russian President <a href=\"https://kyivindependent.com/tag/vladimir-putin/\">Vladimir Putin</a>, calling him \"a strong leader\" and saying that \"it would be foolish not to admire Putin\" in an April interview with <a href=\"https://kyivindependent.com/it-would-be-foolish-not-to-admire-putin-elon-musks-father-errol-swoons-over-russian-president/\">BBC Russia</a>. &nbsp;</p><p>Errol's attendance at the far-right event comes amid growing scrutiny of his son, <a href=\"https://kyivindependent.com/tag/elon-musk/\">Elon Musk</a>, whose role as the head of <a href=\"https://kyivindependent.com/tag/spacex/\">SpaceX</a> and the <a href=\"https://kyivindependent.com/tag/starlink/\">Starlink</a> satellite network places him at the center of both U.S. defense operations and Ukraine's battlefield communications.</p><p>SpaceX holds billions in Pentagon and NASA contracts, including a $1.8-billion agreement with the U.S. intelligence community to build a classified spy satellite system.</p><p>Despite initially aiding <a href=\"https://kyivindependent.com/tag/ukraine/\">Ukraine</a> by providing Starlink terminals to stabilize battlefield communications, Elon Musk has increasingly echoed Kremlin-aligned narratives. </p><p>He has suggested that President <a href=\"https://kyivindependent.com/69-of-ukrainians-have-confidence-in-president-zelensky-poll-finds/\">Volodymyr Zelensky</a> lacks public support in Ukraine and has repeatedly called U.S. aid a driver of a \"never-ending draft meat grinder.\"</p><p>Those statements have been warmly received by Russian officials, military bloggers, and state media outlets, which have <a href=\"https://kyivindependent.com/russia-may-offer-small-nuclear-plant-for-musks-mars-mission-official-says/\">praised</a> Musk as a voice of reason and a critic of Western involvement in the war.</p><p>Dmitry Novikov, deputy chairman of the Russian parliament's international affairs committee, said on June 6 that Moscow is ready to <a href=\"https://kyivindependent.com/moscow-ready-to-grant-musk-asylum-if-necessary-amid-rift-with-trump-russian-official-says/\">grant political asylum</a> to Musk following his public dispute with U.S. President Donald Trump.</p>","contentLength":2700,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1l6c0t8/elon_musks_father_to_attend_prokremlin_event_in/"},{"title":"Pope Leo criticises ‘exclusionary mindset’ of nationalist political movements","url":"https://www.theguardian.com/world/2025/jun/08/pope-leo-criticises-exclusionary-mindset-of-nationalist-political-movements","date":1749388122,"author":"/u/BreakfastTop6899","guid":426,"unread":true,"content":"<p>Pope Leo has criticised the emergence of nationalist political movements and their “exclusionary mindset”, without naming a specific country or leader.</p><p>Leo, the first pope from the US, asked during a mass on Sunday with tens of thousands in St Peter’s Square that God “open borders, break down walls [and] dispel hatred”.</p><p>“There is no room for prejudice, for ‘security’ zones separating us from our neighbours, for the exclusionary mindset that, unfortunately, we now see emerging also in political nationalisms,” he said.</p><p>The pontiff said the church “must open the borders between peoples and break down the barriers between class and race”.</p><p>“People must move “beyond our fear of those who are different,” he said, saying the Holy Spirit “breaks down barriers and tears down the walls of indifference and hatred”.</p><p>Leo, formerly Cardinal Robert Prevost, was elected on 8 May to succeed the late Pope Francis as leader of the 1.4 billion-member church.</p><p>Before becoming pontiff, Prevost was not shy about criticising <a href=\"https://www.theguardian.com/us-news/donaldtrump\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Donald Trump</a>, sharing numerous disapproving posts about the US president and the vice-president, JD Vance, on X in recent years.</p><p>The Vatican has not confirmed the pope’s ownership of the X account, which had the handle @drprevost, and was deactivated after his election.</p><p>Francis, who was pope for 12 years, was a sharp critic of Trump. He said in January that the president’s plan to deport millions of migrants in the US during his second term was a disgrace. He had previously said Trump was not Christian because of his views on immigration.</p><p>“A person who thinks only about building walls, wherever they may be, and not building bridges, is not Christian,” he said when asked about Trump in 2016.</p><p>Leo was celebrating a mass for Pentecost, one of the church’s most important holidays.</p>","contentLength":1833,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1l6bqvz/pope_leo_criticises_exclusionary_mindset_of/"},{"title":"Finnish PM criticizes reported attempts by Trump to weaken Russia sanctions bill","url":"https://kyivindependent.com/finnish-pm-criticizes-reported-attempts-by-trump-to-weaken-russia-sanctions-bill/","date":1749387354,"author":"/u/AdSpecialist6598","guid":423,"unread":true,"content":"<p>Finnish Prime Minister Petteri Orpo on June 7 criticized a weakened Russia sanctions bill amid reports that U.S. President Donald Trump is pressuring the Senate to weaken the legislation.</p><p>\"We need to force (Russian President Vladimir) Putin to the negotiating table,\" Orpo <a href=\"https://yle.fi/a/74-20166342\">said</a> at the Finnish National Coalition Party’s assembly on June 7.</p><p>\"I hope that the <a href=\"https://kyivindependent.com/tag/united-states/\">United States</a> passes it as quickly and as completely as possible,\" Orpo told reporters at the assembly in Helsinki.</p><p>The White House is urging Republican Senator Lindsey Graham to soften a Russia <a href=\"https://kyivindependent.com/trump-quietly-pressuring-senate-to-weaken-russia-sanctions-wsj-reports/\">sanctions bill</a> he is leading, the Wall Street Journal (WSJ) reported on June 6, citing congressional staffers.</p><p>The bipartisan sanctions billcould introduce a 500% tariff on imports from countries that continue purchasing <a href=\"https://kyivindependent.com/tag/russian-oil-industry/\">Russian oil</a> and raw materials.</p><p>\"We will discuss these issues at the (NATO) summit... We should get decisions now,\" Orpo said.</p><p> A <a href=\"https://kyivindependent.com/tag/nato/\">NATO</a> summit is slated to take place June 24-26 in the Netherlands. The important meeting is expected to cover a wide range of issues, including defense spending and Russia's war against Ukraine.</p><p>At a June 5 joint press conference alongside German Chancellor <a href=\"https://kyivindependent.com/tag/friedrich-merz/\">Friedrich Merz</a>, Trump said lawmakers were waiting for his approval before advancing the Russian sanctions bill.</p><p>\"They'll be guided by me. That's how it's supposed to be,\" Trump said. \"They're waiting for me to decide on what to do.\"</p><p>Senate Democrat Richard Blumenthal, who also leads the sanctions bill, has confirmed that negotiations have been taking place behind the scenes with White House officials.</p>","contentLength":1557,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1l6bhp8/finnish_pm_criticizes_reported_attempts_by_trump/"},{"title":"Ukraine drones attack on Moscow forces airport closure, Russia says","url":"https://www.yahoo.com/news/ukraine-drones-attack-moscow-forces-043628684.html","date":1749385290,"author":"/u/drjjoyner","guid":425,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1l6auxm/ukraine_drones_attack_on_moscow_forces_airport/"},{"title":"Wagner Group leaving Mali after heavy losses but Russia’s Africa Corps to remain","url":"https://www.nbcnews.com/news/amp/rcna211591","date":1749353629,"author":"/u/Equivalent_Road5788","guid":422,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1l62qvy/wagner_group_leaving_mali_after_heavy_losses_but/"}],"tags":["news","reddit"]}