{"id":"6C2W1azD1rBsd637cQfqXDjQxDCEaZwdGu7zmeZkkW88dnDfHEJWkav","title":"Journal of Personality and Social Psychology - Vol 130, Iss 2","displayTitle":"JPSP","url":"https://psycnet.apa.org/journals/psp.rss","feedLink":"https://psycnet.apa.org/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":1,"items":[{"title":"Absolute moral perceptions of the self and others: People are bad, a person is good, I am great.","url":"http://doi.org/10.1037/pspa0000479","date":1770595200,"author":"","guid":26,"unread":true,"content":"For decades, psychologists have appreciated that the average person sees themselves as better than average, particularly in moral domains. Although self-other comparisons permit establishing normative violations, they leave unanswered whether people see themselves and others positively or negatively in an absolute sense. The present research introduces a novel measure of moral thresholds to identify the behavioral tipping point that subjectively differentiates morality from immorality. Participants in two countries viewed themselves as clearly moral while viewing the other participants as falling short of the moral threshold (Study 1 and Supplemental Study A). Social targets of course take different forms. Study 2 (and Supplemental Study B) found that even when collectives (e.g., others in the study) were seen to fall short of moral thresholds, randomly selected individuals in those collectives—whether individuating information was offered about them or not—were estimated to exceed moral thresholds. The relative positivity of behavioral estimates (self &gt; individuals &gt; collectives) could not be explained by perceivers’ confidence in those assessments (Study 3). Studies 4a–4b completed an experimental causal chain to identify one reason individuals are judged more positively than collectives. People anticipated feeling worse if they were to be cynical about an individual (as opposed to a collective). This heightened anticipated negative experience was causally responsible for more positive behavioral forecasts. The moral threshold allows moral perception to join other domains (e.g., monetary outcomes, attitudes) in which identifying neutral reference points has been core to theoretical and empirical development. (PsycInfo Database Record (c) 2026 APA, all rights reserved) ","contentLength":1809,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["psychology"]}