{"id":"82kPqomaPXmQBGnnYvJ5VvDSfVeRBCS4aLCTzLpP4B3Y","title":"Nature Neuroscience","displayTitle":"Nature Neuroscience","url":"https://www.nature.com/neuro.rss","feedLink":"http://feeds.nature.com/neuro/rss/current","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":8,"items":[{"title":"Natural behavior is what you do, not just where you are","url":"https://www.nature.com/articles/s41593-026-02225-z","date":1772150400,"author":"Michael M. Yartsev","guid":8,"unread":true,"content":"As neuroscience increasingly recognizes that understanding the brain requires studying natural behavior, it has begun to adopt more naturalistic experimental environments as a means to that end — an important and welcome shift. Yet environmental realism alone does not guarantee that natural behavior is being studied and, in some cases, can create the illusion of ecological relevance or even promote unnatural behavior if the behavioral context is poorly aligned with a species’ ecology. Keeping sight of our central goal — understanding how brains support the actions animals evolved to perform — requires an ethological focus not only on where experiments occur, but on what animals are actually doing and whether the environment affords those behaviors.","contentLength":766,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Personalized brain decoding of spontaneous pain in individuals with chronic pain","url":"https://www.nature.com/articles/s41593-026-02221-3","date":1772064000,"author":"Choong-Wan Woo","guid":6,"unread":true,"content":"Lee et al. show that personalized brain-decoding models derived from intensive longitudinal fMRI data can track spontaneous pain in individuals with chronic pain, highlighting the potential of precise, patient-specific neuroimaging approaches.","contentLength":243,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Magnetic resonance microscopy maps widespread effects of Alzheimer’s disease on brain structures and behavior in mice","url":"https://www.nature.com/articles/s41593-025-02199-4","date":1772064000,"author":"Robert W. Williams","guid":7,"unread":true,"content":"Alzheimer’s disease alters brain structure broadly, but its regional impact is poorly mapped. Here, the authors show that App and Psen1 mutations in mice cause volume changes across 231 regions, which are associated with individual differences in behavior.","contentLength":258,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Functional bipartite invariance in mouse primary visual cortex receptive fields","url":"https://www.nature.com/articles/s41593-026-02213-3","date":1771977600,"author":"Andreas S. Tolias","guid":5,"unread":true,"content":"This study uses the inception loop framework to map neuronal invariances in mouse V1, revealing a bipartite receptive-field organization linked to segmentation and a synaptic-level hierarchy of increasing invariance supported by the MICrONS dataset.","contentLength":249,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Orbitofrontal cortex drives predictive filtering of sensory responses","url":"https://www.nature.com/articles/s41593-026-02217-z","date":1771891200,"author":"Hiroyuki K. Kato","guid":4,"unread":true,"content":"Top-down projections from the orbitofrontal cortex carry predictive signals that grow with sound experience and suppress the auditory cortex via inhibitory circuits, revealing a predictive mechanism for sensory habituation.","contentLength":223,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Convolutional neural network models describe the encoding subspace of local circuits in auditory cortex","url":"https://www.nature.com/articles/s41593-026-02216-0","date":1771804800,"author":"Stephen V. David","guid":3,"unread":true,"content":"Wingert, Parida and colleagues measured tuning subspaces from deep-learning models trained on single neurons in auditory cortex. They show that subspaces distinguish functional properties between neuronal subtypes and describe a framework for sparse, efficient coding of natural sounds.","contentLength":286,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Behavioral timescale synaptic plasticity: properties, elements and functions","url":"https://www.nature.com/articles/s41593-026-02214-2","date":1771545600,"author":"Jeffrey C. Magee","guid":2,"unread":true,"content":"Understanding how brains learn and remember remains among the most important challenges in science. Recent studies suggest that a new form of synaptic plasticity provides a basis for future explorations ranging from biochemistry to cognition.","contentLength":242,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Author Correction: Perivascular cells induce microglial phagocytic states and synaptic engulfment via SPP1 in mouse models of Alzheimer’s disease","url":"https://www.nature.com/articles/s41593-025-02197-6","date":1771286400,"author":"Soyon Hong","guid":1,"unread":true,"content":"Author Correction: Perivascular cells induce microglial phagocytic states and synaptic engulfment via SPP1 in mouse models of Alzheimer’s disease","contentLength":147,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["cognitive-neuroscience"]}