{"id":"9RTqgzgfVW6znxS7Zhn5Q3VS3X2htDF6Gp6N1BxQDjNg8JMHp3hmwyNirJUbbqnN9AJzBoXxzw","title":"eLife: latest articles by subject","displayTitle":"eLife","url":"https://elifesciences.org/rss/subject/neuroscience.xml","feedLink":"https://elifesciences.org/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":28,"items":[{"title":"Mapping vascular network architecture in primate brain using ferumoxytol-weighted laminar MRI","url":"https://elifesciences.org/articles/99940","date":1749600000,"author":"Yuta Urushibata","guid":554,"unread":true,"content":"<article>Mapping the vascular organization of the brain is of great importance across various domains of basic neuroimaging research, diagnostic radiology, and neurology. However, the intricate task of precisely mapping vasculature across brain regions and cortical layers presents formidable challenges, resulting in a limited understanding of neurometabolic factors influencing the brain’s microvasculature. Addressing this gap, our study investigates whole-brain vascular volume using ferumoxytol-weighted laminar-resolution multi-echo gradient-echo imaging in macaque monkeys. We validate the results with published data for vascular densities and compare them with cytoarchitecture, neuron and synaptic densities. The ferumoxytol-induced change in transverse relaxation rate (ΔR*), an indirect proxy measure of cerebral blood volume (CBV), was mapped onto 12 equivolumetric laminar cortical surfaces. Our findings reveal that CBV varies threefold across the brain, with the highest vascular volume observed in the inferior colliculus and lowest in the corpus callosum. In the cerebral cortex, CBV is notably high in early primary sensory areas and low in association areas responsible for higher cognitive functions. Classification of CBV into distinct groups unveils extensive replication of translaminar vascular network motifs, suggesting distinct computational energy supply requirements in areas with varying cytoarchitecture types. Regionally, baseline R* and CBV exhibit positive correlations with neuron density and negative correlations with receptor densities. Adjusting image resolution based on the critical sampling frequency of penetrating cortical vessels allows us to delineate approximately 30% of the arterial–venous vessels. Collectively, these results mark significant methodological and conceptual advancements, contributing to the refinement of cerebrovascular MRI. Furthermore, our study establishes a linkage between neurometabolic factors and the vascular network architecture in the primate brain.</article>","contentLength":2024,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Embedding stochastic dynamics of the environment in spontaneous activity by prediction-based plasticity","url":"https://elifesciences.org/articles/95243","date":1749600000,"author":"Toshitake Asabuki","guid":555,"unread":true,"content":"<article>The brain learns an internal model of the environment through sensory experiences, which is essential for high-level cognitive processes. Recent studies show that spontaneous activity reflects such a learned internal model. Although computational studies have proposed that Hebbian plasticity can learn the switching dynamics of replayed activities, it is still challenging to learn dynamic spontaneous activity that obeys the statistical properties of sensory experience. Here, we propose a pair of biologically plausible plasticity rules for excitatory and inhibitory synapses in a recurrent spiking neural network model to embed stochastic dynamics in spontaneous activity. The proposed synaptic plasticity rule for excitatory synapses seeks to minimize the discrepancy between stimulus-evoked and internally predicted activity, while inhibitory plasticity maintains the excitatory-inhibitory balance. We show that the spontaneous reactivation of cell assemblies follows the transition statistics of the model’s evoked dynamics. We also demonstrate that simulations of our model can replicate recent experimental results of spontaneous activity in songbirds, suggesting that the proposed plasticity rule might underlie the mechanism by which animals learn internal models of the environment.</article>","contentLength":1296,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Activity-dependent synapse elimination requires caspase-3 activation","url":"https://elifesciences.org/articles/101779","date":1749513600,"author":"Zhou Yu","guid":551,"unread":true,"content":"<article>During brain development, synapses are initially formed in excess and are later eliminated in an activity-dependent manner. Weak synapses are preferentially removed, but the mechanism linking neuronal activity to synapse removal is unclear. Here, we show that, in the developing mouse visual pathway, inhibiting synaptic transmission induces postsynaptic activation of caspase-3. Caspase-3 deficiency results in defects in synapse elimination driven by both spontaneous and experience-dependent neural activity. Notably, caspase-3 deficiency blocks activity-dependent synapse elimination, as evidenced by reduced engulfment of inactive synapses by microglia. Furthermore, in a mouse model of Alzheimer’s disease, caspase-3 deficiency protects against synapse loss induced by amyloid-β deposition. Our results reveal caspase-3 activation as a key step in activity-dependent synapse elimination during development and synapse loss in neurodegeneration.</article>","contentLength":953,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Human brain ancestral barcodes","url":"https://elifesciences.org/articles/101163","date":1749513600,"author":"Darryl Shibata","guid":552,"unread":true,"content":"<article>Dynamic CpG methylation ‘barcodes’ were read from 15,000–21,000 single cells from three human male brains. To overcome sparse sequencing coverage, the barcode had ~31,000 rapidly fluctuating X-chromosome CpG sites (fCpGs), with at least 500 covered sites per cell and at least 30 common sites between cell pairs (average of ~48). Barcodes appear to start methylated and record mitotic ages because excitatory neurons and glial cells that emerge later in development were less methylated. Barcodes are different between most cells, with average pairwise differences (PWDs) of ~0.5 between cells. About 10 cell pairs per million were more closely related with PWDs &lt;0.05. Barcodes appear to record ancestry and reconstruct trees where more related cells had similar phenotypes, albeit some pairs had phenotypic differences. Inhibitory neurons showed more evidence of tangential migration than excitatory neurons, with related cells in different cortical regions. fCpG barcodes become polymorphic during development and can distinguish between thousands of human cells.</article>","contentLength":1072,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A library of lineage-specific driver lines connects developing neuronal circuits to behavior in the <i>Drosophila</i> ventral nerve cord","url":"https://elifesciences.org/articles/106042","date":1749513600,"author":"Yu-Chieh David Chen","guid":553,"unread":true,"content":"<article>Understanding developmental changes in neuronal lineages is crucial to elucidate how they assemble into functional neural networks. Studies investigating nervous system development in model systems have only focused on select regions of the CNS due to the limited availability of genetic drivers that target specific neuronal lineages throughout development and adult life. This has hindered our understanding of how distinct neuronal lineages interconnect to form neuronal circuits during development. Here, we present a split-GAL4 library composed of genetic driver lines, which we generated via editing the genomic locus of lineage-specific transcription factors and demonstrate that we can use this library to specifically target most individual neuronal hemilineages in the  ventral nerve cord (VNC) throughout development and into adulthood. Using these genetic driver lines, we found striking morphological changes in neuronal processes within a lineage during metamorphosis. We also demonstrated how neurochemical features of neuronal classes can be quickly assessed. Lastly, we documented behaviors elicited in response to optogenetic activation of individual neuronal lineages and generated a comprehensive lineage-behavior map of the entire fly VNC. Looking forward, this lineage-specific split-GAL4 driver library will provide the genetic tools needed to address the questions emerging from the analysis of the recent VNC connectome and transcriptome datasets.</article>","contentLength":1472,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Heterozygosity for neurodevelopmental disorder-associated <i>TRIO</i> variants yields distinct deficits in behavior, neuronal development, and synaptic transmission in mice","url":"https://elifesciences.org/articles/103620","date":1749427200,"author":"Yevheniia Ishchenko","guid":549,"unread":true,"content":"<article>Genetic variants in  are associated with neurodevelopmental disorders (NDDs) including schizophrenia (SCZ), autism spectrum disorder (ASD), and intellectual disability. TRIO uses its two guanine nucleotide exchange factor (GEF) domains to activate GTPases (GEF1: Rac1 and RhoG; GEF2: RhoA) that control neuronal development and connectivity. It remains unclear how discrete  variants differentially impact these neurodevelopmental events. Here, we investigate how heterozygosity for NDD-associated  variants –  (ASD),  (SCZ) and  (bipolar disorder, BPD) – impacts mouse behavior, brain development, and synapse structure and function. Heterozygosity for different  variants impacts motor, social, and cognitive behaviors in distinct ways that model clinical phenotypes in humans.  variants differentially impact head and brain size, with corresponding changes in dendritic arbors of motor cortex layer 5 pyramidal neurons (M1 L5 PNs). Although neuronal structure was only modestly altered in the  variant heterozygotes, we observe significant changes in synaptic function and plasticity. We also identified distinct changes in glutamate synaptic release in  and  cortico-cortical synapses. The TRIO K1431M GEF1 domain has impaired ability to promote GTP exchange on Rac1, but  mice exhibit increased Rac1 activity, associated with increased levels of the Rac1 GEF Tiam1. Acute Rac1 inhibition with NSC23766 rescued glutamate release deficits in  variant cortex. Our work reveals that discrete NDD-associated  variants yield overlapping but distinct phenotypes in mice, demonstrates an essential role for Trio in presynaptic glutamate release, and underscores the importance of studying the impact of variant heterozygosity in vivo.</article>","contentLength":1735,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Unraveling the impact of genetic variants","url":"https://elifesciences.org/articles/107459","date":1749427200,"author":"Bruce Herring","guid":550,"unread":true,"content":"<article>Experiments in mice reveal how three rare mutations in a gene called  can lead to different neurodevelopmental outcomes.</article>","contentLength":120,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Different roles of D1/D2 medium spiny neurons in the nucleus accumbens in pair bond formation of male mandarin voles","url":"https://elifesciences.org/articles/100292","date":1749168000,"author":"Zijian Lv","guid":548,"unread":true,"content":"<article>The mesolimbic dopamine (DA) system has been implicated in pair bond formation. However, the involvements of DA release, real-time activities, and electrophysiological activities of D1/D2 medium spiny neurons (MSNs) in the nucleus accumbens (NAc) shell in pair bonding remain unclear. This work verified that male mandarin voles after pair bonding released higher levels of DA in the NAc shell and displayed higher levels of D1 MSNs activity and lower levels of D2 MSNs activity upon sniffing their partners compared to upon sniffing an unknown female. Moreover, pair bonding induced differential alterations in both synaptic plasticity and neuronal intrinsic excitability in both D1 MSNs and D2 MSNs. In addition, chemogenetic inhibition of ventral pallidum (VP) -projecting D2 MSNs in the NAc shell enhanced pair bond formation, while chemogenetic activation of VP-projecting D2 MSNs in the NAc shell inhibited pair bond formation. These findings suggest that different neuronal activity of NAc shell D1 MSNs / D2 MSNs regulated by increasing DA release after pair bonding may be a neurobiological mechanism underlying pair bond formation.</article>","contentLength":1141,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Uncertainty-modulated prediction errors in cortical microcircuits","url":"https://elifesciences.org/articles/95127","date":1749081600,"author":"Walter Senn","guid":544,"unread":true,"content":"<article>Understanding the variability of the environment is essential to function in everyday life. The brain must hence take uncertainty into account when updating its internal model of the world. The basis for updating the model are prediction errors that arise from a difference between the current model and new sensory experiences. Although prediction error neurons have been identified in layer 2/3 of diverse brain areas, how uncertainty modulates these errors and hence learning is, however, unclear. Here, we use a normative approach to derive how uncertainty should modulate prediction errors and postulate that layer 2/3 neurons represent uncertainty-modulated prediction errors (UPE). We further hypothesise that the layer 2/3 circuit calculates the UPE through the subtractive and divisive inhibition by different inhibitory cell types. By implementing the calculation of UPEs in a microcircuit model, we show that different cell types can compute the means and variances of the stimulus distribution. With local activity-dependent plasticity rules, these computations can be learned context-dependently, and allow the prediction of upcoming stimuli and their distribution. Finally, the mechanism enables an organism to optimise its learning strategy via adaptive learning rates.</article>","contentLength":1284,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Context-dependent modulations of subthalamo-cortical synchronization during rapid reversals of movement direction in Parkinson’s disease","url":"https://elifesciences.org/articles/101769","date":1749081600,"author":"Petra Fischer","guid":545,"unread":true,"content":"<article>The role of beta band activity in cortico-basal ganglia interactions during motor control has been studied extensively in resting-state and for simple movements, such as button pressing. However, little is known about how beta oscillations change and interact in more complex situations involving rapid changes of movement in various contexts. To close this knowledge gap, we combined magnetoencephalography (MEG) and local field potential recordings from the subthalamic nucleus (STN) in Parkinson’s disease patients to study beta dynamics during initiation, stopping, and rapid reversal of rotational movements. The action prompts were manipulated to be predictable vs. unpredictable. We observed movement-related beta suppression at motor sequence start, and a beta rebound after motor sequence stop in STN power, motor cortical power, and STN-cortex coherence. Despite involving a brief stop of movement, no clear rebound was observed during reversals of turning direction. At the cortical level, beta power decreased bilaterally following reversals, but more so in the hemisphere ipsilateral to movement, due to a floor effect on the contralateral side. In the STN, power modulations varied across patients, with patients displaying brief increases or decreases of high-beta power. Importantly, cue predictability affected these modulations. Event-related increases of STN-cortex beta coherence were generally stronger in the unpredictable than in the predictable condition. In summary, this study reveals the influence of movement context on beta oscillations in basal ganglia-cortex loops when humans change ongoing movements according to external cues. We find that movement scenarios requiring higher levels of caution involve enhanced modulations of subthalamo-cortical beta synchronization. Furthermore, our results confirm that beta oscillations reflect the start and end of motor sequences better than movement changes within a sequence.</article>","contentLength":1952,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Imaging of brain electric field networks with spatially resolved EEG","url":"https://elifesciences.org/articles/100123","date":1749081600,"author":"Vitaly L Galinsky","guid":546,"unread":true,"content":"<article>We present a method for spatially resolving the electric field potential throughout the entire volume of the human brain from electroencephalography (EEG) data. The method is  a variation of the well-known ‘source reconstruction’ methods, but rather a direct solution to the EEG inverse problem based on our recently developed model for brain waves that demonstrates the inadequacy of the standard ‘quasi-static approximation’ that has fostered the belief that such a reconstruction is not physically possible. The method retains the high temporal/frequency resolution of EEG, yet has spatial resolution comparable to (or better than) functional MRI (fMRI), without its significant inherent limitations. The method is validated using simultaneous EEG/fMRI data in healthy subjects, intracranial EEG data in epilepsy patients, comparison with numerical simulations, and a direct comparison with standard state-of-the-art EEG analysis in a well-established attention paradigm. The method is then demonstrated on a very large cohort of subjects performing a standard gambling task designed to activate the brain’s ‘reward circuit’. The technique uses the output from standard extant EEG systems and thus has potential for immediate benefit to a broad range of important basic scientific and clinical questions concerning brain electrical activity. By offering an inexpensive and portable alternative to fMRI, it provides a realistic methodology to efficiently promote the democratization of medicine.</article>","contentLength":1511,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Location- and feature-based selection histories make independent, qualitatively distinct contributions to urgent visuomotor performance","url":"https://elifesciences.org/articles/100280","date":1749081600,"author":"Terrence R Stanford","guid":547,"unread":true,"content":"<article>Attention mechanisms guide visuomotor behavior by weighing physical salience and internal goals to prioritize stimuli as choices for action. Although less well studied, selection history, which reflects multiple facets of experience with recent events, is increasingly recognized as a distinct source of attentional bias. To examine how selection history impacts saccadic choices, we trained two macaque monkeys to perform an urgent version of an oddball search task in which a red target appeared among three green distracters or vice versa. By imposing urgency, performance could be tracked continuously as it transitioned from uninformed guesses to informed choices as a function of processing time. This, in turn, permitted assessment of attentional control as manifest in motor biases, processing speed, and asymptotic accuracy. Here, we found that the probability of making a correct choice was strongly modulated by the histories of preceding target locations and target colors. Crucially, although both effects were gated by success (or reward), their dynamics were clearly distinct: whereas location history promoted a motor bias, color history modulated perceptual sensitivity, and these influences acted independently. Thus, combined selection histories can give rise to enormous swings in visuomotor performance even in simple tasks with highly discriminable stimuli.</article>","contentLength":1379,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A ventral hippocampal-lateral septum pathway regulates social novelty preference","url":"https://elifesciences.org/articles/97259","date":1748995200,"author":"Sonia Corbett Karkare","guid":543,"unread":true,"content":"<article>The ability to distinguish strangers from familiar individuals is crucial for the survival of most mammalian species. In humans, an inability to recognize kin and familiar individuals and engage in appropriate behaviors is associated with several types of dementia, including Alzheimer’s disease. Mice preferentially spend more time investigating a novel individual relative to a familiar individual. Yet, how social novelty-related information drives increased investigation of the novel animal remains poorly understood. Recent evidence has implicated the ventral hippocampus (vHPC) as a key node in encoding information about conspecific identity. Of particular interest are vHPC projections to the lateral septum (LS), a region that has been implicated in driving a wide range of motivated social behaviors. In this study using chemogenetics, optogenetics, and monosynaptic rabies tracing, we identified a novel vHPC-LS-ventral tegmental area (VTA) pathway that is necessary for mice to preferentially investigate novel conspecifics. Using monosynaptic rabies tracing, we established that LS neurons make direct monosynaptic connections onto dopaminergic neurons in the VTA. Thus, we have identified a potential pathway via which conspecific identity could be transformed to drive motivated social behaviors.</article>","contentLength":1314,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The role of GABA in semantic memory and its neuroplasticity","url":"https://elifesciences.org/articles/91771","date":1748908800,"author":"Steve Williams","guid":542,"unread":true,"content":"<article>A fundamental challenge in neuroscience is understanding neural functioning and plasticity of the brain. The anterior temporal lobe (ATL) is a hub for semantic memory, which generates coherent conceptual representations. GABAergic inhibition plays a crucial role in shaping human cognition and plasticity, but it is unclear how this inhibition relates to human semantic memory and its plasticity. Here, we employed a combination of continuous theta burst stimulation (cTBS), MR spectroscopy and fMRI to investigate the role of GABA in semantic memory and its neuroplasticity. We found that inhibitory cTBS increased GABA concentrations in the ATL and reduced blood-oxygen level-dependent (BOLD) activation during semantic tasks. Crucially, changes in GABA were tightly linked to changes in regional activity, suggesting that GABA mediates cTBS-induced plasticity. Individuals with better semantic performance exhibited selective activity in the ATL, attributable to higher GABA levels, which can sharpen distributed semantic representations. Our results revealed a non-linear, inverted-U-shape relationship between GABA levels in the ATL and semantic performance, thus offering an explanation for the individual differences in semantic memory function and neuromodulation outcomes. These findings offer a neurochemical explanation for individual variability in neuromodulation and provide insights for developing targeted interventions for semantic impairments.</article>","contentLength":1461,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Otoacoustic emissions but not behavioral measurements predict cochlear nerve frequency tuning in an avian vocal communication specialist","url":"https://elifesciences.org/articles/102911","date":1748822400,"author":"Yingxuan Wang","guid":540,"unread":true,"content":"<article>Frequency analysis by the cochlea forms a key foundation for all subsequent auditory processing. Stimulus-frequency otoacoustic emissions (SFOAEs) are a potentially powerful alternative to traditional behavioral experiments for estimating cochlear tuning without invasive testing, as is necessary in humans. Which methods accurately predict cochlear tuning remains controversial due to only a single animal study comparing SFOAE-based, behavioral, and cochlear frequency tuning in the same species. The budgerigar () is a parakeet species with human-like behavioral sensitivity to many sounds and the capacity to mimic speech. Intriguingly, previous studies of critical bands, psychophysical tuning curves, and critical ratios in budgerigars show that behavioral tuning sharpness increases dramatically with increasing frequency from 1 to 3.5 kHz, doubling once per octave with peak tuning sharpness from 3.5 to 4 kHz. The pattern contrasts with slower monotonic growth of behavioral tuning sharpness with increasing frequency in other animals, including most avian species, suggesting a possible auditory specialization in budgerigars. We measured SFOAE-based and cochlear-afferent tuning in budgerigars, for comparison to previously reported behavioral results. SFOAE-based and cochlear-afferent tuning sharpness both increased monotonically and relatively slowly for higher frequencies, in contrast to the behavioral pattern. SFOAE-based tuning in budgerigars accurately predicted cochlear frequency tuning, and both measures aligned with typical patterns of cochlear tuning in other species. Divergent behavioral tuning in budgerigars is unlikely attributable to the periphery and could reflect specializations for central processing of masked signals. Our findings highlight the value of SFOAEs for estimating cochlear tuning and caution against direct inference of peripheral tuning from behavioral critical bands, psychophysical tuning curves, and critical ratios.</article>","contentLength":1971,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Chemogenetic stimulation of phrenic motor output and diaphragm activity","url":"https://elifesciences.org/articles/97846","date":1748822400,"author":"Victoria N Jensen","guid":541,"unread":true,"content":"<article>Impaired respiratory motor output contributes to morbidity and mortality in many neurodegenerative diseases and neurologic injuries. We investigated if expressing designer receptors exclusively activated by designer drugs (DREADDs) in the mid-cervical spinal cord could effectively stimulate phrenic motor output to increase diaphragm activation. Two primary questions were addressed: (1) does effective DREADD-mediated diaphragm activation require focal expression in phrenic motoneurons (vs. non-specific mid-cervical expression), and (2) can this method produce a sustained increase in inspiratory tidal volume? Wild-type (C57Bl/6) and ChAT-Cre mice received bilateral intraspinal (C4) injections of an adeno-associated virus (AAV) encoding the hM3D(Gq) excitatory DREADD. In wild-type mice, this produced non-specific DREADD expression throughout the mid-cervical ventral horn. In ChAT-Cre mice, a Cre-dependent viral construct was used to drive neuronal DREADD expression in the C4 ventral horns, targeting phrenic motoneurons. Diaphragm electromyograms (EMG) were recorded in isoflurane-anesthetized spontaneously breathing mice at 4–9 weeks post-AAV delivery. The DREADD ligand JHU37160 (J60) caused a bilateral, sustained (&gt;1 hr) increase in inspiratory EMG bursting in both groups; the relative increase was greater in ChAT-Cre mice. Additional experiments in ChAT-Cre rats were conducted to determine if spinal DREADD activation could increase inspiratory tidal volume during spontaneous breathing, assessed using whole-body plethysmography without anesthesia. Three to four months after intraspinal (C4) injection of AAV driving Cre-dependent hM3D(Gq) expression, intravenous J60 resulted in a sustained (&gt;30 min) increase in tidal volume. Subsequently, phrenic nerve recordings performed under urethane anesthesia confirmed that J60 evoked a &gt;200% increase in inspiratory output. We conclude that targeting mid-cervical spinal DREADD expression to the phrenic motoneuron pool enables ligand-induced, sustained increases in phrenic motor output and tidal volume. Further development of this technology may enable application to clinical conditions associated with impaired diaphragm activation and hypoventilation.</article>","contentLength":2227,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AgRP1 modulates breeding season-dependent feeding behavior in female medaka","url":"https://elifesciences.org/articles/100996","date":1748476800,"author":"Yurika Tagui","guid":537,"unread":true,"content":"<article>Feeding and reproduction are known to be closely correlated with each other, and the seasonal breeders show breeding season-dependent feeding behavior. However, most model animals do not have definite breeding seasonality, and the mechanisms for such feeding behavior remain unclear. Here, we focused on female medaka (); they show breeding season-dependent feeding behavior, and their condition of breeding season can be experimentally controlled by day-length. We first demonstrated that, among previously reported feeding-related peptides (neuropeptides involved in feeding), agouti-related peptide 1 () and neuropeptide y b () show higher brain expression under the breeding condition than under the non-breeding one. Combined with analysis of  knockout medaka, we obtained results to suggest that long day-induced sexually mature condition, especially ovarian estrogenic signals, increase the expressions of  in the brain, which results in increased food intake to promote reproduction. Our findings advance the understanding of neural mechanisms of feeding behavior for reproductive success.</article>","contentLength":1097,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Menopausal hormone therapy and the female brain: Leveraging neuroimaging and prescription registry data from the UK Biobank cohort","url":"https://elifesciences.org/articles/99538","date":1748476800,"author":"Liisa AM Galea","guid":538,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Transdiagnostic compulsivity is associated with reduced reminder setting, only partially attributable to overconfidence","url":"https://elifesciences.org/articles/98114","date":1748476800,"author":"Sam Gilbert","guid":539,"unread":true,"content":"<article>In the current study, we explored the behavioural and cognitive correlates of the transdiagnostic trait ‘compulsive behaviour and intrusive thought’ (CIT) in humans. CIT is associated with impaired metacognition, which in turn has been associated with cognitive offloading behaviours such as external reminder setting that play a key role in fulfilling cognitive goals. In an online study (=600), we investigated individual differences in compulsivity, metacognition, and external reminder usage. Compulsive individuals had reduced preference for external reminders. This was partially, but not fully, attributable to their relative overconfidence. In contrast to previous studies, we found no evidence for an impaired confidence-action link: compulsive individuals used their metacognition to guide offloading just as much as their non-compulsive counterparts. Given the compensatory nature of cognitive offloading, our findings imply that compulsive individuals are at increased risk of inadequate external memory support. Along with transdiagnostic variation in the general population, this finding could also have implications for clinical conditions, such as obsessive-compulsive disorder (OCD).</article>","contentLength":1204,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Quantification of the effect of hemodynamic occlusion in two-photon imaging of mouse cortex","url":"https://elifesciences.org/articles/104914","date":1748390400,"author":"Rebecca Jordan","guid":533,"unread":true,"content":"<article>The last few years have seen an explosion in the number of tools available to measure neuronal activity using fluorescence imaging (Chen et al., 2013; Feng et al., 2019; Jing et al., 2019; Sun et al., 2018; Wan et al., 2021). When performed in vivo, these measurements are invariably contaminated by hemodynamic occlusion artifacts. In widefield calcium imaging, this problem is well recognized. For two-photon imaging, however, the effects of hemodynamic occlusion have only been sparsely characterized. Here, we perform a quantification of hemodynamic occlusion effects using measurements of fluorescence changes observed with GFP expression using both widefield and two-photon imaging in mouse cortex. We find that in many instances the magnitude of signal changes attributable to hemodynamic occlusion is comparable to that observed with activity sensors. Moreover, we find that hemodynamic occlusion effects were spatially heterogeneous, both over cortical regions and across cortical depth, and exhibited a complex relationship with behavior. Thus, hemodynamic occlusion is an important caveat to consider when analyzing and interpreting not just widefield but also two-photon imaging data.</article>","contentLength":1196,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Did you see it?","url":"https://elifesciences.org/articles/107246","date":1748390400,"author":"Ling Liu","guid":534,"unread":true,"content":"<article>Cautious reporting choices can artificially enhance how well analyses of brain activity reflect conscious and unconscious experiences, making distinguishing between the two more challenging.</article>","contentLength":190,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Criterion placement threatens the construct validity of neural measures of consciousness","url":"https://elifesciences.org/articles/102335","date":1748390400,"author":"Timo Stein","guid":535,"unread":true,"content":"<article>How consciousness arises from brain activity has been a topic of intense scientific research for decades. But how does one identify the neural basis of something that is intrinsically personal and subjective? A hallmark approach has been to ask human observers to judge stimuli as ‘seen’ (conscious) and ‘unseen’ (unconscious) and use post hoc sorting of neural measurements based these judgments. Unfortunately, cognitive and response biases are known to strongly affect how observers place their criterion for judging stimuli as ‘seen’ versus ‘unseen’, thereby confounding neural measures of consciousness. Surprisingly however, the effect of conservative and liberal criterion placement on neural measures of unconscious and conscious processing has never been explicitly investigated. Here, we use simulations and electrophysiological brain measurements to show that conservative criterion placement has an unintuitive consequence: rather than selectively providing a cautious estimate of conscious processing, it inflates effect sizes in neural measures of both conscious and unconscious processing, while liberal criterion placement does the reverse. After showing this in simulation, we performed decoding analyses on two electroencephalography studies that employ common subjective indicators of conscious awareness, in which we experimentally manipulated the response criterion. The results confirm that the predicted confounding effects of criterion placement on neural measures of unconscious and conscious processing occur in empirical data, while further showing that the most widely used subjective scale, the Perceptual Awareness Scale (PAS), does not guard against criterion confounds. Follow-up simulations explicate how the experimental context determines whether the relative confounding effect of criterion placement is larger in neural measures of either conscious or unconscious processing. We conclude that criterion placement threatens the construct validity of neural measures of conscious and unconscious processing.</article>","contentLength":2058,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Endogenous oscillatory rhythms and interactive contingencies jointly influence infant attention during early infant-caregiver interaction","url":"https://elifesciences.org/articles/88775","date":1748390400,"author":"Sam V Wass","guid":536,"unread":true,"content":"<article>Almost all early cognitive development takes place in social contexts. At the moment, however, we know little about the neural and micro-interactive mechanisms that support infants’ attention during social interactions. Recording EEG during naturalistic caregiver-infant interactions (N=66), we compare two different accounts. Traditional, didactic perspectives emphasise the role of the caregiver in structuring the interaction, whilst active learning models focus on motivational factors, endogenous to the infant, that guide their attention. Our results show that, already by 12 months, intrinsic cognitive processes control infants’ attention: fluctuations in endogenous oscillatory neural activity associated with changes in infant attentiveness. In comparison, infant attention was not forwards-predicted by caregiver gaze or vocal behaviours. Instead, caregivers rapidly modulated their behaviours in response to changes in infant attention and cognitive engagement, and greater reactive changes associated with longer infant attention. Our findings suggest that shared attention develops through interactive but asymmetric, infant-led processes that operate across the caregiver-child dyad.</article>","contentLength":1202,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A Kv2 inhibitor combination reveals native neuronal conductances consistent with Kv2/KvS heteromers","url":"https://elifesciences.org/articles/99410","date":1748304000,"author":"Zachary Whiddon","guid":530,"unread":true,"content":"<article>KvS proteins are voltage-gated potassium channel subunits that form functional channels when assembled into heteromers with Kv2.1 () or Kv2.2 (). Mammals have 10 KvS subunits: Kv5.1 (), Kv6.1 (), Kv6.2 (), Kv6.3 (), Kv6.4 (), Kv8.1 (), Kv8.2 (), Kv9.1 (), Kv9.2 (), and Kv9.3 (). Electrically excitable cells broadly express channels containing Kv2 subunits and most neurons have substantial Kv2 conductance. However, whether KvS subunits contribute to these conductances has not been clear, leaving the physiological roles of KvS subunits poorly understood. Here, we identify that two potent Kv2 inhibitors, used in combination, can distinguish conductances of Kv2/KvS heteromers and Kv2-only channels. We find that Kv5, Kv6, Kv8, or Kv9-containing channels are resistant to the Kv2-selective pore-blocker RY785 yet remain sensitive to the Kv2-selective voltage sensor modulator guangxitoxin-1E (GxTX). Using these inhibitors in mouse superior cervical ganglion neurons, we find predominantly RY785-sensitive conductances consistent with channels composed entirely of Kv2 subunits. In contrast, RY785-resistant but GxTX-sensitive conductances consistent with Kv2/KvS heteromeric channels predominate in mouse and human dorsal root ganglion neurons. These results establish an approach to pharmacologically distinguish conductances of Kv2/KvS heteromers from Kv2-only channels, enabling investigation of the physiological roles of endogenous KvS subunits. These findings suggest that drugs which distinguish KvS subunits could modulate electrical activity of subsets of Kv2-expressing cell types.</article>","contentLength":1596,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"An antisense oligonucleotide-based strategy to ameliorate cognitive dysfunction in the 22q11.2 Deletion Syndrome","url":"https://elifesciences.org/articles/103328","date":1748304000,"author":"Yijing Chen","guid":531,"unread":true,"content":"<article>Adults and children with the 22q11.2 Deletion Syndrome demonstrate cognitive, social, and emotional impairments and high risk for schizophrenia. Work in mouse model of the 22q11.2 deletion provided compelling evidence for abnormal expression and processing of microRNAs. A major transcriptional effect of the microRNA dysregulation is upregulation of  a component of the ER membrane complex, which promotes membrane insertion of a subset of polytopic and tail-anchored membrane proteins. We previously uncovered a key contribution of EMC10 in mediating the behavioral phenotypes observed in 22q11.2 deletion mouse models. Here, we show that expression and processing of miRNAs is abnormal and  expression is elevated in neurons derived from 22q11.2 deletion carriers. Reduction of  restores defects in neurite outgrowth and calcium signaling in patient neurons. Furthermore, antisense oligonucleotide administration and normalization of  in the adult mouse brain not only alleviates cognitive deficits in social and spatial memory but remarkably sustains these improvements for over 2 months post-injection, indicating its therapeutic potential. Broadly, our study integrates findings from both animal models and human neurons to elucidate the translational potential of modulating  levels and downstream targets as a specific venue to ameliorate disease progression in 22q11.2 Deletion Syndrome.</article>","contentLength":1396,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Integration of head and body orientations in the macaque superior temporal sulcus is stronger for upright bodies","url":"https://elifesciences.org/articles/105714","date":1748304000,"author":"Yordanka Zafirova","guid":532,"unread":true,"content":"<article>The neural processing of faces and bodies is often studied separately, despite their natural integration in perception. Unlike prior research on the neural selectivity for either head or body orientation, we investigated their interaction in macaque superior temporal sulcus (STS) using a monkey avatar with diverse head–body orientation angles. STS neurons showed selectivity for specific combinations of head–body orientations. Anterior STS (aSTS) neurons enabled more reliable decoding of head–body configuration angles compared to middle STS neurons. Decoding accuracy in aSTS was lowest for head–body angle pairs differing only in sign (e.g. head–body orientation difference of ±90° relative to the anatomical midline), and highest for aligned (0°) head–body orientations versus those with maximum angular difference. Inverted bodies showed diminished decoding of head–body orientation angle compared to upright bodies. These findings show that aSTS integrates head and body orientation cues, revealing configuration-specific neural mechanisms, and advance our understanding of social perception.</article>","contentLength":1118,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Commissureless acts as a substrate adapter in a conserved Nedd4 E3 ubiquitin ligase pathway to promote axon growth across the midline","url":"https://elifesciences.org/articles/92757","date":1747958400,"author":"Kelly G Sullivan","guid":529,"unread":true,"content":"<article>In both vertebrates and invertebrates, commissural neurons prevent premature responsiveness to the midline repellant Slit by downregulating surface levels of its receptor Roundabout1 (Robo1). In , Commissureless (Comm) plays a critical role in this process; however, there is conflicting data on the underlying molecular mechanism. Here, we demonstrate that the conserved PY motifs in the cytoplasmic domain of Comm are required allow the ubiquitination and lysosomal degradation of Robo1. Disruption of these motifs prevents Comm from localizing to Lamp1 positive late endosomes and to promote axon growth across the midline in vivo. In addition, we conclusively demonstrate a role for Nedd4 in midline crossing. Genetic analysis shows that  mutations result in midline crossing defects in the  embryonic nerve cord, which can be rescued by introduction of exogenous Nedd4. Biochemical evidence shows that Nedd4 incorporates into a three-member complex with Comm and Robo1 in a PY motif-dependent manner. Finally, we present genetic evidence that Nedd4 acts with Comm in the embryonic nerve cord to downregulate Robo1 levels. Taken together, these findings demonstrate that Comm promotes midline crossing in the nerve cord by facilitating Robo1 ubiquitination by Nedd4, ultimately leading to its degradation.</article>","contentLength":1309,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Subcortical correlates of consciousness with human single neuron recordings","url":"https://elifesciences.org/articles/95272","date":1747872000,"author":"Victor Finomore","guid":528,"unread":true,"content":"<article>Subcortical brain structures such as the subthalamic nucleus or the thalamus are involved in regulating motor and cognitive behavior. However, their contribution to perceptual consciousness remains unclear, due to the inherent difficulties of recording subcortical neuronal activity in humans. Here, we asked neurological patients undergoing surgery for deep brain stimulation to detect weak vibrotactile stimuli applied on their hand while recording single neuron activity from the tip of a microelectrode. We isolated putative single neurons in the subthalamic nucleus and thalamus. A significant proportion of neurons modulated their activity while participants were expecting a stimulus. We found that the firing rate of 23% of these neurons differed between detected and undetected stimuli. Our results provide direct neurophysiological evidence of the involvement of the subthalamic nucleus and the thalamus for the detection of vibrotactile stimuli, thereby calling for a less cortico-centric view of the neural correlates of consciousness.</article>","contentLength":1047,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["journal","general","cognitive-neuroscience"]}