{"id":"9RTqgzgfVW6znxS7Zhn5Q3VS3X2htDF6Gp6N1BxQDjNg8JMHp3hmwyNirJUbbqnN9AJzBoXxzw","title":"eLife: latest articles by subject","displayTitle":"eLife","url":"https://elifesciences.org/rss/subject/neuroscience.xml","feedLink":"https://elifesciences.org/","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":28,"items":[{"title":"Coordinated stimulation of axon regenerative and neurodegenerative transcriptional programs by ATF4 following optic nerve injury","url":"https://elifesciences.org/articles/87528","date":1772064000,"author":"Trent A Watkins","guid":149,"unread":true,"content":"<article>Stress signaling is important for determining the fates of neurons following axonal insults. Previously, we showed that the stress-responsive kinase PERK contributes to injury-induced neurodegeneration (Larhammar et al., 2017). Here, we show that PERK acts primarily through activating transcription factor-4 (ATF4) to stimulate not only pro-apoptotic but also pro-regenerative responses following optic nerve damage. Using conditional knockout mice, we find an extensive PERK/ATF4-dependent transcriptional response that includes canonical ATF4 target genes and modest contributions by C/EBP Homologous Protein (CHOP). Overlap with c-Jun-dependent transcription suggests interplay with a parallel stress pathway that orchestrates regenerative and apoptotic responses. Accordingly, neuronal knockout of ATF4 recapitulates the neuroprotection afforded by PERK deficiency, and PERK or ATF4 knockout impairs optic axon regeneration enabled by disrupting the tumor suppressor PTEN. These findings reveal an integral role for PERK/ATF4 in coordinating neurodegenerative and regenerative responses to CNS axon injury.</article>","contentLength":1111,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Flexible neural representations of abstract structural knowledge in the human entorhinal cortex","url":"https://elifesciences.org/articles/101134","date":1771977600,"author":"Veronika Samborska","guid":148,"unread":true,"content":"<article>Humans’ ability for generalization is outstanding. It is flexible enough to identify cases where knowledge from prior tasks is relevant, even when many features of the current task are different, such as the sensory stimuli or the size of the task state space. We have previously shown that in abstract tasks, humans can generalize knowledge in cases where the only cross-task shared feature is the statistical rules that govern the task’s state–state relationships. Here, we hypothesized that this capacity is associated with generalizable representations in the entorhinal cortex (EC). This hypothesis was based on the EC’s generalizable representations in spatial tasks and recent discoveries about its role in the representation of abstract tasks. We first develop an analysis method capable of testing for such representations in fMRI data, explain why other common methods would have failed for our task, and validate our method through a combination of electrophysiological data analysis, simulations, and fMRI sanity checks. We then show with fMRI that EC representations generalize across complex non-spatial tasks that share a hexagonal grid structural form but differ in their size and sensory stimuli, that is their only shared feature is the rules governing their statistical structure. There was no clear evidence for such generalization in EC for non-spatial tasks with clustered, as opposed to planar, structure.</article>","contentLength":1436,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Size tuning of neural response variability in laminar circuits of macaque primary visual cortex","url":"https://elifesciences.org/articles/86334","date":1771891200,"author":"Maryam Bijanzadeh","guid":146,"unread":true,"content":"<article>Surround suppression and neural response variability are widespread cortical phenomena thought to facilitate and impede, respectively, information processing and perception. Because manipulations that elicit neural response suppression often quench variability, it has been proposed that these two phenomena share a common origin. However, the relationship between surround suppression and variability has not been systematically examined. Surround suppression is mediated by multiple circuits and mechanisms that depend on the size of the sensory stimulus and cortical layer. Variability is also laminar dependent. To understand how surround suppression and variability interact and influence laminar processing, we used laminar electrophysiological recordings to examine how neural response variability and the shared variability among neurons are modulated by visual stimulus size across the layers of macaque primary visual cortex (V1). We find that surround suppression does not always quench variability. Instead, variability is tuned for stimulus size in a layer-dependent manner. In all layers, stimulation of the receptive field (RF) reduced both individual and shared variability relative to pre-stimulus baseline. Expanding the stimulus beyond the RF, into the near RF surround, further decreased variability in infragranular layers, but had little effect in granular and supragranular layers. In contrast, large stimuli extending into the far RF surround increased both individual and shared variability, relative to their value for a stimulus matched to the RF size, in supragranular layers, but decreased them or did not change them in granular and infragranular layers. Surprisingly, stimuli smaller than the RF could increase variability above baseline values, particularly in granular and infragranular layers. Our results indicate that surround suppression and variability are not governed by a single mechanism. Instead, multiple laminar-specific circuits and mechanisms shape variability, highlighting the need for revised models of neural response variability in cortical processing.</article>","contentLength":2104,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Transsaccadic working memory in healthy ageing and neurodegenerative disease","url":"https://elifesciences.org/articles/109581","date":1771891200,"author":"Verena Klar","guid":147,"unread":true,"content":"<article>The brain continuously integrates rapidly changing visual input across eye movements to maintain stable perception, yet the precise mechanisms underpinning dynamic working memory and how these break down in brain diseases remain unclear. We developed a novel eye-tracking paradigm and computational models to investigate how spatial and colour information are updated across saccades in the human brain. Our findings reveal that saccades selectively impair spatial but not colour memory. Computational modelling identified that spatial representations are maintained in a dual eye-centred frame of reference which is actively updated by a noisy memory of saccades but is vulnerable to interference. Using this model, we found that specific mechanistic failures in initial encoding and memory decay, rather than the saccadic updating process itself, account for spatial working memory deficits in Alzheimer’s and Parkinson’s disease. These results provide a mechanistic understanding of how dynamic spatial memory operates in health and its disruption in neurodegenerative disorders.</article>","contentLength":1086,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Inverted encoding of neural responses to audiovisual stimuli reveals super-additive multisensory enhancement","url":"https://elifesciences.org/articles/97230","date":1771804800,"author":"Zak Buhmann","guid":143,"unread":true,"content":"<article>A central challenge for the brain is how to combine separate sources of information from different sensory modalities to optimally represent objects and events in the external world, such as combining someone’s speech and lip movements to better understand them in a noisy environment. At the level of individual neurons, audiovisual stimuli often elicit super-additive interactions, where the neural response is greater than the sum of auditory and visual responses. However, investigations using electroencephalography (EEG) to record brain activity have revealed inconsistent interactions, with studies reporting a mix of super- and sub-additive effects. A possible explanation for this inconsistency is that standard univariate analyses obscure multisensory interactions present in EEG responses by overlooking multivariate changes in activity across the scalp. To address this shortcoming, we investigated EEG responses to audiovisual stimuli using inverted encoding, a population tuning approach that uses multivariate information to characterise feature-specific neural activity. Participants (n=41) completed a spatial localisation task for both unisensory stimuli (auditory clicks, visual flashes) and combined audiovisual stimuli (spatiotemporally congruent clicks and flashes). To assess multivariate changes in EEG activity, we used inverted encoding to recover stimulus location information from event-related potentials (ERPs). Participants localised audiovisual stimuli more accurately than unisensory stimuli alone. For univariate ERP analyses, we found an additive multisensory interaction. By contrast, multivariate analyses revealed a super-additive interaction ~180 ms following stimulus onset, such that the location of audiovisual stimuli was decoded more accurately than that predicted by maximum likelihood estimation. Our results suggest that super-additive integration of audiovisual information is reflected within multivariate patterns of activity rather than univariate evoked responses.</article>","contentLength":2018,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Dynamics of mesoscale brain network during visual discrimination learning revealed by chronic, large-scale single-unit recording","url":"https://elifesciences.org/articles/108083","date":1771804800,"author":"Zhengtuo Zhao","guid":144,"unread":true,"content":"<article>Associating unfamiliar stimuli with appropriate behavior through experience is crucial for survival. While task-relevant information was found to be distributed across multiple brain regions, how regional nodes in this distributed network reorganize their functional interactions throughout learning remains to be elucidated. Here, we performed chronic, large-scale single-unit recording across 10 cortical and subcortical regions using ultra-flexible microelectrode arrays in mice performing a visual decision-making task and tracked mesoscale functional network dynamics throughout learning. Task learning reshaped interregional functional connectivity, leading to the emergence of a subnetwork involving visual and frontal regions during the acquisition of correct No-Go responses. This reorganization was accompanied by a more widespread representation of visual stimulus across regions, and a region’s network rank strongly predicted its peak timing of visual information encoding. Together, our findings revealed that mesoscale networks undergo dynamic restructuring during learning, with functional connectivity ranks influencing the propagation of sensory information across the network.</article>","contentLength":1197,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The influence of sample size and covariate distributions on neuroanatomical normative modeling","url":"https://elifesciences.org/articles/108952","date":1771804800,"author":"Nicolas Langer","guid":145,"unread":true,"content":"<article>Normative models are increasingly used to characterize individual-level brain deviations in neuroimaging studies, but their performance depends heavily on the reference sample used for training or adaptation. In this study, we systematically investigated how sample size and covariate composition of the reference cohort influence model fit, deviation estimates, and clinical readouts in Alzheimer’s disease (AD). Using a discovery dataset (OASIS-3,  = 1032), we trained models on healthy control (HC), subsamples ranging from 5 to 600 individuals, while varying age and sex distributions to simulate biases in reference populations. We further assessed the use of adaptive transfer learning by pre-training models on the UK Biobank ( = 42,747) and adapting them to the clinical dataset applying the same subsampling strategies. We evaluated model performance on a fixed HC test set and quantified deviation score errors, outlier detection, and classification accuracy in both the HC test set and the AD cohort. The findings were replicated in an external validation sample (AIBL,  = 463). Across all settings, model performance improved with increasing sample size, but demographic alignment of the covariates, particularly in age, was essential for reliable deviation estimates. Models trained directly within the dataset achieved stable fit with approximately 200 HCs, while adapted models reached comparable performance with as few as 50 individuals when pre-trained on large-scale data. These results show that robust individual-level modeling can be achieved using moderately sized but demographically matched cohorts, supporting broader application of normative modeling in aging and neurodegeneration research.</article>","contentLength":1720,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Motor biases reflect a misalignment between visual and proprioceptive reference frames","url":"https://elifesciences.org/articles/100715","date":1771459200,"author":"Tianhe Wang","guid":142,"unread":true,"content":"<article>Goal-directed movements can fail due to errors in our perceptual and motor systems. While these errors may arise from random noise within these sources, they also reflect systematic motor biases that vary with the location of the target. The origin of these systematic biases remains controversial. Drawing on data from an extensive array of reaching tasks conducted over the past 30 years, we evaluated the merits of various computational models regarding the origin of motor biases. Contrary to previous theories, we show that motor biases produced by human participants do not arise from systematic errors associated with the sensed hand position during motor planning or from the biomechanical constraints imposed during motor execution. Rather, motor biases are primarily caused by a misalignment between eye-centric and body-centric representations of position. This model can account for motor biases across a wide range of contexts, encompassing movements with the right versus left hand, finger versus hand movements, visible and occluded starting positions, as well as before and after sensorimotor adaptation.</article>","contentLength":1120,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The basolateral amygdala complex and perirhinal cortex represent focal and peripheral states of information processing in rats","url":"https://elifesciences.org/articles/107943","date":1771372800,"author":"Simon Killcross","guid":138,"unread":true,"content":"<article>We previously identified the roles of the basolateral amygdala complex (BLA) and perirhinal cortex (PRh) in sensory preconditioning in male and female rats (Wong et al., 2025). Here, we used variations of a sensory preconditioning protocol to test a general theory that the BLA and PRh represent focal and peripheral states of attention, respectively. We specifically tested predictions derived from the theory regarding when learning about a stimulus that signals danger will be disrupted by BLA or PRh infusions of the -methyl-D-aspartate receptor (NMDAR) antagonist, DAP5. Consistent with the theory, the effects of these infusions depended on the novelty/familiarity of the conditioned stimulus, as well as the manner in which it was paired with foot shock. When a stimulus was novel, its conditioning required NMDAR-activation in the BLA and not the PRh, regardless of whether the stimulus and shock were presented contiguously or separated in time. When a pre-exposed and, thereby, familiar stimulus was presented contiguously with shock, its conditioning again required NMDAR-activation in the BLA and not the PRh. However, when a pre-exposed stimulus was indirectly paired with shock – because it was associatively activated at the time of shock or separated from the shock by another stimulus – its conditioning required NMDAR-activation in the PRh and not the BLA. These findings are discussed in relation to theories of information processing that distinguish between focal and peripheral states of attention/memory, and past studies that have examined the substrates of learning and memory in the PRh and BLA.</article>","contentLength":1625,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Unravelling the neurocognitive mechanisms underlying counterconditioning in humans","url":"https://elifesciences.org/articles/101518","date":1771372800,"author":"Maxime C Houtekamer","guid":139,"unread":true,"content":"<article>Counterconditioning (CC) aims to enhance extinction of threat memories by establishing new associations of opposite valence. While its underlying neurocognitive mechanisms remain largely unexplored, previous studies suggest qualitatively different mechanisms from regular extinction. In this functional MRI study, participants underwent categorical threat conditioning (CS+/CS-: images of animals/tools), followed by either CC (CS + images reinforced with monetary rewards, n=24) or regular extinction (n=24). The following day, we assessed spontaneous recovery of threat responses and episodic memory for CS + and CS- category exemplars. While the ventromedial prefrontal cortex (vmPFC) was activated during regular extinction, participants undergoing CC showed persistent CS+-specific deactivation of the vmPFC and hippocampus, and CS+-specific activation of the nucleus accumbens (NAcc). The following day, physiological threat responses returned in the regular extinction group, but not in the CC group. Counterconditioning furthermore strengthened episodic memory for CS + exemplars presented during CC, and retroactively also for CS + exemplars presented during the threat conditioning phase. Our findings confirm that CC leads to more persistent extinction of threat memories, as well as altered consolidation of the threat conditioning episode. Crucially, we show a qualitatively different activation pattern during CC versus regular extinction, with a shift away from the vmPFC and towards the NAcc.</article>","contentLength":1508,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Impaired excitability of fast-spiking neurons in a novel mouse model of <i>KCNC1</i> epileptic encephalopathy","url":"https://elifesciences.org/articles/103784","date":1771372800,"author":"Yerahm Hong","guid":140,"unread":true,"content":"<article>The recurrent pathogenic variant p.Ala421Val (A421V) is a cause of developmental and epileptic encephalopathy characterized by moderate-to-severe developmental delay/intellectual disability, and infantile-onset treatment-resistant epilepsy with multiple seizure types, including myoclonic seizures. Yet, the mechanistic basis of this disease, and of the  disease spectrum, remains unclear.  encodes Kv3.1, a voltage-gated potassium channel subunit that is strongly and selectively expressed in neurons capable of generating action potentials at high frequency, including parvalbumin-positive fast-spiking GABAergic inhibitory interneurons in cerebral cortex (PV-INs) that are known to be important for cognitive function and plasticity as well as control of network excitation to prevent seizures. In this study, we generate a novel transgenic mouse model with conditional expression of the A421V pathogenic missense variant (-A421V/+ mice) to explore the specific physiological mechanisms of  developmental and epileptic encephalopathy. Our results indicate that global heterozygous expression of the A421V variant leads to cognitive impairment, epilepsy, and premature lethality. We observe decreased PV-IN cell surface expression of Kv3.1 via immunohistochemistry, decreased voltage-gated potassium current density in PV-INs using outside-out nucleated macropatch recordings in brain slice, and profound impairments in the intrinsic excitability of cerebral cortex PV-INs (but not excitatory neurons) via current-clamp electrophysiology.  two-photon calcium imaging revealed altered activity in -A421V/+ PV-INs and excitatory cells, as well as hypersynchronous discharges correlated with brief paroxysmal movements that were subsequently shown to be myoclonic seizures on electroencephalography. We found alterations in PV-IN-mediated inhibitory neurotransmission in young adult but not juvenile -A421V/+ mice relative to wild-type controls. Together, these results establish the specific impact of the recurrent Kv3.1-A421V variant on neuronal excitability and synaptic physiology across development to drive network dysfunction underlying  epileptic encephalopathy.</article>","contentLength":2170,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Cell cycle-dependent cues regulate temporal patterning of the <i>Drosophila</i> central brain neural stem cells","url":"https://elifesciences.org/articles/108259","date":1771372800,"author":"Mubarak Hussain Syed","guid":141,"unread":true,"content":"<article>During nervous system development, diverse types of neurons and glia are sequentially generated by self-renewing neural stem cells (NSCs). Temporal changes in gene expression within NSCs are thought to regulate neural diversity; however, the mechanisms regulating the timing of these temporal gene transitions remain poorly understood.  type 2 NSCs, like human outer radial glia, divide to self-renew and generate intermediate neural progenitors, amplifying and diversifying the population of neurons innervating the central complex, a brain region crucial for sensorimotor coordination. Type 2 NSCs express over a dozen genes temporally, broadly classified as early- and late-expressed genes. A conserved gene, , mediates early-to-late gene expression by activating ecdysone receptor (EcR) expression. However, the timing of EcR expression and, consequently, the transition from early-to-late gene expression remain unknown. This study investigates whether intrinsic mechanisms of cell cycle progression and cytokinesis are required to induce the NSC early-late transition. By generating mutant clones that arrest the NSC cell cycle or block cytokinesis, we show that both processes are necessary for the early-to-late transition. When NSCs are cell cycle or cytokinesis arrested, the early gene Imp fails to be downregulated and persists in the old NSCs, while the late factors EcR and Syncrip fail to be expressed. Furthermore, we demonstrate that the early factor Seven-up is insufficient to drive the transition, despite its normal expression in cell cycle- or cytokinesis-inhibited NSCs. These results suggest that both cell-intrinsic (cell cycle/cytokinesis) and -extrinsic (hormone) cues are required for the early-late NSC gene expression transition.</article>","contentLength":1759,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Deep neural networks to register and annotate cells in moving and deforming nervous systems","url":"https://elifesciences.org/articles/108159","date":1771286400,"author":"Talya S Kramer","guid":133,"unread":true,"content":"<article>Aligning and annotating the heterogeneous cell types that make up complex cellular tissues remains a major challenge in the analysis of biomedical imaging data. Here, we present a series of deep neural networks that allow for automatic non-rigid registration and cell identification, developed in the context of freely moving and deforming invertebrate nervous systems. A semi-supervised learning approach was used to train a  registration network (BrainAlignNet) that aligns pairs of images of the bending  head with single-pixel-level accuracy. When incorporated into an image analysis pipeline, this network can link neurons over time with 99.6% accuracy. This network could also be readily purposed to align neurons from the jellyfish , an organism with a vastly different body plan and set of movements. A separate network (AutoCellLabeler) was trained to annotate &gt;100 neuronal cell types in the  head based on multi-spectral fluorescence of genetic markers. This network labels &gt;100 different cell types per animal with 98% accuracy, exceeding individual human labeler performance by aggregating knowledge across manually labeled datasets. Finally, we trained a third network (CellDiscoveryNet) to perform unsupervised discovery of &gt;100 cell types in the  nervous system: by comparing multi-spectral imaging data from many animals, it can automatically identify and annotate cell types without using any human labels. The performance of CellDiscoveryNet matched that of trained human labelers. These tools should be immediately useful for a wide range of biological applications and should be straightforward to generalize to many other contexts requiring alignment and annotation of dense heterogeneous cell types in complex tissues.</article>","contentLength":1741,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Linking spinal circuit reorganization to recovery after thoracic spinal cord injury","url":"https://elifesciences.org/articles/107480","date":1771286400,"author":"Simon M Danner","guid":134,"unread":true,"content":"<article>Rats exhibit significant recovery of locomotor function following incomplete spinal cord injuries, albeit with altered gait expression and reduced speed and stepping frequency. These changes likely result from and give insight into the reorganization within spared and injured spinal circuitry. Previously, we developed computational models of the mouse spinal locomotor circuitry controlling speed-dependent gait expression (Danner et al., 2017; Zhang et al., 2022). Here, we adapted these models to the rat and used the adapted model to explore potential circuit-level changes underlying altered gait expression observed after recovery from two different thoracic spinal cord injuries (lateral hemisection and contusion) that have roughly comparable levels of locomotor recovery (Danner et al., 2023). The model reproduced experimentally observed gait expression before injury and after recovery from lateral hemisection and contusion and suggests two distinct, injury-specific routes to restored function. First, recovery after lateral hemisection required substantial functional restoration of damaged descending drive and long propriospinal connections, suggesting compensatory plasticity through formation of detour pathways. Second, recovery after a moderate midline contusion predominantly relied on reorganization of spared sublesional networks and altered control of supralesional cervical circuits, compensating for weakened propriospinal and descending pathways. Despite these differences, sensitivity analysis revealed that restored activation of sublesional lumbar rhythm-generating circuits and appropriately balanced lumbar commissural connectivity are the key determinants of post-injury gait expression, suggesting that injury symmetry shapes how the cord reorganizes, but effective recovery in both cases depends on re-engaging these lumbar networks, which makes them prime targets for therapeutic intervention.</article>","contentLength":1930,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Spatially periodic computation in the entorhinal-hippocampal circuit during navigation","url":"https://elifesciences.org/articles/107517","date":1771286400,"author":"Xin Guan","guid":135,"unread":true,"content":"<article>To enable navigation in both physical and mental spaces, the human brain employs a cognitive map constructed from the global metrics of the entorhinal cortex and the local representations of the hippocampus. However, how these two regions coordinate to enable navigation remains poorly understood. Here, we designed an object-matching task where human participants unknowingly manipulated object variants arranged in a ring-like structure around a central prototype. Functional MRI revealed a threefold spatial periodicity in the hippocampal activity that tracked navigation directions from object variants to the central prototype. This hippocampal periodicity was phase-locked with the well-documented sixfold periodicity of the entorhinal cortex, suggesting hierarchical interaction between these regions. Consistent with this neural pattern, a corresponding threefold periodicity was observed in behavioral performance, which was synchronized with hippocampal activity. Finally, an EC-HPC PhaseSync model reproduced this phenomenon, in which the sixfold activity periodicity of entorhinal grid cells across directions projects vectorial representations to the hippocampus, and the collection of these vectors exhibits threefold periodicity to represent conceptual directions. Together, these findings reveal a periodic mechanism through which entorhinal grid codes structure hippocampal vector representations.</article>","contentLength":1414,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A three-dimensional immunofluorescence atlas of the brain of the hackled-orb weaver spider, <i>Uloborus diversus</i>","url":"https://elifesciences.org/articles/107732","date":1771286400,"author":"Gregory Artiushin","guid":136,"unread":true,"content":"<article>Spider orb-web building is a captivating, rare example of animal construction, whose neural underpinnings remain undiscovered. We created a three-dimensional atlas for the hackled-orb weaver, , based on immunostaining for the presynaptic component, synapsin, in whole-mounted spider synganglia. Whereas spider neuroanatomy has thus far been most comprehensively studied in cursorial species, this optically sectioned atlas contributes a continuous, finely resolved model of the central nervous system of an orb-web building spider. Aligned to this volume, we examined the expression patterns of neuronal populations representing many of the classical neurotransmitters and neuromodulators (GABA, acetylcholine, serotonin, and octopamine/tyramine), as well as a subset of neuropeptides (allatostatin A, crustacean cardioactive peptide (CCAP), FMRFamide, proctolin) – detailing immunoreactivity in an unbiased fashion throughout the synganglion to reveal co-expression in known structures (such as the arcuate body), as well as novel neuropils not readily apparent in prior spider research, including the tonsillar neuropil as well as a potential protocerebral bridge. These structures provide targets for future functional studies, and taken together, could represent a spider equivalent of the central complex, contributing to behaviors such as web-building.</article>","contentLength":1360,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Neural connectome of the ctenophore statocyst","url":"https://elifesciences.org/articles/108420","date":1771286400,"author":"Sanja Jasek","guid":137,"unread":true,"content":"<article>Ctenophores possess a unique gravity receptor (statocyst) in their aboral organ formed by four clusters of ciliated balancer cells that collectively support a statolith. During reorientation, differential loads on the balancer cilia lead to altered beating of the ciliated comb rows to elicit turns. To study the neural bases of gravity sensing, we used volume electron microscopy to image the aboral organ of the ctenophore . We reconstructed 1011 cells, including syncytial neurons that form a nerve net. The syncytial neurons synapse on the balancer cells and also form reciprocal connections with the bridge cells that span the statocyst. High-speed imaging revealed that balancer cilia beat and arrest in a coordinated manner but with differences between the sagittal and tentacular planes of the animal, reflecting nerve-net organization. Our results suggest a coordinating rather than sensory–motor function for the nerve net and inform our understanding of the diversity of nervous-system organization across animals.</article>","contentLength":1027,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Single molecule counting detects low-copy glycine receptors in hippocampal and striatal synapses","url":"https://elifesciences.org/articles/109447","date":1771200000,"author":"Yana Vella","guid":129,"unread":true,"content":"<article>Glycine receptors (GlyRs) are heteropentameric chloride channels that mediate fast inhibitory neurotransmission in the brainstem and spinal cord, where they regulate motor and sensory processes. GlyRs are clustered in the postsynaptic membrane by strong interactions of the β subunit with the scaffold protein gephyrin. Even though  mRNA is highly expressed throughout the brain, the existence of synaptic GlyRs remains controversial as there is little conclusive evidence using conventional fluorescence microscopy and electrophysiological recordings. Here, we exploit the high sensitivity and spatial resolution of single molecule localisation microscopy (SMLM) to investigate the presence of GlyRs at inhibitory synapses in the brain, focusing on several areas of the telencephalon. Making use of a knock-in mouse model expressing endogenous mEos4b-tagged GlyRβ, we identified few GlyRs in sub-regions of the hippocampus. Dual-colour SMLM revealed that these sparse receptors are integrated within the postsynaptic gephyrin domain, pointing to a possible role in maintaining the structural integrity of inhibitory synapses. In contrast, we found functionally relevant numbers of synaptic GlyRs at inhibitory synapses in the ventral striatum. Our results highlight the strength of SMLM to detect few and sparsely distributed synaptic molecules in complex samples and to analyse their organisation with high spatial precision.</article>","contentLength":1429,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Adjoint propagation of error signal through modular recurrent neural networks for biologically plausible learning","url":"https://elifesciences.org/articles/108237","date":1771200000,"author":"Zhuo Liu","guid":130,"unread":true,"content":"<article>Biologically plausible learning mechanisms have implications for understanding brain functions and engineering intelligent systems. Inspired by the multi-scale recurrent connectivity in the brain, we introduce an adjoint propagation (AP) framework, in which the error signals arise naturally from recurrent dynamics and propagate concurrently with forward inference signals. AP inherits the modularity of multi-region recurrent neural network (MR-RNN) models and leverages the convergence properties of RNN modules to facilitate fast and scalable training. This framework eliminates the biologically implausible feedback required by the backpropagation (BP) algorithm, and allows concomitant error propagation for multiple tasks through the same RNN. We demonstrate that AP succeeds in training on standard benchmark tasks, achieving accuracies comparable to BP-trained networks while adhering to neurobiological constraints. The training process exhibits robustness, maintaining performance over extended training epochs. Importantly, AP supports flexible resource allocation for multiple cognitive tasks, consistent with observations in neuroscience. This framework bridges artificial and biological learning principles, paving the way for energy-efficient intelligent systems inspired by the brain and offering a mechanistic theory that can guide experimental investigations in neuroscience.</article>","contentLength":1394,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Frictional instabilities as an alternative to friction coefficient in fine touch perception","url":"https://elifesciences.org/articles/104543","date":1771200000,"author":"Truc T Ngo","guid":131,"unread":true,"content":"<article>Fine touch perception is often correlated to material properties and friction coefficients, but the inherent variability of human motion has led to low correlations and contradictory findings. Instead, we hypothesized that humans use frictional instabilities to discriminate between objects. Here, we constructed a set of coated surfaces with minimal physical differences, but due to differences in surface chemistry, generated different types of instabilities depending on how quickly a finger is slid and pressed during sliding. In one experiment, we used a mechanical mock finger to quantify and classify differences in instability formation from different coated surfaces. In a second experiment, participants perform a discrimination task using the same coated surfaces. Using the data from these two experiments, we found that human discrimination response times were faster with surfaces where the mock finger produced more stiction spikes and discrimination accuracy was higher where the mock finger produced more steady sliding. Conversely, traditional metrics like surface roughness or average friction coefficient did not relate to tactile discriminability. In fact, the typical method of averaging friction coefficients led to a spurious correlation which erroneously suggests that distinct objects should feel identical and identical objects should feel distinct—similar to findings by others. Friction instabilities may offer a more predictive and tractable framework of fine touch perception than friction coefficients, which would accelerate the design of tactile interfaces.</article>","contentLength":1593,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Synaptic footprints of time in working memory","url":"https://elifesciences.org/articles/110590","date":1771200000,"author":"Marissa L Heintschel","guid":132,"unread":true,"content":"<article>Temporary changes in synapses may allow working memory to keep track of both events and their timing.</article>","contentLength":101,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Sex peptide targets distinct higher order processing neurons in the brain to induce the female post-mating response","url":"https://elifesciences.org/articles/98283","date":1770681600,"author":"Mohanakarthik P Nallasivan","guid":124,"unread":true,"content":"<article>Sex peptide (SP) transferred during mating induces female post-mating responses including refractoriness to re-mate and increased oviposition in . Yet, where SP-target neurons reside remained uncertain. Here, we show that expression of membrane-tethered SP (mSP) predominantly in the head or trunk either reduces receptivity or increases oviposition, respectively. Using fragments from large regulatory regions of ,  and  genes together with intersectional expression of mSP, we identified distinct interneurons in the brain and abdominal ganglion controlling receptivity and oviposition. These SP response-inducing neurons (SPRINz) can induce post-mating responses through SP received by mating. Trans-synaptic mapping of neuronal connections reveals input from sensory processing neurons and two post-synaptic trajectories as output. Hence, SP-target neurons operate as key integrators of sensory information for decision-making of behavioural outputs. Multi-modularity of SP-targets further allows females to adjust SP-mediated male manipulation to physiological state and environmental conditions for maximising reproductive success.</article>","contentLength":1137,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Compressed sensing-based approach identifies modular neural circuitry driving learned pathogen avoidance","url":"https://elifesciences.org/articles/97340","date":1770681600,"author":"Timothy Hallacy","guid":125,"unread":true,"content":"<article>An animal’s survival hinges on its ability to integrate past information to modify future behavior. The nematode  adapts its behavior based on prior experiences with pathogen exposure, transitioning from attraction to avoidance of the pathogen. A systematic screen for the neural circuits that integrate the information of previous pathogen exposure to modify behavior has not been feasible because of the lack of tools for neuron type-specific perturbations. We overcame this challenge using methods based on compressed sensing to efficiently determine the roles of individual neuron types in learned avoidance behavior. Our screen revealed that distinct sets of neurons drive exit from lawns of pathogenic bacteria and prevent lawn re-entry. Using calcium imaging of freely behaving animals and optogenetic perturbations, we determined the neural dynamics that regulate one key behavioral transition after infection: stalled re-entry into bacterial lawns. We find that key neuron types govern pathogen lawn-specific stalling but allow the animal to enter nonpathogenic  lawns. Our study shows that learned pathogen avoidance requires coordinated transitions in discrete neural circuits and reveals the modular structure of this complex adaptive behavioral response to infection.</article>","contentLength":1282,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Backward conditioning reveals flexibility in infralimbic cortex inhibitory memories","url":"https://elifesciences.org/articles/108719","date":1770681600,"author":"Vincent Laurent","guid":126,"unread":true,"content":"<article>While the infralimbic cortex (IL) is recognized as critical for behavioral inhibition, the content of the inhibitory memories stored in this region remains elusive. To probe this content, we examined some of the conditions that allow retrieval and facilitation of an inhibitory memory stored in the IL using optogenetic stimulation in female and male rats. We found that IL stimulation did not facilitate an initial fear extinction session. However, prior experience with fear extinction enabled IL stimulation to facilitate subsequent fear extinction. Importantly, the facilitative effects of IL stimulation were not limited to fear extinction experience, as prior exposure to backward fear conditioning also enabled IL stimulation to enhance later fear extinction. The effects were stimulus-specific and did not depend on the motivational context present during the prior experience, as backward appetitive conditioning allowed IL stimulation to facilitate later fear extinction. Additional experiments ruled out stimulus familiarity as an explanation for the facilitative effects of IL stimulation and demonstrated that IL-mediated facilitations occur in procedures other than fear extinction. Together, these findings demonstrate that the IL stores inhibitory memories that are extremely flexible since they can be retrieved and used across many inhibitory procedures and distinct motivational contexts. These features establish the IL as a critical hub for the flexible application of inhibitory knowledge that allows adaptive responses in dynamic environments.</article>","contentLength":1566,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Sense of control buffers against stress","url":"https://elifesciences.org/articles/105025","date":1770681600,"author":"Quentin JM Huys","guid":127,"unread":true,"content":"<article>Stress is one of the most pervasive causes of mental ill health across the lifespan. Subjective dimensions of stress perception, such as perceived control, are especially potent in shaping stress responses. While the impact of reduced or no control over stress is well understood, much less is known about whether heightened feelings of control buffer against the negative impact of later stress. We designed a novel paradigm with excellent psychometric properties to sensitively capture and induce different states of subjective control. Across two studies with a non-clinical sample of 768 adults, we show a robust association between sense of control and stress as well as symptoms of mental ill health. More importantly, in a subsample of 295 participants, we show that compared to a neutral control group, inducing a heightened state of subjective control buffers against the impact of later stress. These findings demonstrate a causal role for a heightened sense of control in mitigating the negative impact of stressful experiences and spell out important directions for future preventative interventions.</article>","contentLength":1112,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Progressive overfilling of readily releasable pool underlies short-term facilitation at recurrent excitatory synapses in layer 2/3 of the rat prefrontal cortex","url":"https://elifesciences.org/articles/102923","date":1770681600,"author":"Yujin Kim","guid":128,"unread":true,"content":"<article>Short-term facilitation of recurrent excitatory synapses within the cortical network has been proposed to support persistent activity during working memory tasks, yet the underlying mechanisms remain poorly understood. We characterized short-term plasticity at the local excitatory synapses in layer 2/3 of the rat medial prefrontal cortex and studied its presynaptic mechanisms. Low-frequency stimulation induced slowly developing facilitation, whereas high-frequency stimulation initially induced strong depression followed by rapid facilitation. This non-monotonic delayed facilitation after a brief depression resulted from a high vesicular fusion probability and slow activation of Ca-dependent vesicle replenishment, which led to the overfilling of release sites beyond their basal occupancy. Pharmacological and gene knockdown (KD) experiments revealed that the facilitation was mediated by phospholipase C/diacylglycerol signaling and synaptotagmin 7 (Syt7). Notably, Syt7 KD abolished facilitation and slowed the refilling rate of vesicles with high fusion probability. Furthermore, Syt7 deficiency in layer 2/3 pyramidal neurons impaired the acquisition of trace fear memory and reduced c-Fos activity. In conclusion, Ca- and Syt7-dependent overfilling of release sites mediates synaptic facilitation at layer 2/3 recurrent excitatory synapses and contributes to temporal associative learning.</article>","contentLength":1403,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Redefining borders in the sensorimotor cortex","url":"https://elifesciences.org/articles/110364","date":1770595200,"author":"Sylvain Crochet","guid":122,"unread":true,"content":"<article>Experiments mapping individual neurons in the sensorimotor cortex of mice show that sharp transitions in functional properties can define cortical regions.</article>","contentLength":155,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"In vivo autofluorescence lifetime imaging of spatial metabolic heterogeneities and learning-induced changes in the <i>Drosophila</i> mushroom body","url":"https://elifesciences.org/articles/106040","date":1770595200,"author":"Thomas Preat","guid":123,"unread":true,"content":"<article>Neuronal energy regulation is increasingly recognized as a critical factor underlying brain functions and their pathological alterations, yet the metabolic dynamics that accompany cognitive processes remain poorly understood. As a label-free and minimally invasive technique, fluorescence lifetime imaging (FLIM) of coenzymes NADH and NADPH (collectively referred to as NAD(P)H) offers the possibility to resolve cellular metabolic profiles with high spatial precision. However, NAD(P)H FLIM’s capacity to detect subtle variations in neuronal metabolism has not been demonstrated. In this study, we applied NAD(P)H FLIM to map the metabolic profiles of  neurons in vivo across multiple scales, focusing on the primary centers for associative memory: the mushroom bodies (MBs). At a broad scale, we obtained an overview of the metabolic signatures of the main brain tissue and identified a marked difference between neuropil and cortex areas. At a finer scale, our findings revealed notable heterogeneity in the basal metabolic profiles of distinct MB neuron subtypes. Measurements performed after associative olfactory learning also uncovered a low-magnitude subtype-specific metabolic shift associated with memory formation, suggesting the utility of NAD(P)H FLIM in detecting physiology-driven changes linked to brain function. These results establish a promising framework for studying the spatial heterogeneities and the dynamics of cerebral energy metabolism in vivo.</article>","contentLength":1474,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["general","cognitive-neuroscience"]}