{"id":"BRWJ2YmdUFp2rgwSecpv5tY4VRBTNuM7LDhE527gGTPQeSJW","title":"Communications Biology","displayTitle":"Communications Biology","url":"https://www.nature.com/commsbio.rss","feedLink":"http://feeds.nature.com/commsbio/rss/current","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":8,"items":[{"title":"The type VI secretion system of <i>Acinetobacter</i>: mechanisms, biology and therapeutic potential","url":"https://www.nature.com/articles/s42003-026-09782-w","date":1772150400,"author":"Lei Song","guid":19,"unread":true,"content":"We synthesize advances in Acinetobacter T6SS biology, revealing how non-canonical structural solutions and multilayered regulation create an adaptable system for competition, persistence, and host immune modulation.","contentLength":215,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Reactive oxygen species-producing genes regulate mosquito midgut bacteria colonization, transcriptomic changes and cell repair","url":"https://www.nature.com/articles/s42003-025-09024-5","date":1772150400,"author":"Olivier Andre Sparagano","guid":20,"unread":true,"content":"In the Aedes Albopictus midgut, Nox—but not Duox—mainly drives reactive oxygen species production, which mediates the elimination of pathogenic bacteria, induces transcriptomic changes, and promotes epithelial repair","contentLength":220,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Bone marrow endosteum houses Hedgehog-susceptible Dlx5-expressing osteoblast precursor cells","url":"https://www.nature.com/articles/s42003-026-09649-0","date":1772150400,"author":"Noriaki Ono","guid":21,"unread":true,"content":"Dlx5+ cells in the postnatal bone marrow endosteum act as a transient but potent source of osteoblasts. Hedgehog activation in these precursors during bone growth shifts their fates toward adipocytes, leading to bone loss and spontaneous fractures.","contentLength":248,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Population coding for visual and auditory quantity in human numerotopic maps","url":"https://www.nature.com/articles/s42003-026-09752-2","date":1772150400,"author":"Michael A. Skeide","guid":22,"unread":true,"content":"Functional magnetic resonance imaging at 7 Tesla reveals an overarching coding scheme for visual and auditory numerosity in the human brain.","contentLength":140,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Afforestation of severely desertified land in semi-arid areas promotes soil carbon and nitrogen accumulation through microbial necromass","url":"https://www.nature.com/articles/s42003-026-09775-9","date":1772150400,"author":"Jinliang Wang","guid":23,"unread":true,"content":"The composite structural equation model reveals the mechanism by which microbial necromass promote soil carbon sequestration after afforestation in severely desertified land in semi-arid areas.","contentLength":193,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Generative models of cell dynamics: from Neural ODEs to flow matching","url":"https://www.nature.com/articles/s42003-026-09758-w","date":1772150400,"author":"Fabian J. Theis","guid":24,"unread":true,"content":"Neural ODEs unify continuous dynamics and neural networks to model cellular dynamics in single-cell omics. This review surveys applications from trajectory modling to gene regulatory network inference, highlighting technical innovations from Optimal Transport to Flow Matching.","contentLength":277,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"DNA repair in darkness: evolutionary conservation of photolyase function beyond light","url":"https://www.nature.com/articles/s42003-026-09750-4","date":1772150400,"author":"Zhiqiu Huang","guid":25,"unread":true,"content":"A recent cavefish study overturns the classic view of photolyases as light-dependent enzymes. Research shows CPD photolyase repairs oxidative DNA damage in darkness, revealing a dual function that explains its conservation in cave species","contentLength":238,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"ATPase N-ethylmaleimide-sensitive factor mediated calcium dependent fusion pore closure and endocytosis","url":"https://www.nature.com/articles/s42003-026-09743-3","date":1772064000,"author":"Dongsheng Wang","guid":18,"unread":true,"content":"N-ethylmaleimide-sensitive factor (NSF) mediated disassembly of trans-SNARE complexes is identified as the mechanism regulating fusion pore closure. This activity is critical for Ca²⁺dependent exo-endocytosis coupling and vesicle pool maintenance.","contentLength":250,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["cognitive-neuroscience"]}