{"id":"DVAkPJXe6RxZ4pJrotwGsmeh684sZ6CYNvYzttEpFJAUPuCLnN6NCm2UtRpNEufB8Um9qzFPFt3Poq","title":"Wiley: Human Brain Mapping: Table of Contents","displayTitle":"Human Brain Mapping","url":"https://onlinelibrary.wiley.com/feed/10970193/most-recent","feedLink":"https://onlinelibrary.wiley.com/journal/10970193?af=R","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":3,"items":[{"title":"Frequency‐Resolved Cortical Functional Connectivity Across the Adult Lifespan","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70484?af=R","date":1772178289,"author":"Santeri Ruuskanen,  Juan Camilo Avendano‐Diaz,  Mia Liljeström,  Lauri Parkkonen","guid":555,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/34e4bd38-9a49-429d-8065-0feb1cf44d5d/hbm70484-toc-0001-m.png\" alt=\"Frequency-Resolved Cortical Functional Connectivity Across the Adult Lifespan\"><p>An analysis of magnetoencephalography (MEG) recordings from 576 adults aged 18–87 years revealed frequency-dependent changes in cortical functional connectivity across the adult lifespan, which are not explained by changes in source power. Beta-band (13–30 Hz) connectivity at rest is associated with sensorimotor attenuation independent of these age-related effects.</p><p>The operation of the human brain relies on functional networks enabled by inter-areal oscillatory synchronization between neuronal populations. Although disruptions in this functional connectivity are associated with brain disorders, evidence on its healthy age-dependent variation and behavioral relevance remains limited. Utilizing magnetoencephalography (MEG) recordings from 576 adults aged 18–87 years, we investigated the evolution of resting-state functional connectivity (rs-FC) across the healthy adult lifespan. We observed age-related, frequency-specific changes in widespread cortical networks. Alpha-band (8–13 Hz) rs-FC decreased, while delta (1–4 Hz), theta (4–8 Hz), and gamma-band (40–90 Hz) rs-FC increased with age. Beta-band (13–30 Hz) rs-FC followed a non-linear trajectory, peaking in middle age. The global delta, theta, alpha, and beta-band patterns differed from concurrent changes in oscillatory power, underscoring their dissociable contributions. Notably, reduced beta-band rs-FC was associated with increased sensorimotor attenuation, indicating that changes in rs-FC are behaviorally relevant for sensorimotor function. These findings advance our understanding of healthy brain aging and highlight a link between resting-state brain activity and sensorimotor integration.</p>","contentLength":1700,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Exploring the Role of the Rich Club in Network Control of Neurocognitive States","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70485?af=R","date":1772169116,"author":"Alina N. Podschun,  Richard F. Betzel,  Urs Braun,  Sebastian Markett","guid":554,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/7c53ea18-c32f-4fdc-bda6-d8684f3877a1/hbm70485-toc-0001-m.png\" alt=\"Exploring the Role of the Rich Club in Network Control of Neurocognitive States\"><p>Using a network control theoretical framework, we found that the brain's rich club does not optimally control dynamics of the brain. Instead, size-matched sets of random peripheral regions had a significantly higher impact on control metrics, questioning the rich club's proposed role as a control center of the human brain.</p><p>The brain's rich club is a network of particularly densely interconnected regions, metabolically costly to maintain but central to the balance between functional segregation and integration. We assessed whether the rich club can accordingly be described as a control center of the brain, and present a systematic analysis of its involvement in maintenance of and traversal between various cognitively relevant functional states. Brain states were defined based on fMRI task-evoked and resting-state patterns of activity as provided by the Human Connectome Project (HCP). Using tools from network control theory (NCT), we computed the necessary effort needed for control of dynamics when the rich club, versus a size-matched set of low-degree peripheral regions, was prohibited from exerting control over dynamics. Control energy needed to traverse functional states was significantly higher, and stability of states significantly lower, when the set of peripheral regions was prohibited from control. Findings were stable across various rich-club and null model definitions and across different parameter settings. A region's contribution to optimal control processes was instead associated with its affiliation with certain intrinsic connectivity networks and its position on the visual-sensorimotor, but not sensory-transmodal cortical gradient. We accordingly report that the rich club was systematically less involved in control of dynamics than the size-matched set of peripheral regions. These results do not negate an integratory role of the rich club, but question its proposed role as a driver of control. Indeed, if it would inhabit such a role, we would have expected opposite results. Our findings fit with a position describing the rich club as a passive “data-highway” which, by means of its high connectivity, can be easily controlled by peripheral regions and thus facilitate relevant communication channels between them. We call for methodological expansions of the control theoretical toolbox allowing for elaborations on the temporal dynamics of control processes.</p>","contentLength":2411,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Issue Information","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70490?af=R","date":1772093341,"author":"wileyonlinelibrary@wiley.com (Wiley Online Library)","guid":553,"unread":true,"content":"<article>Human Brain Mapping, Volume 47, Issue 4, March 2026. </article>","contentLength":53,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["cognitive-neuroscience"]}