{"id":"DVAkPJXe6RxZ4pJrotwGsmeh684sZ6CYNvYzttEpFJAUPuCLnN6NCm2UtRpNEufB8Um9qzFPFt3Poq","title":"Wiley: Human Brain Mapping: Table of Contents","displayTitle":"Human Brain Mapping","url":"https://onlinelibrary.wiley.com/feed/10970193/most-recent","feedLink":"https://onlinelibrary.wiley.com/journal/10970193?af=R","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":24,"items":[{"title":"Microstructural Characterization of Short Association Fibers Related to Long‐Range White Matter Tracts in Normative Development","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70255?af=R","date":1749523931,"author":"Chloe Cho,  Maxime Chamberland,  Francois Rheault,  Daniel Moyer,  Bennett A. Landman,  Kurt G. Schilling","guid":396,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/97fef21c-2b65-4060-a137-17a0fb062170/hbm70255-toc-0001-m.png\" alt=\"Microstructural Characterization of Short Association Fibers Related to Long-Range White Matter Tracts in Normative Development\"><p>This study investigates superficial white matter using advanced quantitative diffusion tractography. This paper addresses three key objectives: (1) mapping short association fibers in relation to long-range white matter tracts, (2) characterizing typical neurodevelopmental changes, and (3) investigating the relationship between microstructural changes in SAFs and long-range white matter tracts.</p><p>Short association fibers (SAFs) in the superficial white matter play a key role in mediating local cortical connections but have not been well-studied as innovations in whole-brain diffusion tractography have only recently been developed to study superficial white matter. Characterizing SAFs and their relationship to long-range white matter tracts is crucial to advance our understanding of neurodevelopment during the period from childhood to young adulthood. This study aims to (1) map SAFs in relation to long-range white matter tracts, (2) characterize typical neurodevelopmental changes across these white matter pathways, and (3) investigate the relationship between microstructural changes in SAFs and long-range white matter tracts. Leveraging a cohort of 616 participants ranging in age from 5.6 to 21.9 years old, we performed quantitative diffusion tractography and advanced diffusion modeling with diffusion tensor imaging (DTI) and neurite orientation dispersion and density imaging (NODDI). Robust linear regression models were applied to analyze microstructural features, including fractional anisotropy (FA), mean diffusivity (MD), axial diffusivity (AD), radial diffusivity (RD), intracellular volume fraction (ICVF), isotropic volume fraction (ISOVF), and orientation dispersion index (ODI). Our results reveal that both SAFs and long-range tracts exhibit similar overall developmental patterns, characterized by negative associations of MD, AD, and RD with age and positive associations of FA, ICVF, ISOVF, and ODI with age. Notably, FA, AD, and ODI exhibit significant differences between SAFs and long-range tracts, suggesting distinct neurodevelopmental trajectories between superficial and deep white matter. In addition, significant differences were found in MD, RD, and ICVF between males and females, highlighting variations in neurodevelopment. This normative study provides insights into typical microstructural changes of SAFs and long-range white matter tracts during development, laying a foundation for future research to investigate atypical development and dysfunction in disease pathology.</p>","contentLength":2525,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Do Transformers and CNNs Learn Different Concepts of Brain Age?","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70243?af=R","date":1749489823,"author":"Nys Tjade Siegel,  Dagmar Kainmueller,  Fatma Deniz,  Kerstin Ritter,  Marc‐Andre Schulz","guid":395,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/ef68353c-e722-44c5-bdc3-12a99a4a7477/hbm70243-toc-0001-m.png\" alt=\"Do Transformers and CNNs Learn Different Concepts of Brain Age?\"><p>(a) Modern shifted window transformer and well-established ResNet50 CNN predicted brain age with on-par accuracy. (b) Effect sizes between prediction errors (brain age gaps, BAGs) of patients and matched controls were similar for CNN and transformers across neurological and psychiatric diseases, yielding no indication that different model architectures base their predictions on different brain aging effects.</p><p>“Predicted brain age” refers to a biomarker of structural brain health derived from machine learning analysis of T1-weighted brain magnetic resonance (MR) images. A range of machine learning methods have been used to predict brain age, with convolutional neural networks (CNNs) currently yielding state-of-the-art accuracies. Recent advances in deep learning have introduced transformers, which are conceptually distinct from CNNs, and appear to set new benchmarks in various domains of computer vision. Given that transformers are not yet established in brain age prediction, we present three key contributions to this field: First, we examine whether transformers outperform CNNs in predicting brain age. Second, we identify that different deep learning model architectures potentially capture different (sub-)sets of brain aging effects, reflecting divergent “concepts of brain age”. Third, we analyze whether such differences manifest in practice. To investigate these questions, we adapted a Simple Vision Transformer (sViT) and a shifted window transformer (SwinT) to predict brain age, and compared both models with a ResNet50 on 46,381 T1-weighted structural MR images from the UK Biobank. We found that SwinT and ResNet performed on par, though SwinT is likely to surpass ResNet in prediction accuracy with additional training data. Furthermore, to assess whether sViT, SwinT, and ResNet capture different concepts of brain age, we systematically analyzed variations in their predictions and clinical utility for indicating deviations in neurological and psychiatric disorders. Reassuringly, we observed no substantial differences in the structure of brain age predictions across the model architectures. Our findings suggest that the choice of deep learning model architecture does not appear to have a confounding effect on brain age studies.</p>","contentLength":2274,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Neurophysiological Basis of Emotional Face Perception and Working Memory Load in a Dual‐Task MEG Study","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70242?af=R","date":1749489258,"author":"Katharina Lingelbach,  Jochem W. Rieger","guid":394,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/4908d503-129c-417a-9808-aa9cf40e800e/hbm70242-toc-0001-m.png\" alt=\"Neurophysiological Basis of Emotional Face Perception and Working Memory Load in a Dual-Task MEG Study\"><p>We investigated emotional face processing and working memory in a dual-task MEG-eyetracking study. Task-relevant negative faces increased evoked magnetic fields in regions associated with emotional face processing and attentional control, while high working memory load decreased alpha and beta power in temporo- and parieto-occipital areas, suggesting greater resource depletion under these conditions. Gaze behavior was affected by an interaction between working memory load and emotional expression.</p><p>Research on the neurophysiological effects of emotional face processing, working memory (WM) load, and their interaction in dual-tasks remains scarce. Therefore, we conducted a combined magnetoencephalography eye-tracking study with 47 participants. The dual-task temporally interleaved a facial emotion discrimination task with a visuo-spatial n-back task. Source-space cluster analyzes of event-related magnetic fields (ERFs) and oscillations revealed significant main effects of emotional expression and WM load. During emotion discrimination, enhanced ERFs for negative facial expressions located across the insula, ACC, and face-specific occipital regions suggest amplified emotion processing but also the recruitment of attentional control mechanisms. During the n-back phase, emotional faces did not affect evoked responses when they were task-irrelevant. Interaction trends in pupil dilation indicated that emotion-specific processing is diminished under high WM load. During the n-back phase, increased WM load reduced alpha and low beta oscillations in temporo- and parieto-occipital areas. In addition, reduced target fixations in the presence of negative facial distractors indicated a tendency toward emotion-specific interference. Furthermore, sustained increased WM load affected perceived valence, pupil size, and reaction time in both subtasks. A convergence of neurophysiological, physiological, and behavioural findings points to specific processing modes with greater resource depletion for negative expressions and high WM load in the dual-task. In conclusion, the study advanced our understanding of (a) circumstances under which emotional faces modulate ERFs in a dual-task, (b) mechanisms underlying emotion discrimination, (c) interaction effects of emotional expression and WM load in gaze behavior, as well as (d) how WM-related oscillatory alpha and beta power is affected by increasing load.</p>","contentLength":2422,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Brain Aging in Patients With Cardiovascular Disease From the UK Biobank","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70252?af=R","date":1749488361,"author":"Elizabeth Mcavoy,  Emma A. M. Stanley,  Anthony J. Winder,  Matthias Wilms,  Nils D. Forkert","guid":393,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/4fedd83f-4515-47db-beb3-2c3f796572b8/hbm70252-toc-0001-m.png\" alt=\"Brain Aging in Patients With Cardiovascular Disease From the UK Biobank\"><p>This study reveals that in patients with certain cardiovascular diseases there is atypical&nbsp;biological brain age predicted by an artificial intelligence model from T1-weighted brain MRIs. This suggests the existence of distinct aging-like patterns within the brain in the precense of cardiovascular conditions. These findings show the complex interaction between cardiovascular health and neurological health.</p><p>The brain undergoes complex but normal structural changes during the aging process in healthy adults, whereas deviations from the normal aging patterns of the brain can be indicative of various conditions as well as an increased risk for the development of diseases. The brain age gap (BAG), which is defined as the difference between the chronological age and the machine learning-predicted biological age of an individual, is a promising biomarker for determining whether an individual deviates from normal brain aging patterns. While the BAG has shown promise for various neurological diseases and cardiovascular risk factors, its utility to quantify brain changes associated with diagnosed cardiovascular diseases has not been investigated to date, which is the aim of this study. T1-weighted MRI scans from healthy participants in the UK Biobank were used to train a convolutional neural network (CNN) model for biological brain age prediction. The trained model was then used to quantify and compare the BAGs for all participants in the UK Biobank with known cardiovascular diseases, as well as healthy controls and patients with known neurological diseases for benchmark comparisons. Saliency maps were computed for each individual to investigate whether brain regions used for biological brain age prediction by the CNN differ between groups. The analyses revealed significant differences in BAG distributions for 10 of the 42 sex-specific cardiovascular disease groups investigated compared to healthy participants, indicating disease-specific variations in brain aging. However, no significant differences were found regarding the brain regions used for brain age prediction as determined by saliency maps, indicating that the model mostly relied on healthy brain aging patterns, even in the presence of cardiovascular diseases. Overall, the findings of this work demonstrate that the BAG is a sensitive imaging biomarker to detect differences in brain aging associated with specific cardiovascular diseases. This further supports the theory of the heart–brain axis by exemplifying that many cardiovascular diseases are associated with atypical brain aging.</p>","contentLength":2578,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Network Occlusion Sensitivity Analysis Identifies Regional Contributions to Brain Age Prediction","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70239?af=R","date":1749121226,"author":"Lingfei He,  Siyu Wang,  Cheng Chen,  Yaping Wang,  Qingcheng Fan,  Congying Chu,  Lingzhong Fan,  Junhai Xu","guid":392,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/8d317f0d-febd-44f3-b965-66fd47f7338e/hbm70239-toc-0001-m.png\" alt=\"Network Occlusion Sensitivity Analysis Identifies Regional Contributions to Brain Age Prediction\"><p>A low-bias, lightweight deep learning model for brain age prediction reveals the human brain's aging process through network occlusion sensitivity analysis, identifying the thalamus's dominant role across the lifespan. The frontoparietal and default mode networks show a peak-shaped contribution pattern from development to aging.</p><p>Deep learning frameworks utilizing convolutional neural networks (CNNs) have frequently been used for brain age prediction and have achieved outstanding performance. Nevertheless, deep learning remains a black box as it is hard to interpret which brain parts contribute significantly to the predictions. To tackle this challenge, we first trained a lightweight, fully CNN model for brain age estimation on a large sample data set ( = 3054, age range = [8,80 years]) and tested it on an independent data set ( = 555, age range = [8,80 years]). We then developed an interpretable scheme combining network occlusion sensitivity analysis (NOSA) with a fine-grained human brain atlas to uncover the learned invariance of the model. Our findings show that the dorsolateral, dorsomedial frontal cortex, anterior cingulate cortex, and thalamus had the highest contributions to age prediction across the lifespan. More interestingly, we observed that different regions showed divergent patterns in their predictions for specific age groups and that the bilateral hemispheres contributed differently to the predictions. Regions in the frontal lobe were essential predictors in both the developmental and aging stages, with the thalamus remaining relatively stable and saliently correlated with other regional changes throughout the lifespan. The lateral and medial temporal brain regions gradually became involved during the aging phase. At the network level, the frontoparietal and the default mode networks show an inverted U-shape contribution from the developmental to the aging stages. The framework could identify regional contributions to the brain age prediction model, which could help increase the model interpretability when serving as an aging biomarker.</p>","contentLength":2106,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Neuroanatomical Changes in the Stopping Network Across the Adult Lifespan Assessed With Quantitative and Diffusion MRI","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70240?af=R","date":1749117927,"author":"Sarah A. Kemp,  Pierre‐Louis Bazin,  Steven Miletić,  Russell J. Boag,  Max C. Keuken,  Mark R. Hinder,  Birte U. Forstmann","guid":391,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/fe52b28b-cd2b-4bef-9638-44285c7efa92/hbm70240-toc-0001-m.png\" alt=\"Neuroanatomical Changes in the Stopping Network Across the Adult Lifespan Assessed With Quantitative and Diffusion MRI\"><p>Response inhibition enables us to modify ongoing motor actions, but this process becomes impaired in older age. We examined age-related anatomical changes to the response inhibition network using diffusion and quantitative MRI, and found that white matter degradation and iron accumulation may drive these observed behavioural changes.</p><p>Response inhibition, the cancellation of planned movement, is essential for everyday motor control. Extensive fMRI and brain stimulation research provides evidence for the crucial role of a number of cortical and subcortical regions in response inhibition, including the subthalamic nucleus (STN), presupplementary motor area (preSMA) and the inferior frontal gyrus (IFG). Current models assume that these regions operate as a network, with action cancellation originating in the cortical areas and then executed rapidly via the subcortex. Response inhibition slows in older age, a change that has been attributed to deterioration or changes in the connectivity and integrity of this network. However, previous research has mainly used whole-brain approaches when investigating changes in structural connectivity across the lifespan or has used simpler measures to investigate structural ageing. Here, we used high-resolution quantitative and diffusion MRI to extensively examine the anatomical changes that occur in this network across the lifespan. We found age-related changes in iron concentration in these tracts, increases in the apparent diffusion coefficient and some evidence for a decrease in myelin content. Conversely, we found very little evidence for age-related anatomical changes in the regions themselves. We propose that some of the functional changes observed in these regions in older adult populations (e.g., increased BOLD recruitment) are a reflection of alterations to the connectivity between the regions rather than localised regional change.</p>","contentLength":1903,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Elucidating Development Trajectories of Brain Functional Abnormalities in Major Depressive Disorder Utilizing a Data‐Driven Disease Progression Model","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70249?af=R","date":1749081013,"author":"Yuhong Zheng,  Peng Wang,  Chi Yao,  Jinghua Wang,  Jinhui Wang,  Shao‐Wei Xue","guid":390,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/227ec77d-f66b-4b11-989e-e8d8eaf3c0b0/hbm70249-toc-0001-m.png\" alt=\"Elucidating Development Trajectories of Brain Functional Abnormalities in Major Depressive Disorder Utilizing a Data-Driven Disease Progression Model\"><p>Major depressive disorder exhibits profound phenotypic and temporal heterogeneity. This study aims to identify distinct brain change trajectories in MDD using the subtype and stage inference model to deepen our understanding of heterogeneity, as well as to compare the cognitive function change patterns among subtypes with different trajectories.</p><p>Concerns have arisen regarding the heterogeneity of patients with major depressive disorder (MDD), particularly when the varying disease progression trajectories among individuals are overlooked. Recognizing these distinct trajectories is crucial for personalized assessments and accurate disease progression predictions in MDD, posing a significant challenge in clinical practice. We utilized a data-driven subtype and stage inference (SuStaIn) model to infer trajectories based on cross-sectional amplitude of low-frequency fluctuations (ALFF) derived from resting-state functional magnetic resonance imaging data of 833 patients with MDD and 834 healthy controls. Based on distinct trajectories, two subtypes of MDD were identified: Subtype 1 showed declining ALFF from paracentral lobule (PCL) to thalamus to medial orbitofrontal cortex (OFCmed), with higher core depression scores and gray matter atrophy, whereas Subtype 2 had an opposing trajectory, with initial OFCmed ALFF decrease gradually extending to PCL. Our findings contribute to a better understanding of MDD heterogeneity and facilitate precise disease progression predictions.</p>","contentLength":1492,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Spatio‐Temporal Signatures of Cognitive Function After Pediatric Arterial Ischemic Stroke—A Pilot Study","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70248?af=R","date":1748960736,"author":"Karl‐Heinz Nenning,  Florian Ph. S. Fischmeister,  Astrid Novak,  Rainer Seidl,  Smadar Ovadia‐Caro,  Ting Xu,  Gregor Kasprian,  Lisa Bartha‐Doering,  Kathrin Kollndorfer","guid":389,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/55615995-9a86-4a2a-bce4-9b496c19e981/hbm70248-toc-0001-m.png\" alt=\"Spatio-Temporal Signatures of Cognitive Function After Pediatric Arterial Ischemic Stroke—A Pilot Study\"><p>Here, we used resting-state fMRI to study transient brain states after childhood stroke and how their dynamics relate to cognition. We found that in particular increased dynamics of a frontoparietal state were associated with lower cognitive performance, and that the location of a focal lesion was more informative than lesion size alone.</p><p>Childhood arterial ischemic stroke is a severe disorder that can cause lasting cognitive impairments, particularly in executive functions. Although early research assumed an improved outcome in childhood stroke patients compared to adults, more recent studies indicate similar rates of disabilities and cognitive impairment, with widespread brain network disruptions underlying these deficits. Here, we used resting-state fMRI to study alterations in functional brain dynamics and their association with cognitive outcome in children and adolescents after childhood stroke. We used co-activation pattern analysis to characterize five recurring brain states and their temporal properties in a cohort of 16 patients and 17 age-matched controls. We found that in pediatric stroke patients, a specific brain state characterizing the frontoparietal network was more prevalent and more frequently involved in state transitions. This was paralleled by lower occurrence rates of a brain state related to default mode network deactivation. Moreover, our analysis showed that these dynamics relate more to the extent to which the lesion impacts functional networks than to lesion size alone. Taken together, our findings suggest that disrupted brain dynamics following childhood stroke relate to cognitive performance and that the location of a focal lesion can have wide-ranging implications on brain state dynamics.</p>","contentLength":1746,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Mapping Caudolenticular Gray Matter Bridges in the Human Brain Striatum Through Diffusion Magnetic Resonance Imaging and Tractography","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70245?af=R","date":1748960489,"author":"Graham Little,  Charles Poirier,  Arnaud Bore,  Martin Parent,  Laurent Petit,  Maxime Descoteaux","guid":388,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/6e83c3fe-0893-4f44-9053-4f903ec3528a/hbm70245-toc-0001-m.png\" alt=\"Mapping Caudolenticular Gray Matter Bridges in the Human Brain Striatum Through Diffusion Magnetic Resonance Imaging and Tractography\"><p>This work demonstrates that diffusion MRI is sensitive to an anisotropic signal oriented along the caudolenticular gray matter bridges (CLGBs) of the striatum. A tractography approach was developed to track this signal, reconstructing the CLGBs and demonstrating that the signal is present across the entirety of these gray matter structures.</p><p>In primates, the putamen and the caudate nucleus are connected by ~1 mm-thick caudolenticular gray matter bridges (CLGBs) interspersed between the white matter bundles of the internal capsule. Little is understood about the functional or microstructural properties of the CLGBs. In studies proposing high resolution diffusion magnetic resonance imaging (dMRI) techniques, CLGBs have been qualitatively identified as an example of superior imaging quality; however, the microstructural properties of these structures have yet to be examined. In this study, it is demonstrated for the first time that dMRI is sensitive to an organized anisotropic signal oriented in the direction parallel to the CLGBs, suggesting that dMRI could be a useful imaging method for probing the microstructure of the CLGBs. To demonstrate the anisotropic diffusion signal is coherently organized along the extent of the CLGBs and to enable a subsequent CLGB microstructural measurement, a customized tractography seeding and filtering method is proposed that utilizes the shape of the human striatum (putamen + caudate nucleus) to reconstruct the CLGBs in 3D. The proposed seeding strategy seeds tractography streamlines outward and normal to the surface of a 3D model of the striatum such that reconstructed streamlines are more likely to follow the diffusion signal peaks aligned parallel to the CLGBs. The method is applied to three different diffusion datasets, namely a high resolution 760 μm isotropic diffusion dataset acquired on a single subject, the test–retest cohort included as part of the human connectome project ( = 44) with diffusion data acquired at 1.25 mm isotropic, and a locally acquired “clinical” test–retest dataset acquired at 2.0 mm isotropic ( = 24). Reconstructed CLGBs directly overlap expected gray matter regions in the human brain for all three datasets. In addition, the method is shown to accurately reconstruct CLGBs repeatedly across multiple test–retest cohorts. The tractography CLGB reconstructions are then used to extract a quantitative measurement of microstructure from a local model of the diffusion signal along the CLGBs themselves. This is the first work to comprehensively study the CLGBs in&nbsp;vivo using dMRI and presents techniques suitable for future human neuroscience studies targeting these structures.</p>","contentLength":2701,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Event‐Marked Windowed Communication: Inferring Activity Propagation from Neural Time Series","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70223?af=R","date":1748608144,"author":"Varun Madan Mohan,  Thomas F. Varley,  Robin F. H. Cash,  Caio Seguin,  Andrew Zalesky","guid":387,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/33202205-d012-4dd5-8009-337aeca1eea6/hbm70223-toc-0001-m.png\" alt=\"Event-Marked Windowed Communication: Inferring Activity Propagation from Neural Time Series\"><p>Event-marked Windowed Communication (EWC)—a pipeline to estimate communication patterns from regional neural recordings. EWC captures inter-regional communication by first identifying spontaneous, endogenous perturbations, or “events”, from neural recordings, and then tracking their propagation by gauging post-perturbation statistical effects on downstream regions, using Functional Connectivity.</p><p>Tracking how activity or signal perturbations propagate in nervous systems is crucial to understanding interareal communication in the brain. Current analytical methodologies are not well suited to systematically infer interareal activity propagation from neural time series recordings. Here, we propose Event-marked Windowed Communication (EWC), a framework to infer activity propagation between neural elements by tracking the statistical consequence of spontaneous, endogenous regional perturbations. EWC tracks the downstream effect of these perturbations by subsampling the neural time series and quantifying statistical dependences using established functional connectivity measures. We test EWC on simulations of neural dynamics and demonstrate the retrieval of ground truth motifs of directional signaling, over a range of model configurations. We also show that EWC can capture activity propagation in a computationally efficient manner by benchmarking it against more advanced FC estimation methods such as transfer entropy. Lastly, we showcase the utility of EWC to infer whole-brain activity propagation maps from magnetoencephalography (MEG) recordings. Networks computed using EWC were compared to those inferred using transfer entropy and were found to be highly correlated (median  = 0.81 across subjects). Importantly, our framework is flexible and can be applied to activity time series captured by diverse functional neuroimaging modalities, opening new avenues for the study of neural communication.</p>","contentLength":1927,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Prediction Model and Nomogram for Amyloid Positivity Using Clinical and MRI Features in Individuals With Subjective Cognitive Decline","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70238?af=R","date":1748525032,"author":"Qinjie Li,  Liang Cui,  Yihui Guan,  Yuehua Li,  Fang Xie,  Qihao Guo","guid":386,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/404be630-d86f-45dc-a768-cda24c6b2ae4/hbm70238-toc-0001-m.png\" alt=\"Prediction Model and Nomogram for Amyloid Positivity Using Clinical and MRI Features in Individuals With Subjective Cognitive Decline\"><p>We established and validated a machine-learning model and nomogram in individuals with SCD based on cognitive, sMRI, and fMRI data. Our model achieved 83% accuracy to predict Aβ+ in the brain, with an AUC of 88%, sensitivity of 81%, and specificity of 85% in the test set.</p><p>There is an urgent need for the precise prediction of cerebral amyloidosis using noninvasive and accessible indicators to facilitate the early diagnosis of individuals with the preclinical stage of Alzheimer's disease (AD). Two hundred and four individuals with subjective cognitive decline (SCD) were enrolled in this study. All subjects completed neuropsychological assessments and underwent 18F-florbetapir PET, structural MRI, and functional MRI. A total of 315 features were extracted from the MRI, demographics, and neuropsychological scales and selected using the least absolute shrinkage and selection operator (LASSO). The logistic regression (LR) model, based on machine learning, was trained to classify SCD as either β-amyloid (Aβ) positive or negative. A nomogram was established using a multivariate LR model to predict the risk of Aβ+. The performance of the prediction model and nomogram was assessed with area under the curve (AUC) and calibration. The final model was based on the right rostral anterior cingulate thickness, the grey matter volume of the right inferior temporal, the ReHo of the left posterior cingulate gyrus and right superior temporal gyrus, as well as MoCA-B and AVLT-R. In the training set, the model achieved a good AUC of 0.78 for predicting Aβ+, with an accuracy of 0.72. The validation of the model also yielded a favorable discriminatory ability with an AUC of 0.88 and an accuracy of 0.83. We have established and validated a model based on cognitive, sMRI, and fMRI data that exhibits adequate discrimination. This model has the potential to predict amyloid status in the SCD group and provide a noninvasive, cost-effective way that might facilitate early screening, clinical diagnosis, and drug clinical trials.</p>","contentLength":2036,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Neural Electrical Correlates of Subjective Happiness","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70224?af=R","date":1748348369,"author":"Wataru Sato,  Takanori Kochiyama,  Shota Uono","guid":385,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/feed8da8-bcbc-49be-9f1a-4c6d7ee46ee6/hbm70224-toc-0001-m.png\" alt=\"Neural Electrical Correlates of Subjective Happiness\"><p>We investigated neural electrical correlates of subjective happiness by analyzing resting-state magnetoencephalography and measures of subjective happiness. Gamma-band lower spontaneous neural fluctuation values in the right precuneus were associated with higher subjective happiness scores. These findings suggest that gamma-band activity in the precuneus implements subjective happiness.</p><p>Happiness is a subjective experience that can serve as the ultimate goal for humans. A recent study that employed resting-state functional magnetic resonance imaging (fMRI) reported that spontaneous fluctuation (fractional amplitude of low-frequency fluctuation: fALFF) in the precuneus is negatively associated with subjective happiness. However, little is known about the neural electrical correlates of subjective happiness, which can provide direct evidence of neural activity and insights regarding the underlying psychological, cellular, and neurotransmitter mechanisms. Therefore, we measured 400-channel whole-head magnetoencephalography (MEG) during resting state in participants whose subjective happiness was evaluated using questionnaires. We conducted source reconstruction analysis utilizing bandpass-filtered MEG data and analyzed the fALFF of the band-limited power time series as an index of spontaneous neural fluctuation. Gamma-band fALFF values in the right precuneus were negatively associated with subjective happiness scores (partial correlation coefficient = −0.56). These findings indicate that subjective happiness has a neural electrical correlate of reduced spontaneous fluctuation of gamma-band neuronal oscillations in the right precuneus, and that it could be mediated by a reduction in wandering, clinging self-consciousness through heightened -methyl--aspartate-dependent gamma-aminobutyric acid-ergic parvalbumin inhibitory interneuron activity.</p>","contentLength":1874,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Neurometabolite Alterations Associated With Cannabis Use: A Proton Magnetic Resonance Spectroscopy Meta‐Analysis","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70236?af=R","date":1748347788,"author":"Anna E. Kirkland,  Brittney D. Browning,  ReJoyce Green,  Samuel O. Agbeh,  Lindsay M. Squeglia","guid":384,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/78e5f560-9cab-4319-995d-b31018a6601c/hbm70236-toc-0001-m.png\" alt=\"Neurometabolite Alterations Associated With Cannabis Use: A Proton Magnetic Resonance Spectroscopy Meta-Analysis\"><p>This is the first meta-analysis to consolidate the extant 1H-MRS studies focused on the neurometabolic effects of cannabis. Despite the few studies available, the evidence suggests cannabis use may impact important neural processes, including glutamatergic and GABAergic functioning (glutamate, glutamine, and GABA), neural health (N-acetylaspartate), and glial functioning (-inositol).</p><p>Little is known about the neurometabolic effects of cannabis use. Using meta-analytic modeling of proton magnetic resonance spectroscopy (1H-MRS) studies, this study aimed to assess the differences in brain metabolite levels associated with cannabis use (PROSPERO: CRD42020209890) to inform treatment development for cannabis use disorder (CUD). Hedge's  with random-effects modeling was used, and heterogeneity and publication bias indices were assessed. A complete literature search was conducted, and 15 studies met the inclusion criteria (e.g., 1H-MRS, cannabis group compared to a control group, brain region-specific results, necessary data to complete modeling). There were 29 models across gray matter regions in the brain. All models had between 2 and 5 studies (), indicating that results should be interpreted with caution due to the limited number of available studies. Compared to the control groups, the cannabis-using groups showed lower levels of GABA and N-acetylaspartate in the anterior cingulate cortex ( = 3); lower glutamate in the basal ganglia/striatum ( = 2); and lower glutamine and -inositol in the thalamus ( = 2; although the two effect sizes came from the same sample). This is the first meta-analysis to consolidate the extant 1H-MRS studies focused on the neurometabolic effects of cannabis. Despite the few studies available, the evidence suggests cannabis use may impact important neural processes, including glutamatergic and GABAergic functioning (glutamate, glutamine, and GABA), neural health (N-acetylaspartate), and glial functioning (-inositol). The findings should be interpreted with caution considering the small sample size; the inability to test the impact of demographic, substance use, and methodological factors; and the heterogeneity of studies. Understanding the neurobiological effects of cannabis may inspire novel pharmacotherapy and/or psychosocial interventions for CUD.</p>","contentLength":2324,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Hierarchical Organization of Bilateral Prefrontal‐Basal Ganglia Circuits for Response Inhibition Control","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70235?af=R","date":1748347407,"author":"Liyue Lin,  Yishu Chen,  Zhengyuan Fan,  Wei Xiong,  Xuan Wang,  Hongfei Ji,  Jie Li,  Jie Zhuang","guid":383,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/7f98dd8d-fba2-412d-a285-d316ddd8c9af/hbm70235-toc-0001-m.png\" alt=\"Hierarchical Organization of Bilateral Prefrontal-Basal Ganglia Circuits for Response Inhibition Control\"><p>The functional asymmetry of the bilateral inhibitory control system in lexical decision task.</p><p>Response inhibition control is primarily supported by the right inferior frontal gyrus (IFG) and the prefrontal-basal ganglia network, though the mechanisms behind right lateralization and regional interplay remain unclear. In this fMRI study, we explore the neural substrates supporting efficient inhibition control and examine whether the typical right lateralization of IFG activation can be modulated by stimulus properties (semantic features) and inhibitory demand (reaction times, RT). We chose a Go/No-Go lexical decision task, utilizing concrete and abstract words as Go stimuli and pseudo-word as No-Go stimuli. Behavioral results reveal that inhibition is more effective during concrete word sessions compared to abstract word sessions, suggesting a modulation of cognitive inhibition by semantic features. Neuroimaging results further demonstrate that successful inhibition activates bilateral IFG, indicating a flexible right lateralization pattern of IFG activation that varies with stimulus properties. To examine how varying inhibitory demands modulate neural activation patterns, we reclassified concrete and abstract sessions into fast and slow sessions based on RT, followed by within-group comparisons. Our study highlights the crucial role of the bilateral subthalamic nucleus (STN) in efficient inhibition, with increased activation associated with rapid response inhibition. Furthermore, we report enhanced neural coupling between the right IFG and multiple functionally connected regions, including bilateral insula, putamen, and pallidum, as well as between the right middle frontal gyrus and other prefrontal regions during rapid inhibitory responses, whereas no engagement of the left IFG was observed in efficient inhibition. These findings imply a hierarchical functional organization of the bilateral fronto-basal ganglia circuits, in which the right prefrontal regions play a dominant role in inhibition control, supported by basal ganglia regions, while the left IFG may serve a supplementary function. Stimulus properties can modulate right lateralization, underscoring the dynamic and flexible nature of the prefrontal-basal ganglia network in inhibition control.</p>","contentLength":2289,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Functional Connectivity Patterns Following Mild Traumatic Brain Injury and the Association With Longitudinal Cognitive Function","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70237?af=R","date":1748346926,"author":"Goretti España‐Irla,  Emma M. Tinney,  Meishan Ai,  Mark Nwakamma,  Timothy P. Morris","guid":382,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/e4354a96-479d-4ab6-b68e-dec7b9e7541e/hbm70237-toc-0001-m.png\" alt=\"Functional Connectivity Patterns Following Mild Traumatic Brain Injury and the Association With Longitudinal Cognitive Function\"><p>High-resolution fMRI using multi-voxel pattern analysis (MVPA) reveals distinct alterations in functional connectivity across multiple brain networks in acute mTBI patients. These connectivity changes are associated with cognitive performance over 12 months, highlighting both detrimental and adaptive neuroplastic changes in response to injury.</p><p>Functional magnetic resonance imaging (fMRI) has revealed subtle neuroplastic changes in brain networks following mild traumatic brain injury (mTBI), even when standard clinical imaging fails to detect abnormalities. However, prior findings have been inconsistent, in part due to methodological differences and high researcher degrees of freedom in region-based analyses, which often rely on predefined hypotheses and overlook complex, distributed connectivity patterns. Here, we apply an unbiased, data-driven multi-voxel pattern analysis (MVPA) to examine whole-brain functional connectivity differences in a large cohort of individuals with acute mTBI. Unlike conventional statistical approaches, MVPA enables a data-driven analysis of brain-wide connectivity patterns without requiring prior assumptions about the location or nature of abnormalities, allowing for the identification of the most informative features. This approach provides an exploratory characterization of whole-brain functional connectivity patterns and their relationship with cognitive recovery, offering new insights into the neural mechanisms underlying post-injury outcomes. A total of 265 adults (87 women) between 18 and 83 years old with Glasgow Coma Scale (GCS) scores of 13–15 were included in this analysis. Two replicate samples ( = 165,  = 155), with similar demographic characteristics, were also included. Data were collected as part of the prospective multi-center Transforming Research and Clinical Knowledge in TBI (TRACK-TBI). The goal of this study was to assess whole-brain functional connectivity patterns using fc-MVPA and post hoc seed-to-voxel analyses in a large, well-characterized sample to determine if changes in functional connectivity can differentiate subacute mTBI (within 2 weeks of injury) from a matched group of orthopedic control subjects ( = 49). Additionally, we aimed to investigate whether these connectivity patterns were linked to cognitive performance at 2 weeks, 6 months, and 12 months post-injury to better understand cognitive trajectories and recovery over time in individuals with mTBI. Voxel-to-voxel functional connectivity across the entire connectome revealed significant differences between TBI and no TBI in the functional connectivity patterns of 8 clusters (-voxel &lt; 0.001, FEW cluster-level  &lt; 0.05) ( &gt; 40, Fmax = 15.36), including right occipital cortex, anterior cingulate gyrus, inferior and middle temporal gyrus, right thalamus, left cerebellum, and the bilateral frontal pole. These clusters belong mainly to the visual network (VIS), frontoparietal network (FPN), default mode network (DMN) and limbic network (LIM). Post hoc characterization of each significant cluster revealed by MVPA using seed-to-voxel analysis showed a mixed pattern of connectivity between relevant networks and subcortico-cortical connections. After connectivity characterization, visual-motor skills assessed with Trail Making Test (TMT) A were significantly associated with the increased anticorrelation between the inferior temporal cortex and the bilateral occipital pole (FPN-VIS connectivity), along with decreased anticorrelations between the cerebellum and extensive areas of the somatomotor network (SMN) over 12 months post injury. Additionally, hypoconnectivity between the frontal pole (LIM) and anterior cingulate gyrus (salience network [SAL]) was associated with better executive functions performance measured by TMT-B over 12 months post-mTBI. In our study examining neuroplastic changes following TBI across the entire voxel-to-voxel functional connectome, we identified significant differences in the functional connectivity patterns of several regions known to be particularly vulnerable to injury mechanisms. Our findings highlight the complex and compensatory nature of brain network alterations after mTBI, suggesting both detrimental and adaptive changes in connectivity that affect cognitive functions. Consequently, our study provides novel evidence that specific brain networks and regions are particularly susceptible to functional connectivity changes during the acute stages of mTBI, which are related to cognitive recovery post-injury.</p>","contentLength":4569,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Characterization of Portable Ultra‐Low Field MRI Scanners for Multi‐Center Structural Neuroimaging","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70217?af=R","date":1747986947,"author":"Emil Ljungberg,  Francesco Padormo,  Megan Poorman,  Petter Clemensson,  Niall Bourke,  John C. Evans,  James Gholam,  Irene Vavasour,  Shannon H. Kollind,  Samson L. Lafayette,  Carly Bennallick,  Kirsten A. Donald,  Layla E. Bradford,  Beatrice Lena,  Maclean Vokhiwa,  Talat Shama,  Jasmine Siew,  Lydia Sekoli,  Jeanne van Rensburg,  Michael S. Pepper,  Amna Khan,  Akber Madhwani,  Frank A. Banda,  Mwila L. Mwila,  Adam R. Cassidy,  Kebaiphe Moabi,  Dolly Sephi,  Richard A. Boakye,  Kenneth A. Ae‐Ngibise,  Kwaku P. Asante,  William J. Hollander,  Todor Karaulanov,  Steven C. R. Williams,  Sean Deoni","guid":381,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/7f088d70-9c55-4311-9177-e4ab5be4055c/hbm70217-toc-0001-m.png\" alt=\"Characterization of Portable Ultra-Low Field MRI Scanners for Multi-Center Structural Neuroimaging\"><p>A global study on quality control of portable, ultra-low field MRI systems within the UNITY network. Cross-sectional and longitudinal data are presented together with analysis of factors influencing image noise, contrast, and distortions.</p><p>The lower infrastructure requirements of portable ultra-low field MRI (ULF-MRI) systems have enabled their use in diverse settings such as intensive care units and remote medical facilities. The UNITY Project is an international neuroimaging network harnessing this technology, deploying portable ULF-MRI systems globally to expand access to MRI for studies into brain development. Given the wide range of environments where ULF-MRI systems may operate, there are external factors that might influence image quality. This work aims to introduce the quality control (QC) framework used by the UNITY Project to investigate how robust the systems are and how QC metrics compare between sites and over time. We present a QC framework using a commercially available phantom, scanned with 64 mT portable MRI systems at 17 sites across 12 countries on four continents. Using automated, open-source analysis tools, we quantify signal-to-noise, image contrast, and geometric distortions. Our results demonstrated that the image quality is robust to the varying operational environment, for example, electromagnetic noise interference and temperature. The Larmor frequency was significantly correlated to room temperature, as was image noise and contrast. Image distortions were less than 2.5 mm, with high robustness over time. Similar to studies at higher field, we found that changes in pulse sequence parameters from software updates had an impact on QC metrics. This study demonstrates that portable ULF-MRI systems can be deployed in a variety of environments for multi-center neuroimaging studies and produce robust results.</p>","contentLength":1861,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Structural Connectivity Differences Reflect Microstructural Heterogeneity of the Human Insular Cortex","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70231?af=R","date":1747832349,"author":"Julian Quabs,  Nora Bittner,  Svenja Caspers","guid":380,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/6c8ffe92-6fc5-4198-9aa2-a5886d5ea103/hbm70231-toc-0001-m.png\" alt=\"Structural Connectivity Differences Reflect Microstructural Heterogeneity of the Human Insular Cortex\"><p>Combining the microstructural JulichBrain Atlas with tractography, we analyzed connectivity patterns within the cytoarchitecture of the human insula. We discovered six clusters, consistent across two large cohorts, with distinct connectivity patterns for different anatomical and functional target regions, reflecting fundamental principles of microstructural organization within the human insula. Additional whole-brain connectivity analyses reveal that two distinct areas within the anterior (Id6) and posterior (Id3) human insula may serve as integrative hubs, mediating between higher-order cognitive and limbic systems, as well as across sensory modalities.</p><p>The insular cortex is renowned for its multitude of functions, intricate structural connectivity patterns, and complex cytoarchitecture, yet a unified multimodal concept remains elusive. Microstructural parcellations provide a promising mediator to integrate connectome data into a combined structural–functional framework. While in the macaque insula, a clear relationship between anatomical connections and cytoarchitecture is well established, such correlation in the human insula remains unclear. By combining diffusion data from two large cohorts, including 914 and 204 subjects, respectively, as well as probabilistic tractography and the microstructural JulichBrain Atlas, we uncover how microstructural diversity reflects structural connectivity patterns in the human insula. Analyzing the connectivity of 16 cytoarchitectonic areas, we identified six clusters, two in the posterior and four in the anterior insula. Posterior clusters exhibited strong connectivity with temporal, occipital, and parietal areas encompassing auditory, visual, and somatosensory systems. Conversely, anterior clusters were specifically linked with (orbito)frontal areas, such as Broca's area or frontal opercular areas. Together, our data demonstrate that structural connectivity differences are reflected by fundamental principles of microstructural organization in the human insula. Additional whole-brain connectivity analyses reveal that two distinct areas within the anterior (Id6) and posterior (Id3) human insula may serve as integrative hubs, mediating between higher-order cognitive and limbic systems, as well as across sensory modalities. All clusters are openly available in MNI space to support future multimodal studies addressing the relations between cytoarchitecture, structure, functions, and pathologies in this complex region of the human neocortex.</p>","contentLength":2521,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Neurophysiological Progression in Alzheimer's Disease: Insights From Dynamic Causal Modelling of Longitudinal Magnetoencephalography","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70234?af=R","date":1747830295,"author":"Amirhossein Jafarian,  Melek Karadag Assem,  Ece Kocagoncu,  Juliette H. Lanskey,  Haddy Fye,  Rebecca Williams,  Andrew J. Quinn,  Jemma Pitt,  Vanessa Raymont,  Stephen Lowe,  Krish D. Singh,  Mark Woolrich,  Anna C. Nobre,  Richard N. Henson,  Karl J. Friston,  James B. Rowe","guid":379,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/89991781-da1b-4cd9-9ced-a1aed1d0920e/hbm70234-toc-0001-m.png\" alt=\"Neurophysiological Progression in Alzheimer's Disease: Insights From Dynamic Causal Modelling of Longitudinal Magnetoencephalography\"><p>We employ dynamic causal modeling (DCM) of resting-state MEG data to model Alzheimer's disease (AD)-related changes in cortical microcircuits and connectivity within the default mode network over 1-year duration. Our DCM incorporates region-specific contributions of cortical laminar activities to accommodate variability in disease burden across brain regions. We introduce dual parameterization of neurotransmission mechanisms in DCM to distinguish between AD's effects on different receptor types. Bayesian group-level analysis reveals regional specificity of AD effects, highlighting selective NMDA neurotransmission changes and progressive connectivity alterations within and between the precuneus and medial prefrontal cortex. Changes in effective connectivity correlate with individual differences in cognitive decline during follow-up, suggesting potential as a biomarker for AD progression.</p><p>Neurodegenerative diseases, including Alzheimer's disease, are characterised by selective neuronal vulnerability with regional, laminar, cellular and neurotransmitter specificity. The regional losses of neurons and their synapses are associated with neurophysiological changes and cognitive decline. Hypotheses related to these mechanisms can be tested and compared by dynamic causal modelling (DCM) of human neuroimaging data, including magnetoencephalography (MEG). In this paper, we use DCM of cross-spectral densities to model changes between baseline and follow-up data in cortical regions of the default mode network, to characterise longitudinal changes in cortical microcircuits and their connectivity underlying resting-state MEG. Twenty-nine people with amyloid-positive mild cognitive impairment and Alzheimer's disease early dementia were studied at baseline and after an average interval of 16 months. To study longitudinal changes induced by Alzheimer's disease, we evaluate three complementary sets of DCM: (i) with regional specificity, of the contributions of neurons to measurements to accommodate regional variability in disease burden; (ii) with dual parameterisation of excitatory neurotransmission, motivated by preclinical and clinical evidence of distinct effects of disease on AMPA versus NMDA type glutamate receptors; and (iii) with constraints to test specific clinical hypothesis about the effects of disease-progression. Bayesian model selection at the group level confirmed evidence for regional specificity of the effects of Alzheimer's disease, with evidence for selective changes in NMDA neurotransmission, and progressive changes in connectivity within and between Precuneus and medial prefrontal cortex. Moreover, alterations in effective connectivity vary in accordance with individual differences in cognitive decline during follow-up. These applications of DCM enrich the mechanistic understanding of the pathophysiology of human Alzheimer's disease and inform experimental medicine studies of novel therapies. More generally, longitudinal DCM provides a potential platform for natural history and interventional studies of neurodegenerative and neuropsychiatric diseases, with selective neuronal vulnerability.</p>","contentLength":3151,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Empirically Integrating the Evidence for Different Predictive Coding Components Using Auditory False Perception","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70211?af=R","date":1747745927,"author":"Feifan Chen,  Anusha Yasoda‐Mohan,  Colum Ó Sé,  Sven Vanneste","guid":378,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/3df43702-085d-4070-b7db-40d36031e42b/hbm70211-toc-0001-m.png\" alt=\"Empirically Integrating the Evidence for Different Predictive Coding Components Using Auditory False Perception\"><p>This study integratively measured the independent components of the predictive coding system including priors, confidence, prediction errors (PEs) and perceptual inference. The results showed that subjects with higher confidence in priors are more likely to shape perception towards prior belief and are more sensitive to context-driven PEs.</p><p>Perception is a probabilistic estimation of the sensory information we receive at any given time and is shaped by an internal model generated by the brain by assimilating information over the life course. This predictive system in the brain has several components–(i) the internal model, (ii) the model-based prediction called priors, (iii) the weighted difference between the prior and sensory input called prediction error (PE) and (iv) the weighted sum of the prior and input called perceptual inference. Until now, different studies have explored the independent components of this predictive coding system, and we, for the first time to our knowledge, integrate them. To do this, we induce a conditioned hallucination (CH) illusion by means of a multisensory integration paradigm and use this as a model to study the behavioral and electrophysiological responses to this experience. Additionally, we also probe their predictive coding system using a well-established local–global auditory oddball paradigm. By comparing the behavioral and electrophysiological components of people more and less likely to perceive an illusion in the two paradigms, we observed that high perceivers place more confidence in their internal model and low perceivers in the sensory information. Furthermore, high perceivers were more sensitive than low perceivers to PEs that were generated by a change in the context of the sensory information, which served as a measure of a change in the internal model itself. As an exploratory analysis, we also observed that the objective likelihood of perceiving an illusion was corrected to the self-reported likelihood of perceiving an illusion in a day-to-day setting, which disappears when controlled for the perceptual threshold. These results taken together start to give us an idea as to how a person's innate bias—either towards a learned model or external information may—affect their perception in a sensory context.</p>","contentLength":2299,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Three Latent Factors in Major Depressive Disorder Base on Functional Connectivity Show Different Treatment Preferences","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70215?af=R","date":1747658506,"author":"Xinyi Wang,  Xinruo Wei,  Junneng Shao,  Li Xue,  Zhilu Chen,  Zhijian Yao,  Qing Lu","guid":377,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/62199caa-d5e5-4410-b2bd-6713d8e3974f/hbm70215-toc-0001-m.png\" alt=\"Three Latent Factors in Major Depressive Disorder Base on Functional Connectivity Show Different Treatment Preferences\"><p>The heterogeneity of major depressive disorder (MDD) complicates the selection of effective treatments. While more studies have identified cluster-based MDD subtypes, they often overlook individual variability within subtypes. To address this, we applied latent dirichlet allocation to decompose resting-state functional connectivity (FC) into latent factors. It allows patients to express varying degrees of FC across multiple factors, retaining inter-individual variability. We enrolled 226 patients and 100 healthy controls to identify latent factors and examine their distinct patterns of hyper- and hypo-connectivity. We investigated the association between these connectivity patterns and treatment preferences. Additionally, we compared demographic characteristics, clinical symptoms, and longitudinal symptom improvements across the identified factors. We identified three factors. Factor 1, characterized by inter-network hyperconnectivity of the default mode network (DMN), was associated with treatment response to antidepressant monotherapy. Additionally, factor 1 was more frequently expressed by younger and highly educated patients, with significant improvements in cognitive symptoms. Conversely, factor 3, characterized by inter-networks and intra-networks hypoconnectivity of DMN, was associated with treatment response when combining antidepressants with stimulation therapy. Factor 2, characterized by global hypoconnectivity without DMN, was associated with higher baseline depression severity and anxiety symptoms. These three factors showed distinct treatment preferences and clinical characteristics. Importantly, our results suggested that patients with DMN hyperconnectivity benefited from monotherapy, while those with DMN hypoconnectivity benefited from combined treatments. Our approach allows for a unique composition of factors in each individual, potentially facilitating the development of more personalized treatment-related biomarkers.</p>","contentLength":1970,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Pattern of Deep Grey Matter Undersizing Boosts MRI‐Based Diagnostic Classifiers in Fetal Alcohol Spectrum Disorders","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70233?af=R","date":1747658111,"author":"Eliot Kerdreux,  Justine Fraize,  Alexandra Ntorkou,  Pauline Garzón,  Richard Delorme,  Monique Elmaleh‐Berges,  Edouard Duchesnay,  Lucie Hertz‐Pannier,  Yann Leprince,  Jean‐François Mangin,  David Germanaud","guid":376,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/f3f866d9-217f-483f-9525-4498195ae435/hbm70233-toc-0001-m.png\" alt=\"Pattern of Deep Grey Matter Undersizing Boosts MRI-Based Diagnostic Classifiers in Fetal Alcohol Spectrum Disorders\"><p>Using MRI-based normative scaling analysis, we identified a robust pattern of deep grey matter undersizing in fetal alcohol syndrome (FAS). This novel neuroanatomical marker boosted the performances of brain size-based classifiers and their generalizability to fetal alcohol spectrum disorders lacking FAS-specific clinical features, supporting its use to improve diagnostic reliability.</p><p>In fetal alcohol spectrum disorders (FASD), brain growth deficiency is a hallmark of subjects with both fetal alcohol syndrome (FAS) and nonsyndromic FASD (NS-FASD, that is, those without specific diagnostic features). Although previous studies have suggested that the deep grey matter is heterogeneously affected at the group level, it has not yet been established within proper scaling modeling, nor has it been given a place in the FASD diagnostic criteria where neuroanatomical features still contribute almost nothing to diagnostic specificity. We segmented a 1.5T T1-weighted brain MRI dataset of 90 monocentric FASD patients (53 FAS, 37 NS-FASD) and 95 typically developing controls (ages 6–20), using volBrain-vol2Brain as reference, and both Freesurfer-SAMSEG and FSL-FIRST to estimate result robustness. The segmentation resulted in seven anatomical volumes: total brain (TBV), total deep grey matter, caudate, putamen, globus pallidus, thalamus, and accumbens. After adjusting for confounds, we fitted the scaling relationship between deep grey matter nuclei volumes (V) and TBV (V =  × TBV) and evaluated the effect of FAS on scaling. We then estimated the volumetric deviation from typical scaling (DTS) for each deep grey nucleus volume in the FAS sample. Finally, we tested the improvement of FAS versus control classifiers based on total deep grey matter DTS or total brain deviation from typical volume, by adding the five nuclear DTS, both in terms of performance and generalizability to NS-FASD. Scaling was significantly different between the FAS and control groups for all deep grey matter nuclei ( &lt; 0.05). We confirmed the undersizing of total deep grey matter in FAS (DTS = −6%) and identified a pattern of volumetric undersizing, most pronounced in the caudate (−13%) and globus pallidus (−11%), less so in the thalamus (−4%) and putamen (−2%) and sparing the accumbens (0%). These findings were consistent across segmentation tools, despite variations in magnitude. The pattern-based classifier was more efficient than the one based on total deep grey matter alone ( &lt; 0.001) and identified 32.4% of the NS-FASD as having a FAS-like deep grey matter phenotype, compared to 18.9% with the classifier based on total deep grey matter alone ( = 0.113). Added to a classifier based on TBV only, the pattern improved the performance ( = 0.033) of the model and increased identification of NS-FASD with a FAS-like neuroanatomical phenotype from 37.8% to 62.2% ( = 0.002). This study details the volumetric undersizing of deep grey matter in a large series of FASD patients. It reveals a differential pattern of vulnerability to prenatal alcohol exposure partially convergent across automatic segmentation tools. It also strongly suggests that this pattern of volumetric undersizing in the deep grey matter may contribute to a neuroanatomical signature of FAS that is usable to improve the probabilistic diagnosis of NS-FASD by means of MRI-based diagnostic classifiers.</p>","contentLength":3420,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Deep‐Diffeomorphic Networks for Conditional Brain Templates","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70229?af=R","date":1747314648,"author":"Luke Whitbread,  Stephan Laurenz,  Lyle J. Palmer,  Mark Jenkinson,  The Alzheimer's Disease Neuroimaging Initiative","guid":375,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/d06a1601-9f6b-4d09-8710-6f6c039cd172/hbm70229-toc-0001-m.png\" alt=\"Deep-Diffeomorphic Networks for Conditional Brain Templates\"><p>We have built on recent deep-learning template generation approaches using a diffeomorphic framework to create a purely geometric conditional brain template construction method. We assessed the effectiveness of our method and recent approaches at capturing age-dependent anatomical differences, demonstrating that further refinement is required to accurately capture conditional morphological variability.</p><p>Deformable brain templates are an important tool in many neuroimaging analyses. Conditional templates (e.g., age-specific templates) have advantages over single population templates by enabling improved registration accuracy and capturing common processes in brain development and degeneration. Conventional methods require large, evenly spread cohorts to develop conditional templates, limiting their ability to create templates that could reflect richer combinations of clinical and demographic variables. More recent deep-learning methods, which can infer relationships in very high-dimensional spaces, open up the possibility of producing conditional templates that are jointly optimised for these richer sets of conditioning parameters. We have built on recent deep-learning template generation approaches using a diffeomorphic (topology-preserving) framework to create a purely geometric method of conditional template construction that learns diffeomorphisms between: (i) a global or group template and conditional templates, and (ii) conditional templates and individual brain scans. We evaluated our method, as well as other recent deep-learning approaches, on a data set of cognitively normal (CN) participants from the Alzheimer's Disease Neuroimaging Initiative (ADNI), using age as the conditioning parameter of interest. We assessed the effectiveness of these networks at capturing age-dependent anatomical differences. Our results demonstrate that while the assessed deep-learning methods have a number of strengths, they require further refinement to capture morphological changes in ageing brains with an acceptable degree of accuracy. The volumetric output of our method, and other recent deep-learning approaches, across four brain structures (grey matter, white matter, the lateral ventricles and the hippocampus), was measured and showed that although each of the methods captured some changes well, each method was unable to accurately track changes in all of the volumes. However, as our method is purely geometric, it was able to produce T1-weighted conditional templates with high spatial fidelity and with consistent topology as age varies, making these conditional templates advantageous for spatial registrations. The use of diffeomorphisms in these deep-learning methods represents an important strength of these approaches, as they can produce conditional templates that can be explicitly linked, geometrically, across age as well as to fixed, unconditional templates or brain atlases. The use of deep learning in conditional template generation provides a framework for creating templates for more complex sets of conditioning parameters, such as pathologies and demographic variables, in order to facilitate a broader application of conditional brain templates in neuroimaging studies. This can aid researchers and clinicians in their understanding of how brain structure changes over time and under various interventions, with the ultimate goal of improving the calibration of treatments and interventions in personalised medicine. The code to implement our conditional brain template network is available at: <a target=\"_blank\" title=\"Link to external resource\" href=\"http://github.com/lwhitbread/deep-diff\">github.com/lwhitbread/deep-diff</a>.</p>","contentLength":3580,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Human Cortico‐Cerebellar Dynamics During Motor Error Processing After Stroke","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.70227?af=R","date":1747313633,"author":"Nitesh Singh Malan,  Raghavan Gopalakrishnan,  David Cunningham,  Olivia Hogue,  Kenneth B. Baker,  Andre G. Machado","guid":374,"unread":true,"content":"<img src=\"https://onlinelibrary.wiley.com/cms/asset/f0949ca6-b03c-4a5a-b490-d9a9a19ae074/hbm70227-toc-0001-m.png\" alt=\"Human Cortico-Cerebellar Dynamics During Motor Error Processing After Stroke\"><p>Human cortico-cerebellar interactions during motor error correction were explored using synchronized cerebellar and EEG recordings. Results highlight centro-parietal error positivity, fronto-centro-parietal desynchronization, and alpha/low-beta cortico-cerebellar coherence, underscoring bidirectional neural interactions in motor error processing.</p><p>The cerebellum acts as a forward internal model to predict motor outcomes, compare them with sensory feedback, and generate prediction errors that refine prediction accuracy. Our physiological understanding of cerebellar function during motor control derives predominantly from animal experiments and clinical observations in patients with disorders of the cerebellum or its connections with the cerebrum and spinal cord. Here, we report a human electrophysiology-based investigation of cerebello-thalamo-cortical pathway activity during motor error detection and correction. Participants performed a computerized motor oddball task while synchronized electrophysiological recordings were collected from cerebellar dentate (DN) using depth electrodes and scalp electroencephalography (EEG). The task involved moving a 2-D ball on a screen toward a predetermined target at 40% (standard trials) or 20% (oddball trials) of their maximum voluntary contraction. Six participants completed an average of 239 trials, with oddball trials randomly occurring with a 30% frequency. At the cortex, oddball trials exhibited significantly greater centro-parietal error positivity and fronto-centro-parietal desynchronization during error correction, predominantly in the alpha and low beta frequency bands. DN examination also revealed greater alpha and low beta desynchronization during error correction. Lastly, oddball trials showed significantly greater cortico-cerebellar coherence during error correction in the same frequency bands with bidirectional interaction between the cortex and DN. These findings expand on the cortico-cerebello-cortical physiology of human motor control and provide cues for designing interventions aimed at alleviating the functional burdens of acquired injuries of the central nervous system.</p>","contentLength":2162,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Issue Information","url":"https://onlinelibrary.wiley.com/doi/10.1002/hbm.26735?af=R","date":1747302075,"author":"wileyonlinelibrary@wiley.com (Wiley Online Library)","guid":373,"unread":true,"content":"<article>Human Brain Mapping, Volume 46, Issue 8, June 1, 2025. </article>","contentLength":55,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["journal","cognitive-neuroscience"]}