{"id":"GTCx6Xsvc3waRj6PF8KejuVpYR38QF84LkHu7bXmMffVRRnF9LCA","title":"Nature Human Behaviour","displayTitle":"Nature Human Behaviour","url":"https://www.nature.com/nathumbehav.rss","feedLink":"http://feeds.nature.com/nathumbehav/rss/current","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":8,"items":[{"title":"An ancient mass grave reveals targeted killing of women and children in the Early Iron Age","url":"https://www.nature.com/articles/s41562-025-02400-5","date":1772064000,"author":"","guid":607,"unread":true,"content":"On discovering that one of the largest prehistoric mass graves of Europe predominantly held violently killed women and children, we used a battery of methods to investigate how this gender-selective and age-selective pattern reflected the strategic disruption of power networks and lineages in the Early Iron Age.","contentLength":313,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Digital mental health needs a purpose-driven approach","url":"https://www.nature.com/articles/s41562-025-02380-6","date":1771977600,"author":"Saleem Khaldoon Al-Nuaimi","guid":603,"unread":true,"content":"In this Perspective, Househ et al. examine how digital solutions can address pressing needs in mental healthcare, arguing that a patient-centred approach is crucial.","contentLength":165,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How to research ethically with online data","url":"https://www.nature.com/articles/s41562-026-02408-5","date":1771977600,"author":"Nicolas Gold","guid":604,"unread":true,"content":"Online data offer substantial opportunities for researchers but, despite much discussion in the literature, continue to be accompanied by complex ethical issues. This Comment proposes some pragmatic steps for developing an ethical defence in research that involves this type of data, particularly for researchers new to its use.","contentLength":328,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How to foster a supportive research group culture","url":"https://www.nature.com/articles/s41562-026-02407-6","date":1771977600,"author":"Paul Sauseng","guid":605,"unread":true,"content":"A supportive research group culture can help to retain talent, promote well-being and improve academic performance. Here we provide practical guidance for cultivating kindness and constructive communication within academic teams.","contentLength":229,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Voices of experience","url":"https://www.nature.com/articles/s41562-026-02425-4","date":1771977600,"author":"","guid":606,"unread":true,"content":"Collective knowledge is a human strength. To benefit from the wisdom of experience, we launch a Series of Comments in a dedicated ‘How to’ style. These ‘How to’ Comments provide brief advice and practical recommendations to researchers across the wide spectrum of disciplines covered by the journal.","contentLength":307,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A large mass grave from the Early Iron Age indicates selective violence towards women and children in the Carpathian Basin","url":"https://www.nature.com/articles/s41562-025-02399-9","date":1771804800,"author":"Barry Molloy","guid":602,"unread":true,"content":"In this analysis of biomolecular and archaeological data from a ninth-century BCE mass grave in the Carpathian Basin, Fibiger et al. find evidence for the targeted killing of mostly unrelated women and children, challenging views of prehistoric violence.","contentLength":254,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The adoption and efficacy of large language models in US consumer financial complaints","url":"https://www.nature.com/articles/s41562-026-02409-4","date":1771372800,"author":"Jiwoong Shin","guid":600,"unread":true,"content":"Using a large-scale dataset of US consumer finance complaints, this study shows that LLM-era AI writing assistance surged and causally increased consumers’ chances of relief, improving textual quality such as clarity and benefiting those least likely to succeed.","contentLength":264,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A systematic review and meta-analysis of the proficiency and variability of mathematical ability in populations with autism spectrum disorder","url":"https://www.nature.com/articles/s41562-025-02384-2","date":1771372800,"author":"Yi Mou","guid":601,"unread":true,"content":"This systematic review and meta-analysis synthesizes evidence on math ability in autistic individuals relative to the non-autistic population. The findings suggest that individuals with autism spectrum disorder exhibit significantly lower math scores and greater variability compared with non-autistic individuals.","contentLength":314,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["psychology","cognitive-neuroscience"]}