{"id":"LcTxR7u1XKaf9jt6cSi6bV9hN3vScZ9TF9VYRKg29HAstLHjaWaxVvsgEACfjrRmZCQRBvhBNaG9CeEtmMzxGZtmPdQ3PnR3SGpZaQaYdQw5Lf6LGPRwguiDDNoLTTXrhawYxJ9cxU95Wjo7NYzz7ZMuQ","title":"Proceedings of the National Academy of Sciences: Psychological and Cognitive Sciences, Psychological and Cognitive Sciences","displayTitle":"PNAS","url":"https://www.pnas.org/action/showFeed?type=searchTopic&taxonomyCode=topic&tagCodeOr=psych-soc&tagCodeOr=psych-bio","feedLink":"https://www.pnas.org/action/doSearch?af=R","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":19,"items":[{"title":"Route of fire: Pregame rituals and emotional synchrony among Brazilian football fans","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2422779122?af=R","date":1749452400,"author":"Dimitris XygalatasVitor Leandro da Silva ProfetaMohammadamin SaraeiGabriela Baranowski-PintoaDepartment of Anthropology, University of Connecticut, Storrs, CT 06111bDepartment of Psychological Sciences, University of Connecticut, Storrs, CT 06111cDepartamento de Educação Física, Universidade Federal de Minas Gerais, Belo Horizonte, MG 31270-901, BrazildDepartment of Human Movement Sciences, Universidade do Estado de Minas Gerais, Belo Horizonte, MG 31270-901, Brazil","guid":525,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 24, June 2025. SignificanceSporting events can bring people together and forge strong loyalties, but the mechanisms behind their social impact remain unclear. Our study reveals that events peripheral to the game, such as the pregame ritual of Rua de Fogo performed by ...</article>","contentLength":338,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Reply to Musculus et al.: A case of offside in scientific discourse?","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2507207122?af=R","date":1749193200,"author":"Leonardo BonettiTorbjörn VestbergReza JafariDebora SeghezziMartin IngvarMorten L. KringelbachAlberto FilgueirasPredrag PetrovicaCenter for Music in the Brain, Department of Clinical Medicine, Aarhus University and The Royal Academy of Music, Aarhus, Aalborg 8000, DenmarkbCentre for Eudaimonia and Human Flourishing, Linacre College, University of Oxford, Oxford OX39BX, United KingdomcDepartment of Psychiatry, University of Oxford, Oxford OX37JX, United KingdomdDepartment of Psychology, University of Bologna, Bologna 40127, ItalyeCenter for Psychiatry Research and Center for Cognitiveand Computational Neuropsychiatry, Department of Clinical Neuroscience, Karolinska Institutet, Stockholm 17177, SwedenfCollege of Psychology, School of Health and Applied Sciences, Central Queensland University, Cairns 40939, AustraliagDepartment of Psychology, School of Education and Social Sciences, Rio de Janeiro State University, Riode, Janeiro 24435-000, Brazil","guid":526,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 25, June 2025. </article>","contentLength":82,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Why “decoding the elite soccer player’s psychological profile” fails to score","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2502322122?af=R","date":1749193200,"author":"Lisa MusculusDuarte AraújoElisa BisagnoHenrik GustafssonAnton KalénMagnus LindwallAlexandra Pérez-FerreirósMarkus RaabA. Mark WilliamsAndreas StenlingaDepartment of Performance Psychology, Institute of Psychology, German Sport University Cologne, Cologne 50933, GermanybInterdisciplinary Centre for the Study of Human Performance (CIPER), Faculty of Human Kinetics, University of Lisbon, Lisbon 1499-002, PortugalcSurgical, Medical and Dental Department of Morphological Sciences related to Transplant, Oncology and Regenerative Medicine, University of Modena and Reggio Emilia, Reggio Emilia 421 21, ItalydThe Department of Sport and Social Sciences, Norwegian School of Sport Sciences, Oslo 0863, NorwayeDepartment of Educational Studies, Faculty of Arts and Social Sciences, Karlstad University, Karlstad SE-651 88, SwedenfDigital Services and Systems, Department of Computer Science, Electrical and Space Engineering, Lulea University, Luleå SE-971 87, SwedengDepartment of Psychology, University of Gothenburg, Gothenburg SE-405 30, SwedenhIndependent ResearcheriDepartment of Health and Kinesiology, College of Health, The University of Utah, Salt Lake City, UT 84112jDepartment of Psychology, Umeå University, Umeå SE-901 87, SwedenkDepartment of Sport Science and Physical Education, University of Agder, Kristiansand 4630, Norway","guid":527,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 25, June 2025. </article>","contentLength":82,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Shared disbelief and shared belief: Belief and disbelief as drivers of interpersonal neural synchronization during narrative processing","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2422396122?af=R","date":1749106800,"author":"Gabriel BraunYaara YeshurunEinat ShetreetaSagol School of Neuroscience, Tel Aviv University, Tel Aviv 6139001, IsraelbSchool of Psychological Sciences, Tel Aviv University, Tel Aviv 6139001, IsraelcDepartment of Linguistics, Tel Aviv University, Tel Aviv 6139001, Israel","guid":522,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 23, June 2025. SignificanceWe live in what many describe as a post-truth era, where truth is increasingly contested. Despite efforts to mitigate this issue, little is known about the cognitive processes underlying believed/disbelieved information. This fMRI study ...</article>","contentLength":334,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Simpson’s gender-equality paradox","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2422247122?af=R","date":1749106800,"author":"Mathias BerggrenRobin BerghaDepartment of Psychology, Uppsala University, Uppsala SE-751 42, Sweden","guid":523,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 23, June 2025. SignificanceThe gender-equality paradox entails that countries with more equality have larger gender differences in personality and behaviors. A prominent evolutionary explanation is that equality provides more freedom for men and women to pursue innate ...</article>","contentLength":339,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Structure–function coupling in the first month of life: Associations with age and attention","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2412729122?af=R","date":1748847600,"author":"Ursula A. TooleyJeanette K. KenleyM. Catalina CamachoAidan LathamDimitrios AlexopoulosAshley N. NielsenTara A. SmyserBarbara B. WarnerJoshua S. ShimonyJeffrey J. NeilJoan L. LubyDeanna M. BarchCynthia E. RogersChristopher D. SmyseraDepartment of Psychiatry, Washington University in St. Louis, St. Louis, MO 63110bDepartment of Neurology, Washington University in St. Louis, St. Louis, MO 63110cDepartment of Pediatrics, Washington University in St. Louis, St. Louis, MO 63110dDepartment of Radiology, Washington University in St. Louis, St. Louis, MO 63110eDepartment of Psychological and Brain Sciences, Washington University in St. Louis, St. Louis, MO 63110","guid":524,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 23, June 2025. SignificanceThe first month of life is a critical period for brain development, with rapid reconfiguration of brain structure and function. Yet, how structural and functional connections reorganize to support attention and behavior during this time ...</article>","contentLength":334,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Task difficulty modulates the effect of mind wandering on phase dynamics","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2416387122?af=R","date":1748588400,"author":"Zhengkun LongGeorg NorthoffXiaolan FuaState Key Laboratory of Cognitive Science and Mental Health, Institute of Psychology, Chinese Academy of Sciences, Beijing 100101, ChinabDepartment of Psychology, University of Chinese Academy of Sciences, Beijing 100049, ChinacSchool of Psychology, Shenzhen University, Shenzhen, Guangdong 518060, ChinadMind, Brain Imaging and Neuroethics Research Unit, The Royal’s Institute of Mental Health Research, University of Ottawa, Ottawa, ON K1Z 7K4, CanadaeSchool of Psychology, Shanghai Jiao Tong University, Shanghai 200030, China","guid":521,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 22, June 2025. SignificanceWe demonstrate that external (sensory and motor processing) and internal cognition (mind wandering) are dynamically interdependent. Easier external tasks require fewer executive resources, leaving more cognitive resources for internal mind ...</article>","contentLength":337,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Correction for Fernandez Velasco et al., Expert navigators deploy rational complexity–based decision precaching for large-scale real-world planning","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2509414122?af=R","date":1747983600,"author":"","guid":513,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 21, May 2025. </article>","contentLength":81,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Correction for Clark et al., Prosocial motives underlie scientific censorship by scientists: A perspective and research agenda","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2510676122?af=R","date":1747983600,"author":"","guid":520,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 22, June 2025. </article>","contentLength":82,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Knowledge of politician stock trading reduces congressional legitimacy and compliance with the law","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2501822122?af=R","date":1747724400,"author":"Raihan AlamTage S. RaiaRady School of Management, University of California, San Diego, CA 92093","guid":517,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 21, May 2025. Institutional legitimacy is essential for democracies, yet public trust and confidence in the United States Congress are at an all-time low. A significant predictor of attitudes toward Congress is perceptions of corruption, with perceptions of corruption ...</article>","contentLength":339,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"AI assistance improves people’s ability to distinguish correct from incorrect eyewitness lineup identifications","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2503971122?af=R","date":1747638000,"author":"Lauren E. KelsoDavid G. DobolyiJesse H. GrabmanChad S. DodsonaDepartment of Psychology, University of Virginia, Charlottesville, VA 22904bLeeds School of Business, University of Colorado Boulder, Boulder, CO 80309cDepartment of Psychology, New Mexico State University, Las Cruces, NM 88003","guid":515,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 21, May 2025. SignificanceMistaken eyewitness identification is one of the leading causes of false convictions. Yet, no tool exists that assists law enforcement with distinguishing between reliable and unreliable eyewitness identifications. We show that the assistance ...</article>","contentLength":339,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Stability of general cognitive ability from infancy to adulthood: A combined twin and genomic investigation","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2426531122?af=R","date":1747638000,"author":"Daniel E. GustavsonGiulia A. BorrielloMohini A. KarhadkarSoo Hyun RheeRobin P. CorleySally-Ann RheaLisabeth F. DiLallaSally J. WadsworthNaomi P. FriedmanChandra A. ReynoldsaInstitute for Behavioral Genetics, University of Colorado Boulder, CO 80309bDepartment of Psychology and Neuroscience, University of Colorado Boulder, CO 80309cDepartment of Learning Sciences, Kent State University, Kent, OH 44242dDepartment of Family and Community Medicine, Southern Illinois University School of Medicine, Carbondale, IL 62901","guid":518,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 21, May 2025. SignificanceA goal of psychological science is to identify early life factors that influence lifelong outcomes and the stability of those outcomes over time. Studies have examined the continuity of cognition across development, but little work has ...</article>","contentLength":332,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Empowering safer socially sensitive autonomous vehicles using human-plausible cognitive encoding","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2401626122?af=R","date":1747638000,"author":"Hongliang LuMeixin ZhuChao LuShuo FengXuesong WangYinhai WangHai YangaIntelligent Transportation Thrust, Systems Hub, The Hong Kong University of Science and Technology (Guangzhou), Guangzhou 511453, Guangdong, ChinabDepartment of Civil and Environmental Engineering, The Hong Kong University of Science and Technology, Kowloon 999077, Hong Kong, ChinacSchool of Transportation, Southeast University, Nanjing 211189, ChinadMechanical Engineering, School of Mechanical Engineering, Beijing Institute of Technology, Beijing 100081, ChinaeDepartment of Automation, Tsinghua University, Beijing 100084, ChinafCollege of Transportation, Tongji University, Shanghai 201804, ChinagDepartment of Civil and Environmental Engineering, University of Washington, Seattle, WA 98195","guid":519,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 21, May 2025. SignificanceDrawing on research in autonomous vehicles (AVs) ethics and neuroscience, this study proposes a human-inspired scheme for AVs to navigate ethical challenges in everyday driving. Our scheme, based on social concern and human-plausible cognitive ...</article>","contentLength":340,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Aversive societal conditions explain differences in “dark” personality across countries and US states","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2500830122?af=R","date":1747378800,"author":"Ingo ZettlerLau LilleholtMartina BaderBenjamin E. HilbigMorten MoshagenaCopenhagen Center for Social Data Science (SODAS), University of Copenhagen, Copenhagen 1353, DenmarkbDepartment of Psychology, University of Copenhagen, Copenhagen 1353, DenmarkcDepartment of Psychology, University of Kaiserslautern-Landau, Landau 76829, GermanydDepartment of Psychology and Education, Ulm University, Ulm 89069, Germany","guid":510,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 20, May 2025. Humans differ in their levels of aversive (“dark”) personality traits such as egoism or psychopathy. Building upon theories suggesting that socioecological factors coshape the development of personality traits, it can be predicted that prior aversive ...</article>","contentLength":339,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Reply to Tauzin: How to implement novelty in theory of mind tasks","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2503973122?af=R","date":1747378800,"author":"Luke A. TownrowChristopher KrupenyeaDepartment of Psychological and Brain Sciences, Johns Hopkins University, Baltimore, MD 21218","guid":514,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 21, May 2025. </article>","contentLength":81,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Communicative mentalization is limited in nonhuman great apes","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2503448122?af=R","date":1747378800,"author":"Tibor TauzinaDepartment of Linguistics, University of Vienna, Vienna 1090, AustriabVienna Cognitive Science Hub, University of Vienna, Vienna 1090, Austria","guid":516,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 21, May 2025. </article>","contentLength":81,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Kernels of selfhood: GPT-4o shows humanlike patterns of cognitive dissonance moderated by free choice","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2501823122?af=R","date":1747206000,"author":"Steven A. LehrKetan S. SaichandranEddie Harmon-JonesNykko VitaliMahzarin R. BanajiaCangrade, Inc., Watertown, MA 02472bDepartment of Computer Science, Boston University, Boston, MA 02215cSchool of Psychology, The University of New South Wales, Sydney, NSW 2052, AustraliadDepartment of Psychology, Harvard University, Cambridge, MA 02138","guid":509,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 20, May 2025. SignificanceScientists have long promised that AI will make more rational decisions than even expert humans. These studies show that this is not a foregone conclusion because large language models (LLMs) already appear to have acquired humanlike ...</article>","contentLength":330,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Behavioral interventions motivate action to address climate change","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2426768122?af=R","date":1747119600,"author":"Alyssa H. SinclairDanielle CosmeKirsten LydicDiego A. ReineroJosé Carreras-TartakMichael E. MannEmily B. FalkaPenn Center for Science, Sustainability, and the Media, University of Pennsylvania, Philadelphia, PA 19104bAnnenberg Public Policy Center, University of Pennsylvania, Philadelphia, PA 19104cAnnenberg School for Communication, University of Pennsylvania, Philadelphia, PA 19104dDepartment of Psychology, University of Pennsylvania, Philadelphia, PA 19104eDepartment of Earth and Environmental Sciences, University of Pennsylvania, Philadelphia, PA 19104fWharton Marketing Department, University of Pennsylvania, Philadelphia, PA 19104gWharton Operations, Information and Decisions Department, University of Pennsylvania, Philadelphia, PA 19104","guid":511,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 20, May 2025. SignificanceClimate change poses an urgent threat to humans and ecosystems globally; human behavior is both cause and solution. Although a majority of people believe that climate change is occurring, many fail to take action. We conducted an intervention ...</article>","contentLength":339,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Transition ability to safe states reduces fear responses to height","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2416920122?af=R","date":1747119600,"author":"Misako FujinoMasahiko HarunoaNeural Information Engineering Laboratory, Center for Information and Neural Networks, National Institute of Information and Communications Technology, Suita 565-0871, Osaka, JapanbGraduate School of Frontier Biosciences, Osaka University, Suita 565-0871, Osaka, Japan","guid":512,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 122, Issue 20, May 2025. SignificancePrevious studies on fear extinction have relied on repeated exposure to fear-inducing contexts without negative consequences, which gradually constructs a new association between the contexts and nonaversive outcomes. However, fear extinction ...</article>","contentLength":339,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["journal","psychology","cognitive-neuroscience"]}