{"id":"LcTxR7u1XKaf9jt6cSi6bV9hN3vScZ9TF9VYRKg29HAstLHjaWaxVvsgEACfjrRmZCQRBvhBNaG9CeEtmMzxGZtmPdQ3PnR3SGpZaQaYdQw5Lf6LGPRwguiDDNoLTTXrhawYxJ9cxU95Wjo7NYzz7ZMuQ","title":"Proceedings of the National Academy of Sciences: Psychological and Cognitive Sciences, Psychological and Cognitive Sciences","displayTitle":"PNAS","url":"https://www.pnas.org/action/showFeed?type=searchTopic&taxonomyCode=topic&tagCodeOr=psych-soc&tagCodeOr=psych-bio","feedLink":"https://www.pnas.org/action/doSearch?af=R","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":18,"items":[{"title":"Human hippocampal theta–gamma coupling coordinates sequential planning during navigation","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2513547123?af=R","date":1772179200,"author":"Zimo HuangJames A. BisbyNeil BurgessDaniel BushaDepartment of Neuroscience, Physiology and Pharmacology, University College London, London WC1E 6BT, United KingdombDivision of Psychiatry, University College London, London W1T 7BN, United KingdomcUCL Queen Square Institute of Neurology, University College London, London WC1N 3BG, United KingdomdUCL Institute of Cognitive Neuroscience, University College London, London WC1N 3AZ, United KingdomeWellcome Centre for Human Neuroimaging, University College London, London WC1N 3AR, United Kingdom","guid":110,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 123, Issue 9, March 2026. SignificanceHuman behavior often relies on executing specific sequences of actions to achieve desired outcomes—like planning the series of locations one needs to pass through to reach a given destination. However, the neural mechanisms underlying ...</article>","contentLength":334,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Understanding human metacontrol and its pathologies using deep neural networks","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2510334123?af=R","date":1771920000,"author":"Kai J. SandbrinkLaurence T. HuntChristopher SummerfieldaDepartment of Experimental Psychology, University of Oxford, Oxford OX1 3EL, United Kingdom","guid":111,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 123, Issue 9, March 2026. SignificanceComputational systems have to learn when and how they should exert control over their actions. How do agents learn to solve this “metacontrol” problem? Here, we created a task that externalizes this control (through special actions that sample ...</article>","contentLength":345,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Reply to Kardosh and Sklar: Prioritizing domain-general explanations of misperception","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2531604123?af=R","date":1771833600,"author":"Brian GuayTyler MarghetisCara WongDavid LandyaDepartment of Political Science, University of North Carolina at Chapel Hill, Chapel Hill, NC 27599bDepartment of Cognitive and Information Sciences, University of California, Merced, CA 95343cDepartment of Political Science, University of Illinois, Urbana-Champaign, Urbana, IL 61801dNetflix, Los Gatos, CA 95032eDepartment of Psychological and Brain Studies, Indiana University, Bloomington, IN 47405","guid":108,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 123, Issue 9, March 2026. </article>","contentLength":82,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The cognitive underpinnings of minority overestimation","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2527709123?af=R","date":1771833600,"author":"Rasha KardoshAsael Y. SklaraDepartment of Psychology, New York University, New York, NY 10003bArison School of Business, Reichman University, Herzliya 4634865, Israel","guid":109,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 123, Issue 9, March 2026. </article>","contentLength":82,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Cooperative environments bolster feelings of autonomy in dyads, teams, and organizations","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2524773123?af=R","date":1771401600,"author":"Valentino E. ChaiNir HalevyaGraduate School of Business, Stanford University, Stanford, CA 94305","guid":105,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 123, Issue 8, February 2026. SignificanceAutonomy, the freedom to willingly choose one’s behavior, is linked with manifold benefits. Nine studies show that people experience greater autonomy in environments where their interests are aligned with others’ (i.e., everyone can achieve ...</article>","contentLength":345,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Reply to Fitzgerald et al.: Mischaracterizing our findings; the cognitive profile of elite footballers remains robust","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2521662123?af=R","date":1771401600,"author":"Leonardo BonettiTorbjörn VestbergReza JafariDebora SeghezziMartin IngvarMorten L. KringelbachAlberto FilgueirasPredrag PetrovicaDepartment of Clinical Medicine, Center for Music in the Brain, Aarhus University and The Royal Academy of Music, Aarhus, Aalborg 8000, DenmarkbCentre for Eudaimonia and Human Flourishing, Linacre College, University of Oxford, Oxford OX39BX, United KingdomcDepartment of Psychiatry, University of Oxford, Oxford OX37JX, United KingdomdDepartment of Psychology, University of Bologna, Bologna 40127, ItalyeDepartment of Clinical Neuroscience, Karolinska Institutet, Stockholm 17177, SwedenfCollege of Psychology, School of Health and Applied Sciences, Central Queensland University, Cairns 40939, AustraliagDepartment of Psychology, School of Education and Social Sciences, Rio de Janeiro State University, Riode, Janeiro 24435- 000, Brazil","guid":106,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 123, Issue 8, February 2026. </article>","contentLength":85,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Revisiting the cognitive advantages of professional soccer players","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2515523123?af=R","date":1771401600,"author":"Jack FitzgeraldNiklas JakobssonAbel BrodeuraDepartment of Ethics, Governance, and Society, Vrije Universiteit Amsterdam, Amsterdam 1081 HV, The NetherlandsbTinbergen Institute, Amsterdam 1082MS, The NetherlandscKarlstad Business School, Karlstad University, Karlstad 651 88, SwedendDepartment of Economics University of Ottawa, Ottawa, ON K1N 6N5, CanadaeInstitute for Replication, University of Ottawa, Ottawa, ON K1N 6N5, Canada","guid":107,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 123, Issue 8, February 2026. </article>","contentLength":85,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Gradience as a cognitive principle for evaluating numerical notations","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2522563123?af=R","date":1770969600,"author":"Stephen ChrisomalisaDepartment of Anthropology, Wayne State University, Detroit, MI 48202","guid":102,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 123, Issue 7, February 2026. SignificanceThis study presents a cognitive principle, gradience, for comparing the communicative efficiency of numerical notations, along with two indices for measuring gradience, jitter and inversion. In general, larger numbers require more signs than ...</article>","contentLength":342,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The psychological ability to adopt recommended coping responses reduced infections during the COVID-19 pandemic","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2415344123?af=R","date":1770710400,"author":"Lasse Hyldig HansenFrederik JørgensenMichael Bang PetersenaDepartment of Political Science, Aarhus University, Aarhus C DK-8000, Denmark","guid":104,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 123, Issue 7, February 2026. SignificanceDuring the COVID-19 pandemic, governments and authorities were criticized for engaging in excessive communication to make people aware of the threat posed by the virus. Such communication was argued to elicit unintended consequences in the ...</article>","contentLength":340,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Social information creates self-fulfilling prophecies in judgments of pain, vicarious pain, and cognitive effort","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2513856123?af=R","date":1770624000,"author":"Aryan YazdanpanahHeejung JungAlireza SoltaniTor D. WageraDepartment of Psychological and Brain Sciences, Dartmouth College, Hanover, NH 03755","guid":103,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 123, Issue 7, February 2026. SignificanceToday’s societies have become deeply intertwined through unprecedented connectivity and information exchange. Although social information can benefit decision-making at both the personal and policy levels, it also adversely impacts behavior ...</article>","contentLength":343,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Identifying genome-by-childhood trauma interactions for depression using a forest-based approach in the UK Biobank and Adolescent Brain Cognitive Development Study","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2527955123?af=R","date":1770364800,"author":"Yue HuJeffrey R. GruenHeping ZhangaDepartment of Biostatistics, Yale University School of Public Health, New Haven, CT 06520bDepartment of Pediatrics and of Genetics, Yale School of Medicine, New Haven, CT 06520","guid":96,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 123, Issue 6, February 2026. SignificanceDepression is a major public health challenge, yet its genetic basis has been difficult to clarify because risk also depends strongly on environmental exposures such as traumatic experiences. Past attempts to pinpoint single gene-by-...</article>","contentLength":333,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Sensory integration, temporal prediction, and rule discovery reflect interdependent inference processes","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2524629123?af=R","date":1770364800,"author":"Lucas BenjaminBenjamin MorillonValentin WyartaInstitut National de la Santé et de la Recherche Médicale, Institut de Neurosciences des Systèmes, Aix-Marseille Université, Marseille 13010, FrancebInstitut National de la Santé et de la Recherche Médicale, Laboratoire de Neurosciences Cognitives et Computationnelles, Paris 75005, FrancecDépartement d’Études Cognitives, École Normale Supérieure–Université Paris Sciences et Lettres, Paris 75005, France","guid":99,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 123, Issue 6, February 2026. SignificanceHumans routinely extract three types of information from stimulus sequences: their statistics, timing, and the rules that govern their generation. But do these three cognitive abilities interact? By examining how hundreds of individuals ...</article>","contentLength":337,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Ultrasonic vocal communication of negative affective states in laboratory mice","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2523233123?af=R","date":1770364800,"author":"Hideaki InagakiTakahiro UshidaaDepartment of Pain Medicine, Aichi Medical University, Nagakute, Aichi 480-1195, Japan","guid":100,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 123, Issue 6, February 2026. SignificanceAnimal models play an important role in the development and establishment of novel therapies for anxiety, one of the most common mental disorders. Here, we show that the social communication process in mice (ddY strain) using ultrasonic ...</article>","contentLength":337,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Dopaminergic mechanisms supporting hippocampal postencoding dynamics in humans","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2526799123?af=R","date":1770278400,"author":"Claire J. CiampaThomas M. MorinJourdan H. ParentAlex AdornatoJordyn L. CowanKatherine O’MalleyRachel E. MarcusCharlee GordonJames D. HowardArielle TambiniCristina CusinJacob HookerAnne S. BerryaPsychology Department, Brandeis University, Waltham, MA 02153bMartinos Center for Biomedical Imaging, Massachusetts General Hospital, Boston, MA 02129cNathan Kline Institute for Psychiatric Research, Orangeburg, NY 10962dDepression Clinical and Research Program, Massachusetts General Hospital, Boston, MA 02114eLife Sciences, Volen Center for Complex Systems, Brandeis University, Waltham, MA 02153","guid":98,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 123, Issue 6, February 2026. SignificanceThere is substantial interest in the mechanisms by which dopamine modulates motivated memory and hippocampal activity, and particularly in processes that occur after encoding. Through a combination of molecular imaging and pharmacological ...</article>","contentLength":339,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Reply to Cecchi and Palminteri: On the need to model temporal variation in learning rates","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2535857123?af=R","date":1770105600,"author":"Prakhar GodaraaDepartment of Psychology, New York University, New York, NY 10003","guid":94,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 123, Issue 6, February 2026. </article>","contentLength":85,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Genuine learning biases persist after accounting for temporally decreasing learning rates: Insight from fitting six datasets","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2534141123?af=R","date":1770105600,"author":"Romane CecchiStefano PalminteriaLaboratoire de Neurosciences Cognitives et Computationnelles, Département d’Études Cognitives, École Normale Supérieure, Université Paris Sciences et Lettres, INSERM U960, Paris 75005, France","guid":95,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 123, Issue 6, February 2026. </article>","contentLength":85,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Health-focused frames mobilize Americans to action to address LGBTQ inequality","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2527168123?af=R","date":1770019200,"author":"Pia DietzeRiana M. BrownMaureen A. CraigaDepartment of Psychology, University of California, Irvine, CA 92697bDepartment of Psychology, The Ohio State University, Columbus, OH 43210cDepartment of Psychology and Neuroscience, Duke University, Durham, NC 27708","guid":97,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 123, Issue 6, February 2026. SignificanceThis work investigates how exposure to different domains of LGBTQ (Lesbian, Gay, Bisexual, Transgender, and Queer) inequality (i.e., health, economic, belonging) influences Americans’ support for action. The findings reveal that emphasizing ...</article>","contentLength":343,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Toddlers expect ingroup loyalty to override personal preferences when outgroups are present","url":"https://www.pnas.org/doi/abs/10.1073/pnas.2521041123?af=R","date":1770019200,"author":"Lin BianRenée BaillargeonaDepartment of Psychology, University of Chicago, Chicago, IL 60637bDepartment of Psychology, University of Illinois Urbana-Champaign, Champaign, IL 61820","guid":101,"unread":true,"content":"<article>Proceedings of the National Academy of Sciences, Volume 123, Issue 6, February 2026. SignificanceIn the presence of outgroups, adults may set aside their personal preferences to align with perceived ingroup norms, in an outward show of loyalty. In three experiments, we demonstrate that 2-y-old toddlers expect such shows of loyalty. When ...</article>","contentLength":342,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["psychology","cognitive-neuroscience"]}