{"id":"MvwLKznkcWQN9B5XhvtYYH9ZVgoLzDnJ4pvELwbPp","title":"Nature Reviews Neuroscience","displayTitle":"Nature Reviews Neuroscience","url":"https://www.nature.com/nrn.rss","feedLink":"http://feeds.nature.com/nrn/rss/current","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":8,"items":[{"title":"Value-free teaching in action","url":"https://www.nature.com/articles/s41583-025-00938-x","date":1749168000,"author":"Jake Rogers","guid":15,"unread":true,"content":"Movement-related dopamine neuronal activity in the tail of the striatum encodes a value-free action prediction error that reinforces state-action associations, biasing mice to repeat past actions.","contentLength":196,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"An intriguing role of repeat-element RNAs in nerve injury repair","url":"https://www.nature.com/articles/s41583-025-00939-w","date":1749168000,"author":"Sian Lewis","guid":16,"unread":true,"content":"A polyA-tail-directed RNA sequencing approach that was used to investigate transcriptomic changes in dorsal root ganglia following nerve crush revealed unexpected upregulation of a specific set of B2-SINE transcriptional regulators that facilitate neuronal repair by co-ordinating axon transport and local translation.","contentLength":318,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Inflammation alters cognition after cancer immunotherapy","url":"https://www.nature.com/articles/s41583-025-00935-0","date":1748476800,"author":"Katherine Whalley","guid":14,"unread":true,"content":"Neuroinflammatory mechanisms drive cognitive impairments in mice treated with chimeric antigen receptor (CAR)-T cell therapy.","contentLength":125,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"On analogies in vertebrate and insect visual systems","url":"https://www.nature.com/articles/s41583-025-00932-3","date":1747958400,"author":"Ruben Portugues","guid":12,"unread":true,"content":"The visual systems of vertebrates and insects exhibit considerable similarities. In this Review, Tanaka and Portugues discuss these similarities, focusing primarily on recent works in larval zebrafish and fruitflies and expanding the scope of the comparison from past examinations of this area.","contentLength":294,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Sleuthing subjectivity: a review of covert measures of consciousness","url":"https://www.nature.com/articles/s41583-025-00934-1","date":1747958400,"author":"Javier Gonzalez-Castillo","guid":13,"unread":true,"content":"Consciousness may be inferred in others through observable behaviours such as facial expressions and vocalizations. However, such overt reporting has limitations, leading to research on physiological signals that disclose consciousness without relying on overt behaviour. In this Review, Kronemer, Bandettini and Gonzalez-Castillo explore such covert measures of consciousness in humans.","contentLength":387,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Neuroferroptosis in health and diseases","url":"https://www.nature.com/articles/s41583-025-00930-5","date":1747612800,"author":"Scott Ayton","guid":11,"unread":true,"content":"The brain’s high lipid content, iron levels and oxygen metabolism uniquely predispose it to ferroptosis, an iron-dependent form of regulated cell death. In this Review, Lei et al. discuss brain-specific vulnerabilities and the physiological and pathological implications of neuroferroptosis.","contentLength":293,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Brain mechanisms underlying the inhibitory control of thought","url":"https://www.nature.com/articles/s41583-025-00929-y","date":1747353600,"author":"S. Subbulakshmi","guid":9,"unread":true,"content":"The capacity to prevent unwanted thoughts is important for cognitive function and mental health. Anderson et al. describe insights into the neural mechanisms of the inhibitory control of thought that have been gained from studies of retrieval stopping and discuss how this knowledge informs our understanding of psychiatric disorders associated with intrusive thinking.","contentLength":369,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Indigenous representation in neuroscience scholarship, teaching and care","url":"https://www.nature.com/articles/s41583-025-00933-2","date":1747353600,"author":"Judy Illes","guid":10,"unread":true,"content":"Despite a global push to recognize Indigenous knowledge systems in research, neuroscience remains embedded in Euro-Western ways of means and methods. Authentic capacity-building will bring Indigenous ways of knowing and doing to the neuroscience workforce, to research and to training, and will lead to diversified and strengthened approaches to discovery and clinical care strategies.","contentLength":385,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["journal","cognitive-neuroscience","review"]}