{"id":"RGgukq5E6HBPFJjufoUYJruaRsywW184oHoggJ15PaGvCxL9r5A9rC2zG6wz1DJ8UHc72YzTu3ZpSwCk1ngovLAcNZKigi63bi1cLfd7UTgEvvBphMSqFJ8rkXAViSN","title":"SAGE Publications Inc: Current Directions in Psychological Science: Table of Contents","displayTitle":"Current Directions in Psychological Science","url":"https://journals.sagepub.com/action/showFeed?ui=0&mi=ehikzz&ai=2b4&jc=cdpa&type=etoc&feed=rss","feedLink":"https://journals.sagepub.com/loi/cdpa?ai=2b4&mi=ehikzz&af=R","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":4,"items":[{"title":"Generative Behaviors as Key Targets for Cognitive Models","url":"https://journals.sagepub.com/doi/abs/10.1177/09637214261416790?ai=2b4&mi=ehikzz&af=R","date":1771734510,"author":"Judith E. FanDepartment of Psychology, Stanford University","guid":395,"unread":true,"content":"<article>Current Directions in Psychological Science, Ahead of Print. Human behavior is fundamentally generative: People create pictures, write stories, compose music, and engage in conversation. Traditional approaches in psychology and cognitive science have not focused on this open-endedness, instead favoring more ...</article>","contentLength":312,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"From a Baby’s Point of View: How Infants’ Face Diets Shape Their Face Perception","url":"https://journals.sagepub.com/doi/abs/10.1177/09637214261416505?ai=2b4&mi=ehikzz&af=R","date":1771494878,"author":"Charisse B. Pickron, Laurie Bayet","guid":396,"unread":true,"content":"<article>Current Directions in Psychological Science, Ahead of Print. Individual variations in face-perception expertise become apparent by the second year of life. We propose that infants’ “face diet”—the nature and quantity of their visual interactions with faces—provides a useful lens for understanding how individual ...</article>","contentLength":326,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Using Artificial Intelligence to Better Understand Human Intelligence","url":"https://journals.sagepub.com/doi/abs/10.1177/09637214261417960?ai=2b4&mi=ehikzz&af=R","date":1770869857,"author":"Gordon Pennycook, Thomas H. Costello, David G. Rand","guid":397,"unread":true,"content":"<article>Current Directions in Psychological Science, Ahead of Print. A consistent pattern emerges from the history of psychology: Technological advances change the way that we understand ourselves. We argue that, in addition to various uses that are already common (e.g., qualitative coding), large language models can be ...</article>","contentLength":317,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Understanding, Predicting, and Preventing Suicide: Recent Advances Using Digital and Computational Methods","url":"https://journals.sagepub.com/doi/abs/10.1177/09637214251414021?ai=2b4&mi=ehikzz&af=R","date":1770461401,"author":"Matthew K. Nock, Shirley B. Wang","guid":398,"unread":true,"content":"<article>Current Directions in Psychological Science, Ahead of Print. Suicide is among the most perplexing of all human behaviors. It has been a leading cause of death for decades, and despite significant study it continues unabated. Over the past few years, the development of new digital and computational methods has ...</article>","contentLength":314,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["psychology","review"]}