{"id":"RGgukq5E6HBPFJjufoUYJruaRsywW184oHoggJ15PaGvCxL9r5A9rC2zG6wz1DJ8UHc72YzTu3ZpSwCk1ngovLAcNZKigi63sLXXzHDxj3tNWh7ySHipWQdD4ZcxC2e","title":"SAGE Publications Inc: Perspectives on Psychological Science: Table of Contents","displayTitle":"Perspectives on Psychological Science","url":"https://journals.sagepub.com/action/showFeed?ui=0&mi=ehikzz&ai=2b4&jc=ppsa&type=etoc&feed=rss","feedLink":"https://journals.sagepub.com/loi/ppsa?ai=2b4&mi=ehikzz&af=R","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":4,"items":[{"title":"People’s Responses to Nuclear Weapons: Mapping Post-Cold War Research","url":"https://journals.sagepub.com/doi/abs/10.1177/17456916251404895?ai=2b4&mi=ehikzz&af=R","date":1772097267,"author":"Astrid Kause, Helen Fischer, Zia Mian, Susan T. Fiske","guid":320,"unread":true,"content":"<article>Perspectives on Psychological Science, Ahead of Print. Nuclear weapon threats are increasing and may be comparable to levels not seen since the worst periods of the Cold War. There could be value in psychologists documenting and explaining people’s responses to nuclear weapons. More than 3 decades have passed ...</article>","contentLength":316,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Presence Is Reality: Rethinking Virtual and Real-World Consciousness","url":"https://journals.sagepub.com/doi/abs/10.1177/17456916251414030?ai=2b4&mi=ehikzz&af=R","date":1770704779,"author":"Oliver Singleton, Aikaterini FotopoulouClinical, Educational and Health Psychology Research Department, Division of Psychology and Language Sciences, University College London","guid":321,"unread":true,"content":"<article>Perspectives on Psychological Science, Ahead of Print. The sense of presence is typically defined as the feeling of “being there” in a virtual environment, whereas the sense of reality is defined as the ability to discriminate between real and unreal phenomena. We challenge this rigid dichotomy, arguing that ...</article>","contentLength":317,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Socioeconomic Status Disparities in Children’s Cognition—Differences in Degree or Kind?","url":"https://journals.sagepub.com/doi/abs/10.1177/17456916251409785?ai=2b4&mi=ehikzz&af=R","date":1770704213,"author":"Lingyan Hu, Martha J. Farah","guid":322,"unread":true,"content":"<article>Perspectives on Psychological Science, Ahead of Print. The “socioeconomic achievement gap” refers to socioeconomic disparities in children’s academic outcomes. Do these gaps invariably reflect cognitive processes that are similar in kind across the socioeconomic status (SES) spectrum but differ quantitatively ...</article>","contentLength":320,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Power, Privilege, and Positionality in Psychology Departments: Toward a Framework for Inclusive Excellence","url":"https://journals.sagepub.com/doi/abs/10.1177/17456916251404372?ai=2b4&mi=ehikzz&af=R","date":1770181910,"author":"Leher SinghDepartment of Psychology, University of Maryland, Baltimore County","guid":323,"unread":true,"content":"<article>Perspectives on Psychological Science, Ahead of Print. Although academic departments and institutions frequently champion ideals of egalitarianism and inclusion, many are defined by status hierarchies that can undermine their stated commitment to these ideals. This article examines the distinct and ...</article>","contentLength":303,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["psychology","review"]}