{"id":"RGgukq5E6HBPFJjufoUYJruaRsywW184oHoggJ15PaGvCxL9r5A9rC2zG6wz1DJ8UHc72YzTu3ZpSwCk1ngovLAcNZKigi63bi1cLfd7UTgEvvBphMSqFJ8rkXAViSN","title":"SAGE Publications Inc: Current Directions in Psychological Science: Table of Contents","displayTitle":"Current Directions in Psychological Science","url":"https://journals.sagepub.com/action/showFeed?ui=0&mi=ehikzz&ai=2b4&jc=cdpa&type=etoc&feed=rss","feedLink":"https://journals.sagepub.com/loi/cdpa?ai=2b4&mi=ehikzz&af=R","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":8,"items":[{"title":"Attending to Remember: Recent Advances in Methods and Theory","url":"https://journals.sagepub.com/doi/abs/10.1177/09637214251339452?ai=2b4&mi=ehikzz&af=R","date":1749104232,"author":"Shawn T. Schwartz, Haopei Yang, Alice M. Xue, Anthony D. Wagner","guid":565,"unread":true,"content":"<article>Current Directions in Psychological Science, Ahead of Print. The ability to learn from and remember experiences (episodic memory) depends on multiple neurocognitive systems. In this article, we highlight recent advances in methods and theory that are unveiling how mechanisms of attention impact episodic memory. We ...</article>","contentLength":319,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Three Promising Directions in the Study of Intelligence With Genetic Methods","url":"https://journals.sagepub.com/doi/abs/10.1177/09637214251339449?ai=2b4&mi=ehikzz&af=R","date":1748846354,"author":"James J. Lee, Damien Morris","guid":566,"unread":true,"content":"<article>Current Directions in Psychological Science, Ahead of Print. A genome-wide association study (GWAS) tests whether each of several million sites in the human genome is correlated with a trait of interest. For a number of reasons, including replication of GWAS results within families, we can be confident that ...</article>","contentLength":312,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Perceived Social Norms and Vaccine Hesitancy","url":"https://journals.sagepub.com/doi/abs/10.1177/09637214251340023?ai=2b4&mi=ehikzz&af=R","date":1748604425,"author":"Robert C. Dempsey, Alex M. Wood","guid":567,"unread":true,"content":"<article>Current Directions in Psychological Science, Ahead of Print. Vaccines are an important tool for preventing serious illness and avoiding deaths. Vaccine hesitancy, the delay or refusal of vaccines when available or offered, is one of the top 10 threats to global public health. The acceptance and uptake, delay, or ...</article>","contentLength":317,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Consequences of Bilingual Language Coactivation for Higher Order Cognition","url":"https://journals.sagepub.com/doi/abs/10.1177/09637214251339455?ai=2b4&mi=ehikzz&af=R","date":1747736347,"author":"Viorica Marian, Sayuri Hayakawa","guid":568,"unread":true,"content":"<article>Current Directions in Psychological Science, Ahead of Print. Hearing a single word can initiate a sequence of activation that spreads from the representation of the word (e.g., “candy”) to words that share auditory and visual form (e.g., “candle”) and the concepts those words reference (e.g., the idea of a “candle”)...</article>","contentLength":332,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Positive Affect Dynamics","url":"https://journals.sagepub.com/doi/abs/10.1177/09637214251339454?ai=2b4&mi=ehikzz&af=R","date":1747736213,"author":"Anthony D. Ong, Egon Dejonckheere, Nilàm Ram","guid":569,"unread":true,"content":"<article>Current Directions in Psychological Science, Ahead of Print. Positive affect is a fundamental component of well-being, influencing multiple domains of psychological and physical functioning. This article synthesizes empirical research on positive affect dynamics in naturalistic contexts, emphasizing their ...</article>","contentLength":310,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"How Can We Characterize Human Generalization and Distinguish It From Generalization in Machines?","url":"https://journals.sagepub.com/doi/abs/10.1177/09637214251336212?ai=2b4&mi=ehikzz&af=R","date":1747388008,"author":"Mirko Thalmann, Eric SchulzInstitute for Human-Centered AI at the Helmholtz Center for Computational Health – Helmholtz Munich, Neuherberg, Germany","guid":570,"unread":true,"content":"<article>Current Directions in Psychological Science, Ahead of Print. People appear to excel at generalization: They require little experience to generalize their knowledge to new situations. But can we confidently make such a conclusion? To make progress toward a better understanding, we characterize human generalization ...</article>","contentLength":318,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Corrigendum to “Interdependent Minds: Quantifying the Dynamics of Successful Social Interactions”","url":"https://journals.sagepub.com/doi/abs/10.1177/09637214251343551?ai=2b4&mi=ehikzz&af=R","date":1747297683,"author":"","guid":564,"unread":true,"content":"<article>Current Directions in Psychological Science, Ahead of Print. </article>","contentLength":61,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The Critical (and Neglected) Role of Effort in Emotion Regulation","url":"https://journals.sagepub.com/doi/abs/10.1177/09637214251318294?ai=2b4&mi=ehikzz&af=R","date":1747112885,"author":"Danfei Hu, Tony Gutentag, Iris B. Mauss, Maya Tamir","guid":571,"unread":true,"content":"<article>Current Directions in Psychological Science, Ahead of Print. When people feel bad, how much effort should they invest to make themselves feel better? Should they try harder, or might this even make matters worse? In other domains of self-regulation, effort contributes to goal-related behaviors and success. However, ...</article>","contentLength":320,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["journal","psychology","review"]}