{"id":"RGgukq5E6HBPFJjufoUYJruaRsywW184oHoggJ15PaGvCxL9r5A9rC2zG6wz1DJ8UHc72YzTu3ZpSwCk1ngovLAcNZKigi63sMLm4uzJD5UkAzkBT7FULU8bYBom4wC","title":"SAGE Publications Inc: Psychological Science: Table of Contents","displayTitle":"Psychological Science","url":"https://journals.sagepub.com/action/showFeed?ui=0&mi=ehikzz&ai=2b4&jc=pssa&type=etoc&feed=rss","feedLink":"https://journals.sagepub.com/loi/pssa?ai=2b4&mi=ehikzz&af=R","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"Agent Preference in Chasing Interactions in Guinea Baboons (Papio papio): Uncovering the Roots of Subject–Object Order in Language","url":"https://journals.sagepub.com/doi/abs/10.1177/09567976251344581?ai=2b4&mi=ehikzz&af=R","date":1749204728,"author":"Floor Meewis, Joël Fagot, Nicolas Claidière, Isabelle Dautriche","guid":561,"unread":true,"content":"<article>Psychological Science, Ahead of Print. Languages tend to describe “who is doing what to whom” by placing subjects before objects. This may reflect a bias for agents in event cognition: Agents capture more attention than patients in human adults and infants. We investigated whether this agent ...</article>","contentLength":300,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"On the Robustness and Provenance of the Gambler’s Fallacy","url":"https://journals.sagepub.com/doi/abs/10.1177/09567976251344570?ai=2b4&mi=ehikzz&af=R","date":1749106918,"author":"Yang Xiang, Kevin Dorst, Samuel J. Gershman","guid":557,"unread":true,"content":"<article>Psychological Science, Ahead of Print. The gambler’s fallacy is typically defined as the false belief that a random event is less likely to occur if it has occurred recently. Although forms of this fallacy have been documented numerous times, past work either has not actually measured ...</article>","contentLength":291,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Using the Nested Structure of Knowledge to Infer What Others Know","url":"https://journals.sagepub.com/doi/abs/10.1177/09567976251339633?ai=2b4&mi=ehikzz&af=R","date":1748501272,"author":"Edgar Dubourg, Thomas Dheilly, Hugo Mercier, Olivier MorinInstitut Jean Nicod, Département d’Études Cognitives, Ecole Normale Supérieure, Ecole des Hautes Études en Sciences Sociales, Université PSL, Centre National de la Recherche Scientifique (CNRS)","guid":558,"unread":true,"content":"<article>Psychological Science, Ahead of Print. Humans rely on more knowledgeable individuals to acquire information. But when we are ignorant, how are we to tell who is knowledgeable? We propose that human knowledge is nested: People who know only a few things tend to know very common pieces of ...</article>","contentLength":291,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Are There Really People With No Inner Voice? Commentary on Nedergaard and Lupyan (2024)","url":"https://journals.sagepub.com/doi/abs/10.1177/09567976251335583?ai=2b4&mi=ehikzz&af=R","date":1748339633,"author":"Andreas LindLund University Cognitive Science, Lund University","guid":556,"unread":true,"content":"<article>Psychological Science, Ahead of Print. The idea that some people completely lack inner speech is of both scientific and popular interest. In a recent study, Nedergaard and Lupyan compared self-reporting high and low inner-speech-prevalence groups and found that participants in the low-...</article>","contentLength":289,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"What We Think Others Think and Do About Climate Change: A Multicountry Test of Pluralistic Ignorance and Public-Consensus Messaging","url":"https://journals.sagepub.com/doi/abs/10.1177/09567976251335585?ai=2b4&mi=ehikzz&af=R","date":1747903553,"author":"Sandra J. Geiger, Jana K. Köhler, Zenith N. C. Delabrida, Karla A. Garduño-Realivazquez, Christian A. P. Haugestad, Hirotaka Imada, Aishwarya Iyer, Carya Maharja, Daniel C. Mann, Michalina Marczak, Olivia Melville, Sari R. R. Nijssen, Nattavudh Powdthavee, Radisti A. Praptiwi, Gargi Ranade, Claudio D. Rosa, Valeria Vitale, Małgorzata Winkowska, Lei Zhang, Mathew P. White","guid":559,"unread":true,"content":"<article>Psychological Science, Ahead of Print. Most people believe in human-caused climate change, yet this public consensus can be collectively underestimated (pluralistic ignorance). Across two studies using primary data (n= 3,653 adult participants; 11 countries) and secondary data (ns = 60,230 ...</article>","contentLength":294,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Economic Consequences of Numerical Adaptation","url":"https://journals.sagepub.com/doi/abs/10.1177/09567976251339195?ai=2b4&mi=ehikzz&af=R","date":1747718299,"author":"Michele Garagnani, Ferdinand M. Vieider","guid":560,"unread":true,"content":"<article>Psychological Science, Ahead of Print. Resource constraints in neural information processing imply that numerical discriminability optimally adapts to the frequency of numerical magnitudes in a decision maker’s environment. Here, we tested the economic consequences of efficient numerical range ...</article>","contentLength":300,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["journal","psychology"]}