{"id":"x7L2VSNEiyAJGtud3y69oo8X5Yu7UTGdrrATKd6xdinpKXPqHXYB5PwAm7nJVBn76sTY8qcH1NwExUJ","title":"Trends in Cognitive Sciences","displayTitle":"Trends in Cognitive Sciences","url":"https://www.cell.com/trends/cognitive-sciences/inpress.rss","feedLink":"https://www.cell.com/archive?publicationCode=tics&rss=yes","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":16,"items":[{"title":"The interoceptive origin of reinforcement learning","url":"https://www.cell.com/trends/cognitive-sciences/fulltext/S1364-6613(25)00120-2?rss=yes","date":1749513600,"author":"Lilian A. Weber, Debbie M. Yee, Dana M. Small, Frederike H. Petzschner","guid":68,"unread":true,"content":"<article>Rewards play a crucial role in sculpting all motivated behavior. Traditionally, research on reinforcement learning has centered on how rewards guide learning and decision-making. Here, we examine the origins of rewards themselves. Specifically, we discuss that the critical signal sustaining reinforcement for food is generated internally and subliminally during the process of digestion. As such, a shift in our understanding of primary rewards as an immediate sensory gratification to a state-dependent evaluation of an action’s impact on vital physiological processes is called for. We integrate this perspective into a revised reinforcement learning framework that recognizes the subliminal nature of biological rewards and their dependency on internal states and goals.</article>","contentLength":776,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Neural decoders: saving the baby from the bathwater","url":"https://www.cell.com/trends/cognitive-sciences/fulltext/S1364-6613(25)00077-4?rss=yes","date":1749168000,"author":"Sangil Lee, Andrew S. Kayser, Ming Hsu","guid":65,"unread":true,"content":"<article>In their recent article in TiCS, Vigotsky and colleagues [1] raise several critiques questioning the scientific and practical value of fMRI-based decoders. Most seriously, they argue that existing neural decoding methods inherently lack scientific validity due to the presence of nonspecific signals that confound the processes of interest. While they provide a valuable service by highlighting the insufficient attention paid to validity tests of decoding models, their statement that ‘decoding models cannot disentangle neural mechanisms from their epiphenomena’ represents an assumption rather than a fact and overlooks important ongoing efforts to identify and mitigate validity threats in decoding models.</article>","contentLength":714,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"fMRI decoders: unlike the baby, wishful thinking is alive and well","url":"https://www.cell.com/trends/cognitive-sciences/fulltext/S1364-6613(25)00117-2?rss=yes","date":1749168000,"author":"Andrew D. Vigotsky, Gian Domenico Iannetti, A. Vania Apkarian","guid":66,"unread":true,"content":"<article>We thank Lee et al. [1] for their interest in our work. Their main comment asserts that the ongoing efforts to improve the specificity (or discriminant validity) of fMRI decoding models undermine our statement that ‘decoding models cannot disentangle neural mechanisms from their epiphenomena’ [2]. Unfortunately, the specificity of fMRI decoding models – regardless of how impressive – has no bearing on their inherent inability to distinguish true neural mechanisms from their epiphenomena. Thus, Lee et al.’s assertion falls prey to the exact fallacies that we [2] and others [3] have already painstakingly detailed.</article>","contentLength":629,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Psychological distance to science","url":"https://www.cell.com/trends/cognitive-sciences/fulltext/S1364-6613(25)00121-4?rss=yes","date":1749168000,"author":"Bastiaan T. Rutjens","guid":67,"unread":true,"content":"<article>Psychological distance to science reflects how people perceive science from the perspective of the self. For many, science represents a distant endeavor that is irrelevant to day-to-day life. Research from my lab finds that distance to science correlates with, and predicts, science rejection across domains. Bringing science closer improves trust.</article>","contentLength":348,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Aphantasia as a functional disconnection","url":"https://www.cell.com/trends/cognitive-sciences/fulltext/S1364-6613(25)00124-X?rss=yes","date":1748995200,"author":"Jianghao Liu, Paolo Bartolomeo","guid":64,"unread":true,"content":"<article>Adam Zeman's recent review of mental imagery extremes [1] offers a thorough and balanced synthesis of current perspectives on aphantasia. Among the findings he discusses is a recent connectivity study [2] in which we found that individuals with aphantasia showed typical activation of high-level visual cortices during imagery tasks but reduced functional connectivity between the left fusiform imagery node (FIN) [3] and left frontoparietal regions. Zeman suggests that such alterations in network interactions may provide a promising neural basis for aphantasia.</article>","contentLength":564,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Physics versus graphics as an organizing dichotomy in cognition","url":"https://www.cell.com/trends/cognitive-sciences/fulltext/S1364-6613(25)00116-0?rss=yes","date":1748649600,"author":"Halely Balaban, Tomer D. Ullman","guid":63,"unread":true,"content":"<article>People build world models that simulate the dynamics of the real world. They do so in engineered systems for the purposes of scientific understanding or recreation, as well as in intuitive reasoning to predict and explain the environment. On the basis of a major split in the simulation of real-time dynamics in engineered systems, we argue that people's intuitive mental simulation includes a basic split between physical simulation and graphical rendering. We first show how the separation between physics and graphics relies on a natural division of labor in any cognitive system. We then use the physics/graphics distinction to tie together and explain a range of classic and recent findings across different domains in cognitive science and neuroscience, including aphantasia and imagery, different visual streams, and object tracking.</article>","contentLength":840,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The brain bases of emotion generation and emotion regulation","url":"https://www.cell.com/trends/cognitive-sciences/fulltext/S1364-6613(25)00112-3?rss=yes","date":1748476800,"author":"Jin-Xiao Zhang, Ke Bo, Tor D. Wager, James J. Gross","guid":62,"unread":true,"content":"<article>Emotion generation and emotion regulation are widely seen as functionally distinct. This distinction has inspired efforts to define separable brain bases of each, with emotion generation thought to involve mainly subcortical structures such as the amygdala, and emotion regulation thought to involve mainly cortical regions such as fronto-parietal cortices. However, emerging findings challenge strong neural separability accounts, revealing substantial overlap between brain systems underlying emotion generation and emotion regulation. In this opinion article we review evidence that supports and challenges neural separability. Based on this evidence, we propose an updated neural account using a valuation-systems perspective that incorporates both common and distinct brain bases of emotion generation and emotion regulation. Finally, we discuss implications for next-generation study designs, methods, and clinical interventions.</article>","contentLength":935,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Unpacking the dynamic role of physical effort in shaping behavior","url":"https://www.cell.com/trends/cognitive-sciences/fulltext/S1364-6613(25)00111-1?rss=yes","date":1748390400,"author":"Boris Cheval, Silvio Maltagliati, Florent Desplanques, Wanja Wolff","guid":61,"unread":true,"content":"<article>Effort plays a crucial role in shaping behavior. We propose that physical effort – and its perception – modulates people’s engagement across different stages of behavioral regulation: before, during, and after engagement. We demonstrate that individuals tend to avoid effort before engagement, minimize effort during task performance, and derive a sense of reward from effort after engagement due to an effort-justification mechanism. This dynamic and stage-specific approach moves beyond static models of effort (de)valuation, offering a more nuanced understanding of how effort shapes behavior. Focusing on physical activity, we explore how these specific effort-related mechanisms could promote physical activity by fostering conditions where individuals engage in active behaviors because of the potential rewards effort brings, despite its associated cost.</article>","contentLength":867,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Conjunctive or context-invariant coding in the human hippocampus?","url":"https://www.cell.com/trends/cognitive-sciences/fulltext/S1364-6613(25)00118-4?rss=yes","date":1748304000,"author":"Rodrigo Quian Quiroga","guid":60,"unread":true,"content":"<article>Concept cells are neurons in the human hippocampal formation with selective and invariant responses to specific individuals or objects. They have been proposed to be the building blocks of episodic memories and show context-invariant coding, in contrast to the conjunctive, context-dependent coding described in other species, with neurons responding to conjunctions of features related to specific memories, significantly changing their firing when varying the context [1,2]. In a recent article in TiCS [3], Kolibius and colleagues proposed a memory model based on ‘index neurons’ and conjunctive coding, linked this model with engram theory, and argued that concept cells arise from index neurons.</article>","contentLength":704,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A high-dimensional model of social impressions","url":"https://www.cell.com/trends/cognitive-sciences/fulltext/S1364-6613(25)00110-X?rss=yes","date":1748217600,"author":"Jonathan B. Freeman, Chujun Lin","guid":59,"unread":true,"content":"<article>People form social impressions from visual cues such as faces, which are argued by various models to arise from some limited set of fixed dimensions (e.g., trustworthiness and dominance). We argue that these dimensions, rather than reflecting intrinsic mechanisms, emerge from adaptive visuo-semantic processes in a high-dimensional neural-state space. Drawing on attractor neural-network models, we propose a framework treating social impressions as dynamic trajectories that stabilize over time, influenced not only by visual cues but also by conceptual associations and higher-order social cognition. Unlike low-dimensional models, this framework can account for cultural, individual, and situational factors that shape impressions. A high-dimensional framework makes several novel predictions and can offer a more accurate and complete understanding of the fluidity and complexity of social perception.</article>","contentLength":906,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Covert orienting: the dark matter of social attention","url":"https://www.cell.com/trends/cognitive-sciences/fulltext/S1364-6613(25)00113-5?rss=yes","date":1747872000,"author":"Tom Foulsham, Alan Kingstone","guid":57,"unread":true,"content":"<article>Covert visual attention is often seen as a lab phenomenon. Yet, in real-life, people routinely shift their attention to others without moving their eyes, a fact overlooked in most research. To truly understand natural behaviour, we must look beyond the eyes and illuminate this dark matter of social attention.</article>","contentLength":310,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Defending the foundation model view of infant development","url":"https://www.cell.com/trends/cognitive-sciences/fulltext/S1364-6613(25)00119-6?rss=yes","date":1747872000,"author":"Rhodri Cusack, Cliona O’Doherty, Christine J. Charvet, Marc’Aurelio Ranzato","guid":58,"unread":true,"content":"<article>In response to the opinion article by Cusack et al. [1], Zettersten et al. [2] challenge the proposal that human infants undergo a stage-like development from sensory to goal-directed actions. Zettersten et al. depict the foundation model theory as one in which infants passively learn statistical regularities and are not capable of motivations, but it was not our intention to rule out motivations. In practice, the objective function that drives learning in a foundation model can codify rich motivation such as a curiosity for surprising things [3].</article>","contentLength":553,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The ubiquity of episodic-like memory during infancy","url":"https://www.cell.com/trends/cognitive-sciences/fulltext/S1364-6613(25)00082-8?rss=yes","date":1747785600,"author":"Lillian Behm, Nicholas B. Turk-Browne, Melissa M. Kibbe","guid":56,"unread":true,"content":"<article>Considerable progress has been made in understanding early memory development. However, much of this research pre-dates contemporary theories of memory systems in the mature brain. This review provides a refresher on these conceptual frameworks and proposes a common theoretical foundation for reconciling adult and infant studies. This foundation enables a critical analysis of infant studies that have directly tested memory and suggests that they may not capture the full nature and extent of episodic memory abilities in infancy. The analysis is extended to infant studies that are ostensibly focused on cognitive domains other than memory and finds that many such tasks require episodic-like memory. Thus, there may be substantially more evidence for episodic-like memory in infants than previously recognized.</article>","contentLength":815,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"The value of ecologically irrelevant animal cognition research","url":"https://www.cell.com/trends/cognitive-sciences/fulltext/S1364-6613(25)00078-6?rss=yes","date":1747612800,"author":"Scarlett R. Howard","guid":54,"unread":true,"content":"<article>Animal cognition research is often firmly grounded in the ecology and life history of the species. However, there are many studies exploring cognitive tasks that appear ecologically irrelevant. Ecologically irrelevant experiments are cognitive tests lacking clear ecological context in their inspiration, design, and applications. Here, I explore the case for and against ecologically irrelevant cognitive research. I discuss the challenges associated with defining and conducting ecologically irrelevant cognitive research and provide potential solutions for tackling these issues. I pose the question of whether any animal cognition research can be considered completely ecologically irrelevant. My goal is to argue that there is a place for both ecological relevance and irrelevance in the study of animal cognition.</article>","contentLength":819,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"A timeline of cognitive costs in decision-making","url":"https://www.cell.com/trends/cognitive-sciences/fulltext/S1364-6613(25)00083-X?rss=yes","date":1747612800,"author":"Christin Schulze, Ada Aka, Daniel M. Bartels, Stefan F. Bucher, Jake R. Embrey, Todd M. Gureckis, Gerald Häubl, Mark K. Ho, Ian Krajbich, Alexander K. Moore, Gabriele Oettingen, Joan D.K. Ongchoco, Ryan Oprea, Nicholas Reinholtz, Ben R. Newell","guid":55,"unread":true,"content":"<article>Recent research from economics, psychology, cognitive science, computer science, and marketing is increasingly interested in the idea that people face cognitive costs when making decisions. Reviewing and synthesizing this research, we develop a framework of cognitive costs that organizes concepts along a temporal dimension and maps out when costs occur in the decision-making process and how they impact decisions. Our unifying framework broadens the scope of research on cognitive costs to a wider timeline of cognitive processing. We identify implications and recommendations emerging from our framework for intervening on behavior to tackle some of the most pressing issues of our day, from improving health and saving decisions to mitigating the consequences of climate change.</article>","contentLength":783,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Synchrony and subjective experience: the neural correlates of the stream of consciousness","url":"https://www.cell.com/trends/cognitive-sciences/fulltext/S1364-6613(25)00086-5?rss=yes","date":1747267200,"author":"Matthew D. Lieberman","guid":53,"unread":true,"content":"<article>Human subjectivity, our first-person conscious experience of the world, is among the deepest scientific mysteries. This opinion article lays out an approach to examining the neural correlates of subjectivity as it unfolds over time. Subjective experience is inherently idiosyncratic, arising from effortless interpretations that feel like perceived facts (p-interpretations), and integrative, with past and expected future moments influencing the current experience. Differential synchrony effects (i.e., neural synchrony that differs between groups) suggest that parts of gestalt cortex (inferior parietal lobule and posterior temporal cortex) and posterior medial cortex track p-interpretations. Differential synchrony may result from each person’s preexisting idiosyncratic non-sensory representations (e.g., expectations, memories, motivations) being integrated with sensory inputs to yield unique meaning-infused immediate experiences across the stream of consciousness.</article>","contentLength":977,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null}],"tags":["journal","cognitive-neuroscience","review"]}